Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
/*
; stm32V873_hrtim.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_hrtim equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// HRTIM address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    MCR;
    volatile    uint32_t    MISR;
    volatile    uint32_t    MICR;
    volatile    uint32_t    MDIER;
    volatile    uint32_t    MCNTR;
    volatile    uint32_t    MPER;
    volatile    uint32_t    MREP;
    volatile    uint32_t    MCMP1R;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    MCMP2R;
    volatile    uint32_t    MCMP3R;
    volatile    uint32_t    MCMP4R;
    volatile    uint32_t    RESERVED1[20];
    volatile    uint32_t    TIMACR;
    volatile    uint32_t    TIMAISR;
    volatile    uint32_t    TIMAICR;
    volatile    uint32_t    TIMADIER;
    volatile    uint32_t    CNTAR;
    volatile    uint32_t    PERAR;
    volatile    uint32_t    REPAR;
    volatile    uint32_t    CMP1AR;
    volatile    uint32_t    CMP1CAR;
    volatile    uint32_t    CMP2AR;
    volatile    uint32_t    CMP3AR;
    volatile    uint32_t    CMP4AR;
    volatile    uint32_t    CPT1AR;
    volatile    uint32_t    CPT2AR;
    volatile    uint32_t    DTAR;
    volatile    uint32_t    SETA1R;
    volatile    uint32_t    RSTA1R;
    volatile    uint32_t    SETA2R;
    volatile    uint32_t    RSTA2R;
    volatile    uint32_t    EEFAR1;
    volatile    uint32_t    EEFAR2;
    volatile    uint32_t    RSTAR;
    volatile    uint32_t    CHPAR;
    volatile    uint32_t    CPT1ACR;
    volatile    uint32_t    CPT2ACR;
    volatile    uint32_t    OUTAR;
    volatile    uint32_t    FLTAR;
    volatile    uint32_t    TIMACR2;
    volatile    uint32_t    TIMAEEFR3;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    TIMBCR;
    volatile    uint32_t    TIMBISR;
    volatile    uint32_t    TIMBICR;
    volatile    uint32_t    TIMBDIER;
    volatile    uint32_t    CNTBR;
    volatile    uint32_t    PERBR;
    volatile    uint32_t    REPBR;
    volatile    uint32_t    CMP1BR;
    volatile    uint32_t    CMP1CBR;
    volatile    uint32_t    CMP2BR;
    volatile    uint32_t    CMP3BR;
    volatile    uint32_t    CMP4BR;
    volatile    uint32_t    CPT1BR;
    volatile    uint32_t    CPT2BR;
    volatile    uint32_t    DTBR;
    volatile    uint32_t    SETB1R;
    volatile    uint32_t    RSTB1R;
    volatile    uint32_t    SETB2R;
    volatile    uint32_t    RSTB2R;
    volatile    uint32_t    EEFBR1;
    volatile    uint32_t    EEFBR2;
    volatile    uint32_t    RSTBR;
    volatile    uint32_t    CHPBR;
    volatile    uint32_t    CPT1BCR;
    volatile    uint32_t    CPT2BCR;
    volatile    uint32_t    OUTBR;
    volatile    uint32_t    FLTBR;
    volatile    uint32_t    TIMBCR2;
    volatile    uint32_t    TIMBEEFR3;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    TIMCCR;
    volatile    uint32_t    TIMCISR;
    volatile    uint32_t    TIMCICR;
    volatile    uint32_t    TIMCDIER;
    volatile    uint32_t    CNTCR;
    volatile    uint32_t    PERCR;
    volatile    uint32_t    REPCR;
    volatile    uint32_t    CMP1CR;
    volatile    uint32_t    CMP1CCR;
    volatile    uint32_t    CMP2CR;
    volatile    uint32_t    CMP3CR;
    volatile    uint32_t    CMP4CR;
    volatile    uint32_t    CPT1CR;
    volatile    uint32_t    CPT2CR;
    volatile    uint32_t    DTCR;
    volatile    uint32_t    SETC1R;
    volatile    uint32_t    RSTC1R;
    volatile    uint32_t    SETC2R;
    volatile    uint32_t    RSTC2R;
    volatile    uint32_t    EEFCR1;
    volatile    uint32_t    EEFCR2;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    CHPCR;
    volatile    uint32_t    CPT1CCR;
    volatile    uint32_t    CPT2CCR;
    volatile    uint32_t    OUTCR;
    volatile    uint32_t    FLTCR;
    volatile    uint32_t    TIMCCR2;
    volatile    uint32_t    TIMCEEFR3;
    volatile    uint32_t    RESERVED5[3];
    volatile    uint32_t    TIMDCR;
    volatile    uint32_t    TIMDISR;
    volatile    uint32_t    TIMDICR;
    volatile    uint32_t    TIMDDIER;
    volatile    uint32_t    CNTDR;
    volatile    uint32_t    PERDR;
    volatile    uint32_t    REPDR;
    volatile    uint32_t    CMP1DR;
    volatile    uint32_t    CMP1CDR;
    volatile    uint32_t    CMP2DR;
    volatile    uint32_t    CMP3DR;
    volatile    uint32_t    CMP4DR;
    volatile    uint32_t    CPT1DR;
    volatile    uint32_t    CPT2DR;
    volatile    uint32_t    DTDR;
    volatile    uint32_t    SETD1R;
    volatile    uint32_t    RSTD1R;
    volatile    uint32_t    SETD2R;
    volatile    uint32_t    RSTD2R;
    volatile    uint32_t    EEFDR1;
    volatile    uint32_t    EEFDR2;
    volatile    uint32_t    RSTDR;
    volatile    uint32_t    CHPDR;
    volatile    uint32_t    CPT1DCR;
    volatile    uint32_t    CPT2DCR;
    volatile    uint32_t    OUTDR;
    volatile    uint32_t    FLTDR;
    volatile    uint32_t    TIMDCR2;
    volatile    uint32_t    TIMDEEFR3;
    volatile    uint32_t    RESERVED6[3];
    volatile    uint32_t    TIMECR;
    volatile    uint32_t    TIMEISR;
    volatile    uint32_t    TIMEICR;
    volatile    uint32_t    TIMEDIER;
    volatile    uint32_t    CNTER;
    volatile    uint32_t    PERER;
    volatile    uint32_t    REPER;
    volatile    uint32_t    CMP1ER;
    volatile    uint32_t    CMP1CER;
    volatile    uint32_t    CMP2ER;
    volatile    uint32_t    CMP3ER;
    volatile    uint32_t    CMP4ER;
    volatile    uint32_t    CPT1ER;
    volatile    uint32_t    CPT2ER;
    volatile    uint32_t    DTER;
    volatile    uint32_t    SETE1R;
    volatile    uint32_t    RSTE1R;
    volatile    uint32_t    SETE2R;
    volatile    uint32_t    RSTE2R;
    volatile    uint32_t    EEFER1;
    volatile    uint32_t    EEFER2;
        union {
    volatile    uint32_t    RSTCR;
    volatile    uint32_t    RSTER;
        };
    volatile    uint32_t    CHPER;
    volatile    uint32_t    CPT1ECR;
    volatile    uint32_t    CPT2ECR;
    volatile    uint32_t    OUTER;
    volatile    uint32_t    FLTER;
    volatile    uint32_t    TIMECR2;
    volatile    uint32_t    TIMEEEFR3;
    volatile    uint32_t    RESERVED7[3];
    volatile    uint32_t    TIMFCR;
    volatile    uint32_t    TIMFISR;
    volatile    uint32_t    TIMFICR;
    volatile    uint32_t    TIMFDIER;
    volatile    uint32_t    CNTFR;
    volatile    uint32_t    PERFR;
    volatile    uint32_t    REPFR;
    volatile    uint32_t    CMP1FR;
    volatile    uint32_t    CMP1CFR;
    volatile    uint32_t    CMP2FR;
    volatile    uint32_t    CMP3FR;
    volatile    uint32_t    CMP4FR;
    volatile    uint32_t    CPT1FR;
    volatile    uint32_t    CPT2FR;
    volatile    uint32_t    DTFR;
    volatile    uint32_t    SETF1R;
    volatile    uint32_t    RSTF1R;
    volatile    uint32_t    SETF2R;
    volatile    uint32_t    RSTF2R;
    volatile    uint32_t    EEFFR1;
    volatile    uint32_t    EEFFR2;
    volatile    uint32_t    RSTFR;
    volatile    uint32_t    CHPFR;
    volatile    uint32_t    CPT1FCR;
    volatile    uint32_t    CPT2FCR;
    volatile    uint32_t    OUTFR;
    volatile    uint32_t    FLTFR;
    volatile    uint32_t    TIMFCR2;
    volatile    uint32_t    TIMFEEFR3;
    volatile    uint32_t    RESERVED8[3];
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    ISR;
    volatile    uint32_t    ICR;
    volatile    uint32_t    IER;
    volatile    uint32_t    OENR;
    volatile    uint32_t    ODISR;
    volatile    uint32_t    ODSR;
    volatile    uint32_t    BMCR;
    volatile    uint32_t    BMTRGR;
    volatile    uint32_t    BMCMPR;
    volatile    uint32_t    BMPER;
    volatile    uint32_t    EECR1;
    volatile    uint32_t    EECR2;
    volatile    uint32_t    EECR3;
    volatile    uint32_t    ADC1R;
    volatile    uint32_t    ADC2R;
    volatile    uint32_t    ADC3R;
    volatile    uint32_t    ADC4R;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    FLTINR1;
    volatile    uint32_t    FLTINR2;
    volatile    uint32_t    BDMUPR;
    volatile    uint32_t    BDTAUPR;
    volatile    uint32_t    BDTBUPR;
    volatile    uint32_t    BDTCUPR;
    volatile    uint32_t    BDTDUPR;
    volatile    uint32_t    BDTEUPR;
    volatile    uint32_t    BDMADR;
    volatile    uint32_t    BDTFUPR;
    volatile    uint32_t    ADCER;
    volatile    uint32_t    ADCUR;
    volatile    uint32_t    ADCPS1;
    volatile    uint32_t    ADCPS2;
    volatile    uint32_t    FLTINR3;
    volatile    uint32_t    FLTINR4;
} HRTIM_TypeDef;

#if (defined(__cplusplus))
#define HRTIM_NS    reinterpret_cast<HRTIM_TypeDef *>(0x42007400u)
#define HRTIM_S     reinterpret_cast<HRTIM_TypeDef *>(0x52007400u)

#else
#define HRTIM_NS    ((HRTIM_TypeDef *)0x42007400u)
#define HRTIM_S     ((HRTIM_TypeDef *)0x52007400u)
#endif

