Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// MCR Configuration

#define HRTIM_MCR_BRSTDMA               (0x3u<<30)
#define HRTIM_MCR_BRSTDMA_0             (0x1u<<30)
#define HRTIM_MCR_MREPU                 (0x1u<<29)
#define HRTIM_MCR_PREEN                 (0x1u<<27)
#define HRTIM_MCR_DACSYNC               (0x3u<<25)
#define HRTIM_MCR_DACSYNC_0             (0x1u<<25)
#define HRTIM_MCR_TFCEN                 (0x1u<<22)
#define HRTIM_MCR_TECEN                 (0x1u<<21)
#define HRTIM_MCR_TDCEN                 (0x1u<<20)
#define HRTIM_MCR_TCCEN                 (0x1u<<19)
#define HRTIM_MCR_TBCEN                 (0x1u<<18)
#define HRTIM_MCR_TACEN                 (0x1u<<17)
#define HRTIM_MCR_MCEN                  (0x1u<<16)
#define HRTIM_MCR_SYNCSRC               (0x3u<<14)
#define HRTIM_MCR_SYNCSRC_0             (0x1u<<14)
#define HRTIM_MCR_SYNCOUT               (0x3u<<12)
#define HRTIM_MCR_SYNCOUT_0             (0x1u<<12)
#define HRTIM_MCR_SYNCSTRTM             (0x1u<<11)
#define HRTIM_MCR_SYNCRSTM              (0x1u<<10)
#define HRTIM_MCR_SYNCIN                (0x3u<<8)
#define HRTIM_MCR_SYNCIN_0              (0x1u<<8)
#define HRTIM_MCR_INTLVD                (0x3u<<6)
#define HRTIM_MCR_INTLVD_0              (0x1u<<6)
#define HRTIM_MCR_HALF                  (0x1u<<5)
#define HRTIM_MCR_RETRIG                (0x1u<<4)
#define HRTIM_MCR_CONT                  (0x1u<<3)
#define HRTIM_MCR_CKPSC                 (0x7u<<0)
#define HRTIM_MCR_CKPSC_0               (0x1u<<0)

#define HRTIM_MCR_BRSTDMA_B_0X0         (0x0u<<30)
#define HRTIM_MCR_BRSTDMA_B_0X1         (0x1u<<30)
#define HRTIM_MCR_BRSTDMA_B_0X2         (0x2u<<30)
#define HRTIM_MCR_MREPU_B_0X0           (0x0u<<29)
#define HRTIM_MCR_MREPU_B_0X1           (0x1u<<29)
#define HRTIM_MCR_PREEN_B_0X0           (0x0u<<27)
#define HRTIM_MCR_PREEN_B_0X1           (0x1u<<27)
#define HRTIM_MCR_DACSYNC_B_0X0         (0x0u<<25)
#define HRTIM_MCR_DACSYNC_B_0X1         (0x1u<<25)
#define HRTIM_MCR_DACSYNC_B_0X2         (0x2u<<25)
#define HRTIM_MCR_DACSYNC_B_0X3         (0x3u<<25)
#define HRTIM_MCR_TFCEN_B_0X0           (0x0u<<22)
#define HRTIM_MCR_TFCEN_B_0X1           (0x1u<<22)
#define HRTIM_MCR_TECEN_B_0X0           (0x0u<<21)
#define HRTIM_MCR_TECEN_B_0X1           (0x1u<<21)
#define HRTIM_MCR_TDCEN_B_0X0           (0x0u<<20)
#define HRTIM_MCR_TDCEN_B_0X1           (0x1u<<20)
#define HRTIM_MCR_TCCEN_B_0X0           (0x0u<<19)
#define HRTIM_MCR_TCCEN_B_0X1           (0x1u<<19)
#define HRTIM_MCR_TBCEN_B_0X0           (0x0u<<18)
#define HRTIM_MCR_TBCEN_B_0X1           (0x1u<<18)
#define HRTIM_MCR_TACEN_B_0X0           (0x0u<<17)
#define HRTIM_MCR_TACEN_B_0X1           (0x1u<<17)
#define HRTIM_MCR_MCEN_B_0X0            (0x0u<<16)
#define HRTIM_MCR_MCEN_B_0X1            (0x1u<<16)
#define HRTIM_MCR_SYNCSRC_B_0X0         (0x0u<<14)
#define HRTIM_MCR_SYNCSRC_B_0X1         (0x1u<<14)
#define HRTIM_MCR_SYNCSRC_B_0X2         (0x2u<<14)
#define HRTIM_MCR_SYNCSRC_B_0X3         (0x3u<<14)
#define HRTIM_MCR_SYNCOUT_B_0X0         (0x0u<<12)
#define HRTIM_MCR_SYNCOUT_B_0X2         (0x2u<<12)
#define HRTIM_MCR_SYNCOUT_B_0X3         (0x3u<<12)
#define HRTIM_MCR_SYNCSTRTM_B_0X0       (0x0u<<11)
#define HRTIM_MCR_SYNCSTRTM_B_0X1       (0x1u<<11)
#define HRTIM_MCR_SYNCRSTM_B_0X0        (0x0u<<10)
#define HRTIM_MCR_SYNCRSTM_B_0X1        (0x1u<<10)
#define HRTIM_MCR_SYNCIN_B_0X0          (0x0u<<8)
#define HRTIM_MCR_SYNCIN_B_0X2          (0x2u<<8)
#define HRTIM_MCR_SYNCIN_B_0X3          (0x3u<<8)
#define HRTIM_MCR_INTLVD_B_0X0          (0x0u<<6)
#define HRTIM_MCR_INTLVD_B_0X1          (0x1u<<6)
#define HRTIM_MCR_INTLVD_B_0X2          (0x2u<<6)
#define HRTIM_MCR_INTLVD_B_0X3          (0x3u<<6)
#define HRTIM_MCR_HALF_B_0X0            (0x0u<<5)
#define HRTIM_MCR_HALF_B_0X1            (0x1u<<5)
#define HRTIM_MCR_RETRIG_B_0X0          (0x0u<<4)
#define HRTIM_MCR_RETRIG_B_0X1          (0x1u<<4)
#define HRTIM_MCR_CONT_B_0X0            (0x0u<<3)
#define HRTIM_MCR_CONT_B_0X1            (0x1u<<3)

// MISR Configuration

#define HRTIM_MISR_MUPD                 (0x1u<<6)
#define HRTIM_MISR_SYNC                 (0x1u<<5)
#define HRTIM_MISR_MREP                 (0x1u<<4)
#define HRTIM_MISR_MCMP4                (0x1u<<3)
#define HRTIM_MISR_MCMP3                (0x1u<<2)
#define HRTIM_MISR_MCMP2                (0x1u<<1)
#define HRTIM_MISR_MCMP1                (0x1u<<0)

#define HRTIM_MISR_MUPD_B_0X0           (0x0u<<6)
#define HRTIM_MISR_MUPD_B_0X1           (0x1u<<6)
#define HRTIM_MISR_SYNC_B_0X0           (0x0u<<5)
#define HRTIM_MISR_SYNC_B_0X1           (0x1u<<5)
#define HRTIM_MISR_MREP_B_0X0           (0x0u<<4)
#define HRTIM_MISR_MREP_B_0X1           (0x1u<<4)
#define HRTIM_MISR_MCMP1_B_0X0          (0x0u<<0)
#define HRTIM_MISR_MCMP1_B_0X1          (0x1u<<0)

// MICR Configuration

#define HRTIM_MICR_MUPDC                (0x1u<<6)
#define HRTIM_MICR_SYNCC                (0x1u<<5)
#define HRTIM_MICR_MREPC                (0x1u<<4)
#define HRTIM_MICR_MCMP4C               (0x1u<<3)
#define HRTIM_MICR_MCMP3C               (0x1u<<2)
#define HRTIM_MICR_MCMP2C               (0x1u<<1)
#define HRTIM_MICR_MCMP1C               (0x1u<<0)

// MDIER Configuration

#define HRTIM_MDIER_MUPDDE              (0x1u<<22)
#define HRTIM_MDIER_SYNCDE              (0x1u<<21)
#define HRTIM_MDIER_MREPDE              (0x1u<<20)
#define HRTIM_MDIER_MCMP4DE             (0x1u<<19)
#define HRTIM_MDIER_MCMP3DE             (0x1u<<18)
#define HRTIM_MDIER_MCMP2DE             (0x1u<<17)
#define HRTIM_MDIER_MCMP1DE             (0x1u<<16)
#define HRTIM_MDIER_MUPDIE              (0x1u<<6)
#define HRTIM_MDIER_SYNCIE              (0x1u<<5)
#define HRTIM_MDIER_MREPIE              (0x1u<<4)
#define HRTIM_MDIER_MCMP4IE             (0x1u<<3)
#define HRTIM_MDIER_MCMP3IE             (0x1u<<2)
#define HRTIM_MDIER_MCMP2IE             (0x1u<<1)
#define HRTIM_MDIER_MCMP1IE             (0x1u<<0)

#define HRTIM_MDIER_MUPDDE_B_0X0        (0x0u<<22)
#define HRTIM_MDIER_MUPDDE_B_0X1        (0x1u<<22)
#define HRTIM_MDIER_SYNCDE_B_0X0        (0x0u<<21)
#define HRTIM_MDIER_SYNCDE_B_0X1        (0x1u<<21)
#define HRTIM_MDIER_MREPDE_B_0X0        (0x0u<<20)
#define HRTIM_MDIER_MREPDE_B_0X1        (0x1u<<20)
#define HRTIM_MDIER_MCMP1DE_B_0X0       (0x0u<<16)
#define HRTIM_MDIER_MCMP1DE_B_0X1       (0x1u<<16)
#define HRTIM_MDIER_MUPDIE_B_0X0        (0x0u<<6)
#define HRTIM_MDIER_MUPDIE_B_0X1        (0x1u<<6)
#define HRTIM_MDIER_SYNCIE_B_0X0        (0x0u<<5)
#define HRTIM_MDIER_SYNCIE_B_0X1        (0x1u<<5)
#define HRTIM_MDIER_MREPIE_B_0X0        (0x0u<<4)
#define HRTIM_MDIER_MREPIE_B_0X1        (0x1u<<4)
#define HRTIM_MDIER_MCMP1IE_B_0X0       (0x0u<<0)
#define HRTIM_MDIER_MCMP1IE_B_0X1       (0x1u<<0)

// MCNTR Configuration

#define HRTIM_MCNTR_MCNT                (0xFFFFu<<0)
#define HRTIM_MCNTR_MCNT_0              (0x1u<<0)

// MPER Configuration

#define HRTIM_MPER_MPER                 (0xFFFFu<<0)
#define HRTIM_MPER_MPER_0               (0x1u<<0)

