Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// MREP Configuration

#define HRTIM_MREP_MREP                 (0xFFu<<0)
#define HRTIM_MREP_MREP_0               (0x1u<<0)

// MCMP1R Configuration

#define HRTIM_MCMP1R_MCMP1              (0xFFFFu<<0)
#define HRTIM_MCMP1R_MCMP1_0            (0x1u<<0)

// MCMP2R Configuration

#define HRTIM_MCMP2R_MCMP2              (0xFFFFu<<0)
#define HRTIM_MCMP2R_MCMP2_0            (0x1u<<0)

// MCMP3R Configuration

#define HRTIM_MCMP3R_MCMP3              (0xFFFFu<<0)
#define HRTIM_MCMP3R_MCMP3_0            (0x1u<<0)

// MCMP4R Configuration

#define HRTIM_MCMP4R_MCMP4              (0xFFFFu<<0)
#define HRTIM_MCMP4R_MCMP4_0            (0x1u<<0)

// TIMACR Configuration

#define HRTIM_TIMACR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMACR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMACR_PREEN              (0x1u<<27)
#define HRTIM_TIMACR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMACR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMACR_MSTU               (0x1u<<24)
#define HRTIM_TIMACR_TEU                (0x1u<<23)
#define HRTIM_TIMACR_TDU                (0x1u<<22)
#define HRTIM_TIMACR_TCU                (0x1u<<21)
#define HRTIM_TIMACR_TBU                (0x1u<<20)
#define HRTIM_TIMACR_TAU                (0x1u<<19)
#define HRTIM_TIMACR_TARSTU             (0x1u<<18)
#define HRTIM_TIMACR_TAREPU             (0x1u<<17)
#define HRTIM_TIMACR_TFU                (0x1u<<16)
#define HRTIM_TIMACR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMACR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMACR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMACR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMACR_SYNCSTRTA          (0x1u<<11)
#define HRTIM_TIMACR_SYNCRSTA           (0x1u<<10)
#define HRTIM_TIMACR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMACR_INTLVD             (0x3u<<7)
#define HRTIM_TIMACR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMACR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMACR_HALF               (0x1u<<5)
#define HRTIM_TIMACR_RETRIG             (0x1u<<4)
#define HRTIM_TIMACR_CONT               (0x1u<<3)
#define HRTIM_TIMACR_CKPSCA             (0x7u<<0)
#define HRTIM_TIMACR_CKPSCA_0           (0x1u<<0)

#define HRTIM_TIMACR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMACR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMACR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMACR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMACR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMACR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMACR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMACR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMACR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMACR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMACR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMACR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMACR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMACR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMACR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMACR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMACR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMACR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMACR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMACR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMACR_TARSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMACR_TARSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMACR_TAREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMACR_TAREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMACR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMACR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMACR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMACR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMACR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMACR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMACR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMACR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMACR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMACR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMACR_SYNCSTRTA_B_0X0    (0x0u<<11)
#define HRTIM_TIMACR_SYNCSTRTA_B_0X1    (0x1u<<11)
#define HRTIM_TIMACR_SYNCRSTA_B_0X0     (0x0u<<10)
#define HRTIM_TIMACR_SYNCRSTA_B_0X1     (0x1u<<10)
#define HRTIM_TIMACR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMACR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMACR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMACR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMACR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMACR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMACR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMACR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMACR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMACR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMACR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMACR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMACR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMACR_CONT_B_0X1         (0x1u<<3)

// TIMAISR Configuration

#define HRTIM_TIMAISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMAISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMAISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMAISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMAISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMAISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMAISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMAISR_RST               (0x1u<<13)
#define HRTIM_TIMAISR_RSTA2             (0x1u<<12)
#define HRTIM_TIMAISR_SETA2             (0x1u<<11)
#define HRTIM_TIMAISR_RSTA1             (0x1u<<10)
#define HRTIM_TIMAISR_SETA1             (0x1u<<9)
#define HRTIM_TIMAISR_CPT2              (0x1u<<8)
#define HRTIM_TIMAISR_CPT1              (0x1u<<7)
#define HRTIM_TIMAISR_UPD               (0x1u<<6)
#define HRTIM_TIMAISR_REP               (0x1u<<4)
#define HRTIM_TIMAISR_CMP4              (0x1u<<3)
#define HRTIM_TIMAISR_CMP3              (0x1u<<2)
#define HRTIM_TIMAISR_CMP2              (0x1u<<1)
#define HRTIM_TIMAISR_CMP1              (0x1u<<0)

#define HRTIM_TIMAISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMAISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMAISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMAISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMAISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMAISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMAISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMAISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMAISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMAISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMAISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMAISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMAISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMAISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMAISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMAISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMAISR_RSTA1_B_0X0       (0x0u<<10)
#define HRTIM_TIMAISR_RSTA1_B_0X1       (0x1u<<10)
#define HRTIM_TIMAISR_SETA1_B_0X0       (0x0u<<9)
#define HRTIM_TIMAISR_SETA1_B_0X1       (0x1u<<9)
#define HRTIM_TIMAISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMAISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMAISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMAISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMAISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMAISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMAISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMAISR_CMP1_B_0X1        (0x1u<<0)

