Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// TIMAICR Configuration

#define HRTIM_TIMAICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMAICR_RSTC              (0x1u<<13)
#define HRTIM_TIMAICR_RSTA2C            (0x1u<<12)
#define HRTIM_TIMAICR_SETA2C            (0x1u<<11)
#define HRTIM_TIMAICR_RSTA1C            (0x1u<<10)
#define HRTIM_TIMAICR_SETA1C            (0x1u<<9)
#define HRTIM_TIMAICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMAICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMAICR_UPDC              (0x1u<<6)
#define HRTIM_TIMAICR_REPC              (0x1u<<4)
#define HRTIM_TIMAICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMAICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMAICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMAICR_CMP1C             (0x1u<<0)

// TIMADIER Configuration

#define HRTIM_TIMADIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMADIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMADIER_RSTA2DE          (0x1u<<28)
#define HRTIM_TIMADIER_SETA2DE          (0x1u<<27)
#define HRTIM_TIMADIER_RSTA1DE          (0x1u<<26)
#define HRTIM_TIMADIER_SETA1DE          (0x1u<<25)
#define HRTIM_TIMADIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMADIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMADIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMADIER_REPDE            (0x1u<<20)
#define HRTIM_TIMADIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMADIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMADIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMADIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMADIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMADIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMADIER_RSTA2IE          (0x1u<<12)
#define HRTIM_TIMADIER_SETA2IE          (0x1u<<11)
#define HRTIM_TIMADIER_RSTA1IE          (0x1u<<10)
#define HRTIM_TIMADIER_SETA1IE          (0x1u<<9)
#define HRTIM_TIMADIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMADIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMADIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMADIER_REPIE            (0x1u<<4)
#define HRTIM_TIMADIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMADIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMADIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMADIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMADIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMADIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMADIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMADIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMADIER_RSTA1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMADIER_RSTA1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMADIER_SETA1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMADIER_SETA1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMADIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMADIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMADIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMADIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMADIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMADIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMADIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMADIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMADIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMADIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMADIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMADIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMADIER_RSTA1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMADIER_RSTA1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMADIER_SETA1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMADIER_SETA1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMADIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMADIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMADIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMADIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMADIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMADIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMADIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMADIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTAR Configuration

#define HRTIM_CNTAR_CNTA                (0xFFFFu<<0)
#define HRTIM_CNTAR_CNTA_0              (0x1u<<0)

// PERAR Configuration

#define HRTIM_PERAR_PERA                (0xFFFFu<<0)
#define HRTIM_PERAR_PERA_0              (0x1u<<0)

// REPAR Configuration

#define HRTIM_REPAR_REPA                (0xFFu<<0)
#define HRTIM_REPAR_REPA_0              (0x1u<<0)

// CMP1AR Configuration

#define HRTIM_CMP1AR_CMP1A              (0xFFFFu<<0)
#define HRTIM_CMP1AR_CMP1A_0            (0x1u<<0)

// CMP1CAR Configuration

#define HRTIM_CMP1CAR_REPA              (0xFFu<<16)
#define HRTIM_CMP1CAR_REPA_0            (0x1u<<16)
#define HRTIM_CMP1CAR_CMP1A             (0xFFFFu<<0)
#define HRTIM_CMP1CAR_CMP1A_0           (0x1u<<0)

// CMP2AR Configuration

#define HRTIM_CMP2AR_CMP2A              (0xFFFFu<<0)
#define HRTIM_CMP2AR_CMP2A_0            (0x1u<<0)

// CMP3AR Configuration

#define HRTIM_CMP3AR_CMP3A              (0xFFFFu<<0)
#define HRTIM_CMP3AR_CMP3A_0            (0x1u<<0)

// CMP4AR Configuration

#define HRTIM_CMP4AR_CMP4A              (0xFFFFu<<0)
#define HRTIM_CMP4AR_CMP4A_0            (0x1u<<0)

// CPT1AR Configuration

#define HRTIM_CPT1AR_DIR                (0x1u<<16)
#define HRTIM_CPT1AR_CPT1A              (0xFFFFu<<0)
#define HRTIM_CPT1AR_CPT1A_0            (0x1u<<0)

#define HRTIM_CPT1AR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1AR_DIR_B_0X1          (0x1u<<16)

// CPT2AR Configuration

#define HRTIM_CPT2AR_DIR                (0x1u<<16)
#define HRTIM_CPT2AR_CPT2A              (0xFFFFu<<0)
#define HRTIM_CPT2AR_CPT2A_0            (0x1u<<0)

#define HRTIM_CPT2AR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2AR_DIR_B_0X1          (0x1u<<16)

// DTAR Configuration

#define HRTIM_DTAR_DTFLKA               (0x1u<<31)
#define HRTIM_DTAR_DTFSLKA              (0x1u<<30)
#define HRTIM_DTAR_SDTFA                (0x1u<<25)
#define HRTIM_DTAR_DTFA                 (0x1FFu<<16)
#define HRTIM_DTAR_DTFA_0               (0x1u<<16)
#define HRTIM_DTAR_DTRLKA               (0x1u<<15)
#define HRTIM_DTAR_DTRSLKA              (0x1u<<14)
#define HRTIM_DTAR_DTPRSC               (0x7u<<10)
#define HRTIM_DTAR_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTAR_SDTRA                (0x1u<<9)
#define HRTIM_DTAR_DTRA                 (0x1FFu<<0)
#define HRTIM_DTAR_DTRA_0               (0x1u<<0)

#define HRTIM_DTAR_DTFLKA_B_0X0         (0x0u<<31)
#define HRTIM_DTAR_DTFLKA_B_0X1         (0x1u<<31)
#define HRTIM_DTAR_DTFSLKA_B_0X0        (0x0u<<30)
#define HRTIM_DTAR_DTFSLKA_B_0X1        (0x1u<<30)
#define HRTIM_DTAR_SDTFA_B_0X0          (0x0u<<25)
#define HRTIM_DTAR_SDTFA_B_0X1          (0x1u<<25)
#define HRTIM_DTAR_DTRLKA_B_0X0         (0x0u<<15)
#define HRTIM_DTAR_DTRLKA_B_0X1         (0x1u<<15)
#define HRTIM_DTAR_DTRSLKA_B_0X0        (0x0u<<14)
#define HRTIM_DTAR_DTRSLKA_B_0X1        (0x1u<<14)
#define HRTIM_DTAR_SDTRA_B_0X0          (0x0u<<9)
#define HRTIM_DTAR_SDTRA_B_0X1          (0x1u<<9)

