Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// SETA1R Configuration

#define HRTIM_SETA1R_UPDATE             (0x1u<<31)
#define HRTIM_SETA1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETA1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETA1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETA1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETA1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETA1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETA1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETA1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETA1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETA1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETA1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETA1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETA1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETA1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETA1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETA1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETA1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETA1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETA1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETA1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETA1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETA1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETA1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETA1R_MSTPER             (0x1u<<7)
#define HRTIM_SETA1R_CMP4               (0x1u<<6)
#define HRTIM_SETA1R_CMP3               (0x1u<<5)
#define HRTIM_SETA1R_CMP2               (0x1u<<4)
#define HRTIM_SETA1R_CMP1               (0x1u<<3)
#define HRTIM_SETA1R_PER                (0x1u<<2)
#define HRTIM_SETA1R_RESYNC             (0x1u<<1)
#define HRTIM_SETA1R_SST                (0x1u<<0)

// RSTA1R Configuration

#define HRTIM_RSTA1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTA1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTA1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTA1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTA1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTA1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTA1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTA1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTA1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTA1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTA1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTA1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTA1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTA1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTA1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTA1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTA1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTA1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTA1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTA1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTA1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTA1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTA1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTA1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTA1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTA1R_CMP4               (0x1u<<6)
#define HRTIM_RSTA1R_CMP3               (0x1u<<5)
#define HRTIM_RSTA1R_CMP2               (0x1u<<4)
#define HRTIM_RSTA1R_CMP1               (0x1u<<3)
#define HRTIM_RSTA1R_PER                (0x1u<<2)
#define HRTIM_RSTA1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTA1R_SST                (0x1u<<0)

// SETA2R Configuration

#define HRTIM_SETA2R_UPDATE             (0x1u<<31)
#define HRTIM_SETA2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETA2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETA2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETA2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETA2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETA2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETA2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETA2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETA2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETA2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETA2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETA2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETA2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETA2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETA2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETA2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETA2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETA2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETA2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETA2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETA2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETA2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETA2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETA2R_MSTPER             (0x1u<<7)
#define HRTIM_SETA2R_CMP4               (0x1u<<6)
#define HRTIM_SETA2R_CMP3               (0x1u<<5)
#define HRTIM_SETA2R_CMP2               (0x1u<<4)
#define HRTIM_SETA2R_CMP1               (0x1u<<3)
#define HRTIM_SETA2R_PER                (0x1u<<2)
#define HRTIM_SETA2R_RESYNC             (0x1u<<1)
#define HRTIM_SETA2R_SST                (0x1u<<0)

// RSTA2R Configuration

#define HRTIM_RSTA2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTA2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTA2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTA2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTA2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTA2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTA2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTA2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTA2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTA2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTA2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTA2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTA2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTA2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTA2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTA2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTA2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTA2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTA2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTA2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTA2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTA2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTA2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTA2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTA2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTA2R_CMP4               (0x1u<<6)
#define HRTIM_RSTA2R_CMP3               (0x1u<<5)
#define HRTIM_RSTA2R_CMP2               (0x1u<<4)
#define HRTIM_RSTA2R_CMP1               (0x1u<<3)
#define HRTIM_RSTA2R_PER                (0x1u<<2)
#define HRTIM_RSTA2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTA2R_SST                (0x1u<<0)

