Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// EEFAR1 Configuration

#define HRTIM_EEFAR1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFAR1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFAR1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFAR1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFAR1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFAR1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFAR1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFAR1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFAR1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFAR1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFAR1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFAR1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFAR1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFAR1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFAR1_EE1LTCH            (0x1u<<0)

#define HRTIM_EEFAR1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFAR1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFAR1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFAR1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFAR2 Configuration

#define HRTIM_EEFAR2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFAR2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFAR2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFAR2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFAR2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFAR2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFAR2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFAR2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFAR2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFAR2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFAR2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFAR2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFAR2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFAR2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFAR2_EE6LTCH            (0x1u<<0)

// RSTAR Configuration

#define HRTIM_RSTAR_TIMFCMP2            (0x1u<<31)
#define HRTIM_RSTAR_TIMECMP4            (0x1u<<30)
#define HRTIM_RSTAR_TIMECMP2            (0x1u<<29)
#define HRTIM_RSTAR_TIMECMP1            (0x1u<<28)
#define HRTIM_RSTAR_TIMDCMP4            (0x1u<<27)
#define HRTIM_RSTAR_TIMDCMP2            (0x1u<<26)
#define HRTIM_RSTAR_TIMDCMP1            (0x1u<<25)
#define HRTIM_RSTAR_TIMCCMP4            (0x1u<<24)
#define HRTIM_RSTAR_TIMCCMP2            (0x1u<<23)
#define HRTIM_RSTAR_TIMCCMP1            (0x1u<<22)
#define HRTIM_RSTAR_TIMBCMP4            (0x1u<<21)
#define HRTIM_RSTAR_TIMBCMP2            (0x1u<<20)
#define HRTIM_RSTAR_TIMBCMP1            (0x1u<<19)
#define HRTIM_RSTAR_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTAR_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTAR_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTAR_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTAR_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTAR_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTAR_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTAR_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTAR_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTAR_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTAR_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTAR_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTAR_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTAR_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTAR_MSTPER              (0x1u<<4)
#define HRTIM_RSTAR_CMP4                (0x1u<<3)
#define HRTIM_RSTAR_CMP2                (0x1u<<2)
#define HRTIM_RSTAR_UPDT                (0x1u<<1)
#define HRTIM_RSTAR_TIMFCMP1            (0x1u<<0)

// CHPAR Configuration

#define HRTIM_CHPAR_STRTPW              (0xFu<<7)
#define HRTIM_CHPAR_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPAR_CARDTY              (0x7u<<4)
#define HRTIM_CHPAR_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPAR_CARFRQ              (0xFu<<0)
#define HRTIM_CHPAR_CARFRQ_0            (0x1u<<0)

#define HRTIM_CHPAR_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPAR_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPAR_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPAR_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPAR_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPAR_CARFRQ_B_0XF        (0xFu<<0)

// CPT1ACR Configuration

#define HRTIM_CPT1ACR_TECMP2            (0x1u<<31)
#define HRTIM_CPT1ACR_TECMP1            (0x1u<<30)
#define HRTIM_CPT1ACR_TE1RST            (0x1u<<29)
#define HRTIM_CPT1ACR_TE1SET            (0x1u<<28)
#define HRTIM_CPT1ACR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT1ACR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT1ACR_TD1RST            (0x1u<<25)
#define HRTIM_CPT1ACR_TD1SET            (0x1u<<24)
#define HRTIM_CPT1ACR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT1ACR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT1ACR_TC1RST            (0x1u<<21)
#define HRTIM_CPT1ACR_TC1SET            (0x1u<<20)
#define HRTIM_CPT1ACR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT1ACR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT1ACR_TB1RST            (0x1u<<17)
#define HRTIM_CPT1ACR_TB1SET            (0x1u<<16)
#define HRTIM_CPT1ACR_TFCMP2            (0x1u<<15)
#define HRTIM_CPT1ACR_TFCMP1            (0x1u<<14)
#define HRTIM_CPT1ACR_TF1RST            (0x1u<<13)
#define HRTIM_CPT1ACR_TF1SET            (0x1u<<12)
#define HRTIM_CPT1ACR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1ACR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1ACR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1ACR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1ACR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1ACR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1ACR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1ACR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1ACR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1ACR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1ACR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1ACR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1ACR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1ACR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1ACR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1ACR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1ACR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1ACR_SWCPT_B_0X1       (0x1u<<0)

// CPT2ACR Configuration

