Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_CPT2ACR_TECMP2            (0x1u<<31)
#define HRTIM_CPT2ACR_TECMP1            (0x1u<<30)
#define HRTIM_CPT2ACR_TE1RST            (0x1u<<29)
#define HRTIM_CPT2ACR_TE1SET            (0x1u<<28)
#define HRTIM_CPT2ACR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT2ACR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT2ACR_TD1RST            (0x1u<<25)
#define HRTIM_CPT2ACR_TD1SET            (0x1u<<24)
#define HRTIM_CPT2ACR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT2ACR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT2ACR_TC1RST            (0x1u<<21)
#define HRTIM_CPT2ACR_TC1SET            (0x1u<<20)
#define HRTIM_CPT2ACR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT2ACR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT2ACR_TB1RST            (0x1u<<17)
#define HRTIM_CPT2ACR_TB1SET            (0x1u<<16)
#define HRTIM_CPT2ACR_TFCMP2            (0x1u<<15)
#define HRTIM_CPT2ACR_TFCMP1            (0x1u<<14)
#define HRTIM_CPT2ACR_TF1RST            (0x1u<<13)
#define HRTIM_CPT2ACR_TF1SET            (0x1u<<12)
#define HRTIM_CPT2ACR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2ACR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2ACR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2ACR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2ACR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2ACR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2ACR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2ACR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2ACR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2ACR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2ACR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2ACR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2ACR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2ACR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2ACR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2ACR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2ACR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2ACR_SWCPT_B_0X1       (0x1u<<0)

// OUTAR Configuration

#define HRTIM_OUTAR_DIDL2               (0x1u<<23)
#define HRTIM_OUTAR_CHP2                (0x1u<<22)
#define HRTIM_OUTAR_FAULT2              (0x3u<<20)
#define HRTIM_OUTAR_FAULT2_0            (0x1u<<20)
#define HRTIM_OUTAR_IDLES2              (0x1u<<19)
#define HRTIM_OUTAR_IDLEM2              (0x1u<<18)
#define HRTIM_OUTAR_POL2                (0x1u<<17)
#define HRTIM_OUTAR_BIAR                (0x1u<<14)
#define HRTIM_OUTAR_DLYPRT              (0x7u<<10)
#define HRTIM_OUTAR_DLYPRT_0            (0x1u<<10)
#define HRTIM_OUTAR_DLYPRTEN            (0x1u<<9)
#define HRTIM_OUTAR_DTEN                (0x1u<<8)
#define HRTIM_OUTAR_DIDL1               (0x1u<<7)
#define HRTIM_OUTAR_CHP1                (0x1u<<6)
#define HRTIM_OUTAR_FAULT1              (0x3u<<4)
#define HRTIM_OUTAR_FAULT1_0            (0x1u<<4)
#define HRTIM_OUTAR_IDLES1              (0x1u<<3)
#define HRTIM_OUTAR_IDLEM1              (0x1u<<2)
#define HRTIM_OUTAR_POL1                (0x1u<<1)

#define HRTIM_OUTAR_DIDL2_B_0X0         (0x0u<<23)
#define HRTIM_OUTAR_DIDL2_B_0X1         (0x1u<<23)
#define HRTIM_OUTAR_CHP2_B_0X0          (0x0u<<22)
#define HRTIM_OUTAR_CHP2_B_0X1          (0x1u<<22)
#define HRTIM_OUTAR_FAULT2_B_0X0        (0x0u<<20)
#define HRTIM_OUTAR_FAULT2_B_0X1        (0x1u<<20)
#define HRTIM_OUTAR_FAULT2_B_0X2        (0x2u<<20)
#define HRTIM_OUTAR_FAULT2_B_0X3        (0x3u<<20)
#define HRTIM_OUTAR_IDLES2_B_0X0        (0x0u<<19)
#define HRTIM_OUTAR_IDLES2_B_0X1        (0x1u<<19)
#define HRTIM_OUTAR_IDLEM2_B_0X0        (0x0u<<18)
#define HRTIM_OUTAR_IDLEM2_B_0X1        (0x1u<<18)
#define HRTIM_OUTAR_POL2_B_0X0          (0x0u<<17)
#define HRTIM_OUTAR_POL2_B_0X1          (0x1u<<17)
#define HRTIM_OUTAR_BIAR_B_0X0          (0x0u<<14)
#define HRTIM_OUTAR_BIAR_B_0X1          (0x1u<<14)
#define HRTIM_OUTAR_DLYPRT_B_0X0        (0x0u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X1        (0x1u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X2        (0x2u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X3        (0x3u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X4        (0x4u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X5        (0x5u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X6        (0x6u<<10)
#define HRTIM_OUTAR_DLYPRT_B_0X7        (0x7u<<10)
#define HRTIM_OUTAR_DLYPRTEN_B_0X0      (0x0u<<9)
#define HRTIM_OUTAR_DLYPRTEN_B_0X1      (0x1u<<9)
#define HRTIM_OUTAR_DTEN_B_0X0          (0x0u<<8)
#define HRTIM_OUTAR_DTEN_B_0X1          (0x1u<<8)
#define HRTIM_OUTAR_DIDL1_B_0X0         (0x0u<<7)
#define HRTIM_OUTAR_DIDL1_B_0X1         (0x1u<<7)
#define HRTIM_OUTAR_CHP1_B_0X0          (0x0u<<6)
#define HRTIM_OUTAR_CHP1_B_0X1          (0x1u<<6)
#define HRTIM_OUTAR_FAULT1_B_0X0        (0x0u<<4)
#define HRTIM_OUTAR_FAULT1_B_0X1        (0x1u<<4)
#define HRTIM_OUTAR_FAULT1_B_0X2        (0x2u<<4)
#define HRTIM_OUTAR_FAULT1_B_0X3        (0x3u<<4)
#define HRTIM_OUTAR_IDLES1_B_0X0        (0x0u<<3)
#define HRTIM_OUTAR_IDLES1_B_0X1        (0x1u<<3)
#define HRTIM_OUTAR_IDLEM1_B_0X0        (0x0u<<2)
#define HRTIM_OUTAR_IDLEM1_B_0X1        (0x1u<<2)
#define HRTIM_OUTAR_POL1_B_0X0          (0x0u<<1)
#define HRTIM_OUTAR_POL1_B_0X1          (0x1u<<1)

// FLTAR Configuration

#define HRTIM_FLTAR_FLTLCK              (0x1u<<31)
#define HRTIM_FLTAR_FLT6EN              (0x1u<<5)
#define HRTIM_FLTAR_FLT5EN              (0x1u<<4)
#define HRTIM_FLTAR_FLT4EN              (0x1u<<3)
#define HRTIM_FLTAR_FLT3EN              (0x1u<<2)
#define HRTIM_FLTAR_FLT2EN              (0x1u<<1)
#define HRTIM_FLTAR_FLT1EN              (0x1u<<0)

#define HRTIM_FLTAR_FLTLCK_B_0X0        (0x0u<<31)
#define HRTIM_FLTAR_FLTLCK_B_0X1        (0x1u<<31)
#define HRTIM_FLTAR_FLT6EN_B_0X0        (0x0u<<5)
#define HRTIM_FLTAR_FLT6EN_B_0X1        (0x1u<<5)
#define HRTIM_FLTAR_FLT5EN_B_0X0        (0x0u<<4)
#define HRTIM_FLTAR_FLT5EN_B_0X1        (0x1u<<4)
#define HRTIM_FLTAR_FLT4EN_B_0X0        (0x0u<<3)
#define HRTIM_FLTAR_FLT4EN_B_0X1        (0x1u<<3)
#define HRTIM_FLTAR_FLT3EN_B_0X0        (0x0u<<2)
#define HRTIM_FLTAR_FLT3EN_B_0X1        (0x1u<<2)
#define HRTIM_FLTAR_FLT2EN_B_0X0        (0x0u<<1)
#define HRTIM_FLTAR_FLT2EN_B_0X1        (0x1u<<1)
#define HRTIM_FLTAR_FLT1EN_B_0X0        (0x0u<<0)
#define HRTIM_FLTAR_FLT1EN_B_0X1        (0x1u<<0)

// TIMACR2 Configuration

#define HRTIM_TIMACR2_TRGHLF            (0x1u<<20)
#define HRTIM_TIMACR2_GTCMP3            (0x1u<<17)
#define HRTIM_TIMACR2_GTCMP1            (0x1u<<16)
#define HRTIM_TIMACR2_FEROM             (0x3u<<14)
#define HRTIM_TIMACR2_FEROM_0           (0x1u<<14)
#define HRTIM_TIMACR2_BMROM             (0x3u<<12)
#define HRTIM_TIMACR2_BMROM_0           (0x1u<<12)
#define HRTIM_TIMACR2_ADROM             (0x3u<<10)
#define HRTIM_TIMACR2_ADROM_0           (0x1u<<10)
#define HRTIM_TIMACR2_OUTROM            (0x3u<<8)
#define HRTIM_TIMACR2_OUTROM_0          (0x1u<<8)
#define HRTIM_TIMACR2_ROM               (0x3u<<6)
#define HRTIM_TIMACR2_ROM_0             (0x1u<<6)
#define HRTIM_TIMACR2_UDM               (0x1u<<4)
#define HRTIM_TIMACR2_DCDR              (0x1u<<2)
#define HRTIM_TIMACR2_DCDS              (0x1u<<1)
#define HRTIM_TIMACR2_DCDE              (0x1u<<0)

