Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_TIMACR2_TRGHLF_B_0X0      (0x0u<<20)
#define HRTIM_TIMACR2_TRGHLF_B_0X1      (0x1u<<20)
#define HRTIM_TIMACR2_GTCMP3_B_0X0      (0x0u<<17)
#define HRTIM_TIMACR2_GTCMP3_B_0X1      (0x1u<<17)
#define HRTIM_TIMACR2_GTCMP1_B_0X0      (0x0u<<16)
#define HRTIM_TIMACR2_GTCMP1_B_0X1      (0x1u<<16)
#define HRTIM_TIMACR2_FEROM_B_0X0       (0x0u<<14)
#define HRTIM_TIMACR2_FEROM_B_0X1       (0x1u<<14)
#define HRTIM_TIMACR2_FEROM_B_0X2       (0x2u<<14)
#define HRTIM_TIMACR2_BMROM_B_0X0       (0x0u<<12)
#define HRTIM_TIMACR2_BMROM_B_0X1       (0x1u<<12)
#define HRTIM_TIMACR2_BMROM_B_0X2       (0x2u<<12)
#define HRTIM_TIMACR2_ADROM_B_0X0       (0x0u<<10)
#define HRTIM_TIMACR2_ADROM_B_0X1       (0x1u<<10)
#define HRTIM_TIMACR2_ADROM_B_0X2       (0x2u<<10)
#define HRTIM_TIMACR2_OUTROM_B_0X0      (0x0u<<8)
#define HRTIM_TIMACR2_OUTROM_B_0X1      (0x1u<<8)
#define HRTIM_TIMACR2_OUTROM_B_0X2      (0x2u<<8)
#define HRTIM_TIMACR2_ROM_B_0X0         (0x0u<<6)
#define HRTIM_TIMACR2_ROM_B_0X1         (0x1u<<6)
#define HRTIM_TIMACR2_ROM_B_0X2         (0x2u<<6)
#define HRTIM_TIMACR2_UDM_B_0X0         (0x0u<<4)
#define HRTIM_TIMACR2_UDM_B_0X1         (0x1u<<4)
#define HRTIM_TIMACR2_DCDR_B_0X0        (0x0u<<2)
#define HRTIM_TIMACR2_DCDR_B_0X1        (0x1u<<2)
#define HRTIM_TIMACR2_DCDS_B_0X0        (0x0u<<1)
#define HRTIM_TIMACR2_DCDS_B_0X1        (0x1u<<1)
#define HRTIM_TIMACR2_DCDE_B_0X0        (0x0u<<0)
#define HRTIM_TIMACR2_DCDE_B_0X1        (0x1u<<0)

// TIMAEEFR3 Configuration

#define HRTIM_TIMAEEFR3_EEVACNT         (0x3Fu<<8)
#define HRTIM_TIMAEEFR3_EEVACNT_0       (0x1u<<8)
#define HRTIM_TIMAEEFR3_EEVASEL         (0xFu<<4)
#define HRTIM_TIMAEEFR3_EEVASEL_0       (0x1u<<4)
#define HRTIM_TIMAEEFR3_EEVARSTM        (0x1u<<2)
#define HRTIM_TIMAEEFR3_EEVACRES        (0x1u<<1)
#define HRTIM_TIMAEEFR3_EEVACE          (0x1u<<0)

#define HRTIM_TIMAEEFR3_EEVASEL_B_0X0   (0x0u<<4)
#define HRTIM_TIMAEEFR3_EEVASEL_B_0X1   (0x1u<<4)
#define HRTIM_TIMAEEFR3_EEVARSTM_B_0X0  (0x0u<<2)
#define HRTIM_TIMAEEFR3_EEVARSTM_B_0X1  (0x1u<<2)
#define HRTIM_TIMAEEFR3_EEVACRES_B_0X0  (0x0u<<1)
#define HRTIM_TIMAEEFR3_EEVACRES_B_0X1  (0x1u<<1)
#define HRTIM_TIMAEEFR3_EEVACE_B_0X0    (0x0u<<0)
#define HRTIM_TIMAEEFR3_EEVACE_B_0X1    (0x1u<<0)

// TIMBCR Configuration

#define HRTIM_TIMBCR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMBCR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMBCR_PREEN              (0x1u<<27)
#define HRTIM_TIMBCR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMBCR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMBCR_MSTU               (0x1u<<24)
#define HRTIM_TIMBCR_TEU                (0x1u<<23)
#define HRTIM_TIMBCR_TDU                (0x1u<<22)
#define HRTIM_TIMBCR_TCU                (0x1u<<21)
#define HRTIM_TIMBCR_TBU                (0x1u<<20)
#define HRTIM_TIMBCR_TAU                (0x1u<<19)
#define HRTIM_TIMBCR_TBRSTU             (0x1u<<18)
#define HRTIM_TIMBCR_TBREPU             (0x1u<<17)
#define HRTIM_TIMBCR_TFU                (0x1u<<16)
#define HRTIM_TIMBCR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMBCR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMBCR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMBCR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMBCR_SYNCSTRTB          (0x1u<<11)
#define HRTIM_TIMBCR_SYNCRSTB           (0x1u<<10)
#define HRTIM_TIMBCR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMBCR_INTLVD             (0x3u<<7)
#define HRTIM_TIMBCR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMBCR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMBCR_HALF               (0x1u<<5)
#define HRTIM_TIMBCR_RETRIG             (0x1u<<4)
#define HRTIM_TIMBCR_CONT               (0x1u<<3)
#define HRTIM_TIMBCR_CKPSCB             (0x7u<<0)
#define HRTIM_TIMBCR_CKPSCB_0           (0x1u<<0)

#define HRTIM_TIMBCR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMBCR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMBCR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMBCR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMBCR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMBCR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMBCR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMBCR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMBCR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMBCR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMBCR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMBCR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMBCR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMBCR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMBCR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMBCR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMBCR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMBCR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMBCR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMBCR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMBCR_TBRSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMBCR_TBRSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMBCR_TBREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMBCR_TBREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMBCR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMBCR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMBCR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMBCR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMBCR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMBCR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMBCR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMBCR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMBCR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMBCR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMBCR_SYNCSTRTB_B_0X0    (0x0u<<11)
#define HRTIM_TIMBCR_SYNCSTRTB_B_0X1    (0x1u<<11)
#define HRTIM_TIMBCR_SYNCRSTB_B_0X0     (0x0u<<10)
#define HRTIM_TIMBCR_SYNCRSTB_B_0X1     (0x1u<<10)
#define HRTIM_TIMBCR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMBCR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMBCR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMBCR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMBCR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMBCR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMBCR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMBCR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMBCR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMBCR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMBCR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMBCR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMBCR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMBCR_CONT_B_0X1         (0x1u<<3)

