Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// TIMBISR Configuration

#define HRTIM_TIMBISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMBISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMBISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMBISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMBISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMBISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMBISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMBISR_RST               (0x1u<<13)
#define HRTIM_TIMBISR_RSTB2             (0x1u<<12)
#define HRTIM_TIMBISR_SETB2             (0x1u<<11)
#define HRTIM_TIMBISR_RSTB1             (0x1u<<10)
#define HRTIM_TIMBISR_SETB1             (0x1u<<9)
#define HRTIM_TIMBISR_CPT2              (0x1u<<8)
#define HRTIM_TIMBISR_CPT1              (0x1u<<7)
#define HRTIM_TIMBISR_UPD               (0x1u<<6)
#define HRTIM_TIMBISR_REP               (0x1u<<4)
#define HRTIM_TIMBISR_CMP4              (0x1u<<3)
#define HRTIM_TIMBISR_CMP3              (0x1u<<2)
#define HRTIM_TIMBISR_CMP2              (0x1u<<1)
#define HRTIM_TIMBISR_CMP1              (0x1u<<0)

#define HRTIM_TIMBISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMBISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMBISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMBISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMBISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMBISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMBISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMBISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMBISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMBISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMBISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMBISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMBISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMBISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMBISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMBISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMBISR_RSTB1_B_0X0       (0x0u<<10)
#define HRTIM_TIMBISR_RSTB1_B_0X1       (0x1u<<10)
#define HRTIM_TIMBISR_SETB1_B_0X0       (0x0u<<9)
#define HRTIM_TIMBISR_SETB1_B_0X1       (0x1u<<9)
#define HRTIM_TIMBISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMBISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMBISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMBISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMBISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMBISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMBISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMBISR_CMP1_B_0X1        (0x1u<<0)

// TIMBICR Configuration

#define HRTIM_TIMBICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMBICR_RSTC              (0x1u<<13)
#define HRTIM_TIMBICR_RSTB2C            (0x1u<<12)
#define HRTIM_TIMBICR_SETB2C            (0x1u<<11)
#define HRTIM_TIMBICR_RSTB1C            (0x1u<<10)
#define HRTIM_TIMBICR_SETB1C            (0x1u<<9)
#define HRTIM_TIMBICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMBICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMBICR_UPDC              (0x1u<<6)
#define HRTIM_TIMBICR_REPC              (0x1u<<4)
#define HRTIM_TIMBICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMBICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMBICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMBICR_CMP1C             (0x1u<<0)

// TIMBDIER Configuration

#define HRTIM_TIMBDIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMBDIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMBDIER_RSTB2DE          (0x1u<<28)
#define HRTIM_TIMBDIER_SETB2DE          (0x1u<<27)
#define HRTIM_TIMBDIER_RSTB1DE          (0x1u<<26)
#define HRTIM_TIMBDIER_SETB1DE          (0x1u<<25)
#define HRTIM_TIMBDIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMBDIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMBDIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMBDIER_REPDE            (0x1u<<20)
#define HRTIM_TIMBDIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMBDIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMBDIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMBDIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMBDIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMBDIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMBDIER_RSTB2IE          (0x1u<<12)
#define HRTIM_TIMBDIER_SETB2IE          (0x1u<<11)
#define HRTIM_TIMBDIER_RSTB1IE          (0x1u<<10)
#define HRTIM_TIMBDIER_SETB1IE          (0x1u<<9)
#define HRTIM_TIMBDIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMBDIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMBDIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMBDIER_REPIE            (0x1u<<4)
#define HRTIM_TIMBDIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMBDIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMBDIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMBDIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMBDIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMBDIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMBDIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMBDIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMBDIER_RSTB1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMBDIER_RSTB1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMBDIER_SETB1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMBDIER_SETB1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMBDIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMBDIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMBDIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMBDIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMBDIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMBDIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMBDIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMBDIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMBDIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMBDIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMBDIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMBDIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMBDIER_RSTB1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMBDIER_RSTB1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMBDIER_SETB1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMBDIER_SETB1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMBDIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMBDIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMBDIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMBDIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMBDIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMBDIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMBDIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMBDIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTBR Configuration

