Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_CNTBR_CNTB                (0xFFFFu<<0)
#define HRTIM_CNTBR_CNTB_0              (0x1u<<0)

// PERBR Configuration

#define HRTIM_PERBR_PERB                (0xFFFFu<<0)
#define HRTIM_PERBR_PERB_0              (0x1u<<0)

// REPBR Configuration

#define HRTIM_REPBR_REPB                (0xFFu<<0)
#define HRTIM_REPBR_REPB_0              (0x1u<<0)

// CMP1BR Configuration

#define HRTIM_CMP1BR_CMP1B              (0xFFFFu<<0)
#define HRTIM_CMP1BR_CMP1B_0            (0x1u<<0)

// CMP1CBR Configuration

#define HRTIM_CMP1CBR_REPB              (0xFFu<<16)
#define HRTIM_CMP1CBR_REPB_0            (0x1u<<16)
#define HRTIM_CMP1CBR_CMP1B             (0xFFFFu<<0)
#define HRTIM_CMP1CBR_CMP1B_0           (0x1u<<0)

// CMP2BR Configuration

#define HRTIM_CMP2BR_CMP2B              (0xFFFFu<<0)
#define HRTIM_CMP2BR_CMP2B_0            (0x1u<<0)

// CMP3BR Configuration

#define HRTIM_CMP3BR_CMP3B              (0xFFFFu<<0)
#define HRTIM_CMP3BR_CMP3B_0            (0x1u<<0)

// CMP4BR Configuration

#define HRTIM_CMP4BR_CMP4B              (0xFFFFu<<0)
#define HRTIM_CMP4BR_CMP4B_0            (0x1u<<0)

// CPT1BR Configuration

#define HRTIM_CPT1BR_DIR                (0x1u<<16)
#define HRTIM_CPT1BR_CPT1B              (0xFFFFu<<0)
#define HRTIM_CPT1BR_CPT1B_0            (0x1u<<0)

#define HRTIM_CPT1BR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1BR_DIR_B_0X1          (0x1u<<16)

// CPT2BR Configuration

#define HRTIM_CPT2BR_DIR                (0x1u<<16)
#define HRTIM_CPT2BR_CPT2B              (0xFFFFu<<0)
#define HRTIM_CPT2BR_CPT2B_0            (0x1u<<0)

#define HRTIM_CPT2BR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2BR_DIR_B_0X1          (0x1u<<16)

// DTBR Configuration

#define HRTIM_DTBR_DTFLKB               (0x1u<<31)
#define HRTIM_DTBR_DTFSLKB              (0x1u<<30)
#define HRTIM_DTBR_SDTFB                (0x1u<<25)
#define HRTIM_DTBR_DTFB                 (0x1FFu<<16)
#define HRTIM_DTBR_DTFB_0               (0x1u<<16)
#define HRTIM_DTBR_DTRLKB               (0x1u<<15)
#define HRTIM_DTBR_DTRSLKB              (0x1u<<14)
#define HRTIM_DTBR_DTPRSC               (0x7u<<10)
#define HRTIM_DTBR_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTBR_SDTRB                (0x1u<<9)
#define HRTIM_DTBR_DTRB                 (0x1FFu<<0)
#define HRTIM_DTBR_DTRB_0               (0x1u<<0)

#define HRTIM_DTBR_DTFLKB_B_0X0         (0x0u<<31)
#define HRTIM_DTBR_DTFLKB_B_0X1         (0x1u<<31)
#define HRTIM_DTBR_DTFSLKB_B_0X0        (0x0u<<30)
#define HRTIM_DTBR_DTFSLKB_B_0X1        (0x1u<<30)
#define HRTIM_DTBR_SDTFB_B_0X0          (0x0u<<25)
#define HRTIM_DTBR_SDTFB_B_0X1          (0x1u<<25)
#define HRTIM_DTBR_DTRLKB_B_0X0         (0x0u<<15)
#define HRTIM_DTBR_DTRLKB_B_0X1         (0x1u<<15)
#define HRTIM_DTBR_DTRSLKB_B_0X0        (0x0u<<14)
#define HRTIM_DTBR_DTRSLKB_B_0X1        (0x1u<<14)
#define HRTIM_DTBR_SDTRB_B_0X0          (0x0u<<9)
#define HRTIM_DTBR_SDTRB_B_0X1          (0x1u<<9)

// SETB1R Configuration

#define HRTIM_SETB1R_UPDATE             (0x1u<<31)
#define HRTIM_SETB1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETB1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETB1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETB1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETB1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETB1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETB1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETB1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETB1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETB1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETB1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETB1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETB1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETB1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETB1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETB1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETB1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETB1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETB1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETB1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETB1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETB1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETB1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETB1R_MSTPER             (0x1u<<7)
#define HRTIM_SETB1R_CMP4               (0x1u<<6)
#define HRTIM_SETB1R_CMP3               (0x1u<<5)
#define HRTIM_SETB1R_CMP2               (0x1u<<4)
#define HRTIM_SETB1R_CMP1               (0x1u<<3)
#define HRTIM_SETB1R_PER                (0x1u<<2)
#define HRTIM_SETB1R_RESYNC             (0x1u<<1)
#define HRTIM_SETB1R_SST                (0x1u<<0)

// RSTB1R Configuration

#define HRTIM_RSTB1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTB1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTB1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTB1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTB1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTB1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTB1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTB1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTB1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTB1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTB1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTB1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTB1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTB1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTB1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTB1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTB1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTB1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTB1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTB1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTB1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTB1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTB1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTB1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTB1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTB1R_CMP4               (0x1u<<6)
#define HRTIM_RSTB1R_CMP3               (0x1u<<5)
#define HRTIM_RSTB1R_CMP2               (0x1u<<4)
#define HRTIM_RSTB1R_CMP1               (0x1u<<3)
#define HRTIM_RSTB1R_PER                (0x1u<<2)
#define HRTIM_RSTB1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTB1R_SST                (0x1u<<0)

// SETB2R Configuration

#define HRTIM_SETB2R_UPDATE             (0x1u<<31)
#define HRTIM_SETB2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETB2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETB2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETB2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETB2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETB2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETB2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETB2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETB2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETB2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETB2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETB2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETB2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETB2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETB2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETB2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETB2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETB2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETB2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETB2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETB2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETB2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETB2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETB2R_MSTPER             (0x1u<<7)
#define HRTIM_SETB2R_CMP4               (0x1u<<6)
#define HRTIM_SETB2R_CMP3               (0x1u<<5)
#define HRTIM_SETB2R_CMP2               (0x1u<<4)
#define HRTIM_SETB2R_CMP1               (0x1u<<3)
#define HRTIM_SETB2R_PER                (0x1u<<2)
#define HRTIM_SETB2R_RESYNC             (0x1u<<1)
#define HRTIM_SETB2R_SST                (0x1u<<0)

// RSTB2R Configuration

#define HRTIM_RSTB2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTB2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTB2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTB2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTB2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTB2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTB2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTB2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTB2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTB2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTB2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTB2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTB2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTB2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTB2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTB2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTB2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTB2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTB2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTB2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTB2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTB2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTB2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTB2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTB2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTB2R_CMP4               (0x1u<<6)
#define HRTIM_RSTB2R_CMP3               (0x1u<<5)
#define HRTIM_RSTB2R_CMP2               (0x1u<<4)
#define HRTIM_RSTB2R_CMP1               (0x1u<<3)
#define HRTIM_RSTB2R_PER                (0x1u<<2)
#define HRTIM_RSTB2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTB2R_SST                (0x1u<<0)

