Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// EEFBR1 Configuration

#define HRTIM_EEFBR1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFBR1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFBR1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFBR1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFBR1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFBR1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFBR1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFBR1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFBR1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFBR1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFBR1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFBR1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFBR1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFBR1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFBR1_EE1LTCH            (0x1u<<0)

#define HRTIM_EEFBR1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFBR1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFBR1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFBR1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFBR2 Configuration

#define HRTIM_EEFBR2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFBR2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFBR2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFBR2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFBR2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFBR2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFBR2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFBR2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFBR2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFBR2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFBR2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFBR2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFBR2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFBR2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFBR2_EE6LTCH            (0x1u<<0)

// RSTBR Configuration

#define HRTIM_RSTBR_TIMFCMP2            (0x1u<<31)
#define HRTIM_RSTBR_TIMECMP4            (0x1u<<30)
#define HRTIM_RSTBR_TIMECMP2            (0x1u<<29)
#define HRTIM_RSTBR_TIMECMP1            (0x1u<<28)
#define HRTIM_RSTBR_TIMDCMP4            (0x1u<<27)
#define HRTIM_RSTBR_TIMDCMP2            (0x1u<<26)
#define HRTIM_RSTBR_TIMDCMP1            (0x1u<<25)
#define HRTIM_RSTBR_TIMCCMP4            (0x1u<<24)
#define HRTIM_RSTBR_TIMCCMP2            (0x1u<<23)
#define HRTIM_RSTBR_TIMCCMP1            (0x1u<<22)
#define HRTIM_RSTBR_TIMACMP4            (0x1u<<21)
#define HRTIM_RSTBR_TIMACMP2            (0x1u<<20)
#define HRTIM_RSTBR_TIMACMP1            (0x1u<<19)
#define HRTIM_RSTBR_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTBR_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTBR_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTBR_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTBR_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTBR_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTBR_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTBR_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTBR_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTBR_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTBR_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTBR_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTBR_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTBR_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTBR_MSTPER              (0x1u<<4)
#define HRTIM_RSTBR_CMP4                (0x1u<<3)
#define HRTIM_RSTBR_CMP2                (0x1u<<2)
#define HRTIM_RSTBR_UPDT                (0x1u<<1)
#define HRTIM_RSTBR_TIMFCMP1            (0x1u<<0)

// CHPBR Configuration

#define HRTIM_CHPBR_STRTPW              (0xFu<<7)
#define HRTIM_CHPBR_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPBR_CARDTY              (0x7u<<4)
#define HRTIM_CHPBR_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPBR_CARFRQ              (0xFu<<0)
#define HRTIM_CHPBR_CARFRQ_0            (0x1u<<0)

#define HRTIM_CHPBR_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPBR_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPBR_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPBR_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPBR_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPBR_CARFRQ_B_0XF        (0xFu<<0)

// CPT1BCR Configuration

#define HRTIM_CPT1BCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT1BCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT1BCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT1BCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT1BCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT1BCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT1BCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT1BCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT1BCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT1BCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT1BCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT1BCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT1BCR_TFCMP2            (0x1u<<19)
#define HRTIM_CPT1BCR_TFCMP1            (0x1u<<18)
#define HRTIM_CPT1BCR_TF1RST            (0x1u<<17)
#define HRTIM_CPT1BCR_TF1SET            (0x1u<<16)
#define HRTIM_CPT1BCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT1BCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT1BCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT1BCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT1BCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1BCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1BCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1BCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1BCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1BCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1BCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1BCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1BCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1BCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1BCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1BCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1BCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT1BCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT1BCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT1BCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT1BCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT1BCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT1BCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT1BCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT1BCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1BCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1BCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1BCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1BCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1BCR_SWCPT_B_0X1       (0x1u<<0)

// CPT2BCR Configuration

#define HRTIM_CPT2BCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT2BCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT2BCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT2BCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT2BCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT2BCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT2BCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT2BCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT2BCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT2BCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT2BCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT2BCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT2BCR_TFCMP2            (0x1u<<19)
#define HRTIM_CPT2BCR_TFCMP1            (0x1u<<18)
#define HRTIM_CPT2BCR_TF1RST            (0x1u<<17)
#define HRTIM_CPT2BCR_TF1SET            (0x1u<<16)
#define HRTIM_CPT2BCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT2BCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT2BCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT2BCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT2BCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2BCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2BCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2BCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2BCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2BCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2BCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2BCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2BCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2BCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2BCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2BCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2BCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT2BCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT2BCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT2BCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT2BCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT2BCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT2BCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT2BCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT2BCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2BCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2BCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2BCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2BCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2BCR_SWCPT_B_0X1       (0x1u<<0)

// OUTBR Configuration

#define HRTIM_OUTBR_DIDL2               (0x1u<<23)
#define HRTIM_OUTBR_CHP2                (0x1u<<22)
#define HRTIM_OUTBR_FAULT2              (0x3u<<20)
#define HRTIM_OUTBR_FAULT2_0            (0x1u<<20)
#define HRTIM_OUTBR_IDLES2              (0x1u<<19)
#define HRTIM_OUTBR_IDLEM2              (0x1u<<18)
#define HRTIM_OUTBR_POL2                (0x1u<<17)
#define HRTIM_OUTBR_BIAR                (0x1u<<14)
#define HRTIM_OUTBR_DLYPRT              (0x7u<<10)
#define HRTIM_OUTBR_DLYPRT_0            (0x1u<<10)
#define HRTIM_OUTBR_DLYPRTEN            (0x1u<<9)
#define HRTIM_OUTBR_DTEN                (0x1u<<8)
#define HRTIM_OUTBR_DIDL1               (0x1u<<7)
#define HRTIM_OUTBR_CHP1                (0x1u<<6)
#define HRTIM_OUTBR_FAULT1              (0x3u<<4)
#define HRTIM_OUTBR_FAULT1_0            (0x1u<<4)
#define HRTIM_OUTBR_IDLES1              (0x1u<<3)
#define HRTIM_OUTBR_IDLEM1              (0x1u<<2)
#define HRTIM_OUTBR_POL1                (0x1u<<1)

#define HRTIM_OUTBR_DIDL2_B_0X0         (0x0u<<23)
#define HRTIM_OUTBR_DIDL2_B_0X1         (0x1u<<23)
#define HRTIM_OUTBR_CHP2_B_0X0          (0x0u<<22)
#define HRTIM_OUTBR_CHP2_B_0X1          (0x1u<<22)
#define HRTIM_OUTBR_FAULT2_B_0X0        (0x0u<<20)
#define HRTIM_OUTBR_FAULT2_B_0X1        (0x1u<<20)
#define HRTIM_OUTBR_FAULT2_B_0X2        (0x2u<<20)
#define HRTIM_OUTBR_FAULT2_B_0X3        (0x3u<<20)
#define HRTIM_OUTBR_IDLES2_B_0X0        (0x0u<<19)
#define HRTIM_OUTBR_IDLES2_B_0X1        (0x1u<<19)
#define HRTIM_OUTBR_IDLEM2_B_0X0        (0x0u<<18)
#define HRTIM_OUTBR_IDLEM2_B_0X1        (0x1u<<18)
#define HRTIM_OUTBR_POL2_B_0X0          (0x0u<<17)
#define HRTIM_OUTBR_POL2_B_0X1          (0x1u<<17)
#define HRTIM_OUTBR_BIAR_B_0X0          (0x0u<<14)
#define HRTIM_OUTBR_BIAR_B_0X1          (0x1u<<14)
#define HRTIM_OUTBR_DLYPRT_B_0X0        (0x0u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X1        (0x1u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X2        (0x2u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X3        (0x3u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X4        (0x4u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X5        (0x5u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X6        (0x6u<<10)
#define HRTIM_OUTBR_DLYPRT_B_0X7        (0x7u<<10)
#define HRTIM_OUTBR_DLYPRTEN_B_0X0      (0x0u<<9)
#define HRTIM_OUTBR_DLYPRTEN_B_0X1      (0x1u<<9)
#define HRTIM_OUTBR_DTEN_B_0X0          (0x0u<<8)
#define HRTIM_OUTBR_DTEN_B_0X1          (0x1u<<8)
#define HRTIM_OUTBR_DIDL1_B_0X0         (0x0u<<7)
#define HRTIM_OUTBR_DIDL1_B_0X1         (0x1u<<7)
#define HRTIM_OUTBR_CHP1_B_0X0          (0x0u<<6)
#define HRTIM_OUTBR_CHP1_B_0X1          (0x1u<<6)
#define HRTIM_OUTBR_FAULT1_B_0X0        (0x0u<<4)
#define HRTIM_OUTBR_FAULT1_B_0X1        (0x1u<<4)
#define HRTIM_OUTBR_FAULT1_B_0X2        (0x2u<<4)
#define HRTIM_OUTBR_FAULT1_B_0X3        (0x3u<<4)
#define HRTIM_OUTBR_IDLES1_B_0X0        (0x0u<<3)
#define HRTIM_OUTBR_IDLES1_B_0X1        (0x1u<<3)
#define HRTIM_OUTBR_IDLEM1_B_0X0        (0x0u<<2)
#define HRTIM_OUTBR_IDLEM1_B_0X1        (0x1u<<2)
#define HRTIM_OUTBR_POL1_B_0X0          (0x0u<<1)
#define HRTIM_OUTBR_POL1_B_0X1          (0x1u<<1)

// FLTBR Configuration

