Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_FLTBR_FLTLCK              (0x1u<<31)
#define HRTIM_FLTBR_FLT6EN              (0x1u<<5)
#define HRTIM_FLTBR_FLT5EN              (0x1u<<4)
#define HRTIM_FLTBR_FLT4EN              (0x1u<<3)
#define HRTIM_FLTBR_FLT3EN              (0x1u<<2)
#define HRTIM_FLTBR_FLT2EN              (0x1u<<1)
#define HRTIM_FLTBR_FLT1EN              (0x1u<<0)

#define HRTIM_FLTBR_FLTLCK_B_0X0        (0x0u<<31)
#define HRTIM_FLTBR_FLTLCK_B_0X1        (0x1u<<31)
#define HRTIM_FLTBR_FLT6EN_B_0X0        (0x0u<<5)
#define HRTIM_FLTBR_FLT6EN_B_0X1        (0x1u<<5)
#define HRTIM_FLTBR_FLT5EN_B_0X0        (0x0u<<4)
#define HRTIM_FLTBR_FLT5EN_B_0X1        (0x1u<<4)
#define HRTIM_FLTBR_FLT4EN_B_0X0        (0x0u<<3)
#define HRTIM_FLTBR_FLT4EN_B_0X1        (0x1u<<3)
#define HRTIM_FLTBR_FLT3EN_B_0X0        (0x0u<<2)
#define HRTIM_FLTBR_FLT3EN_B_0X1        (0x1u<<2)
#define HRTIM_FLTBR_FLT2EN_B_0X0        (0x0u<<1)
#define HRTIM_FLTBR_FLT2EN_B_0X1        (0x1u<<1)
#define HRTIM_FLTBR_FLT1EN_B_0X0        (0x0u<<0)
#define HRTIM_FLTBR_FLT1EN_B_0X1        (0x1u<<0)

// TIMBCR2 Configuration

#define HRTIM_TIMBCR2_TRGHLF            (0x1u<<20)
#define HRTIM_TIMBCR2_GTCMP3            (0x1u<<17)
#define HRTIM_TIMBCR2_GTCMP1            (0x1u<<16)
#define HRTIM_TIMBCR2_FEROM             (0x3u<<14)
#define HRTIM_TIMBCR2_FEROM_0           (0x1u<<14)
#define HRTIM_TIMBCR2_BMROM             (0x3u<<12)
#define HRTIM_TIMBCR2_BMROM_0           (0x1u<<12)
#define HRTIM_TIMBCR2_ADROM             (0x3u<<10)
#define HRTIM_TIMBCR2_ADROM_0           (0x1u<<10)
#define HRTIM_TIMBCR2_OUTROM            (0x3u<<8)
#define HRTIM_TIMBCR2_OUTROM_0          (0x1u<<8)
#define HRTIM_TIMBCR2_ROM               (0x3u<<6)
#define HRTIM_TIMBCR2_ROM_0             (0x1u<<6)
#define HRTIM_TIMBCR2_UDM               (0x1u<<4)
#define HRTIM_TIMBCR2_DCDR              (0x1u<<2)
#define HRTIM_TIMBCR2_DCDS              (0x1u<<1)
#define HRTIM_TIMBCR2_DCDE              (0x1u<<0)

#define HRTIM_TIMBCR2_TRGHLF_B_0X0      (0x0u<<20)
#define HRTIM_TIMBCR2_TRGHLF_B_0X1      (0x1u<<20)
#define HRTIM_TIMBCR2_GTCMP3_B_0X0      (0x0u<<17)
#define HRTIM_TIMBCR2_GTCMP3_B_0X1      (0x1u<<17)
#define HRTIM_TIMBCR2_GTCMP1_B_0X0      (0x0u<<16)
#define HRTIM_TIMBCR2_GTCMP1_B_0X1      (0x1u<<16)
#define HRTIM_TIMBCR2_FEROM_B_0X0       (0x0u<<14)
#define HRTIM_TIMBCR2_FEROM_B_0X1       (0x1u<<14)
#define HRTIM_TIMBCR2_FEROM_B_0X2       (0x2u<<14)
#define HRTIM_TIMBCR2_BMROM_B_0X0       (0x0u<<12)
#define HRTIM_TIMBCR2_BMROM_B_0X1       (0x1u<<12)
#define HRTIM_TIMBCR2_BMROM_B_0X2       (0x2u<<12)
#define HRTIM_TIMBCR2_ADROM_B_0X0       (0x0u<<10)
#define HRTIM_TIMBCR2_ADROM_B_0X1       (0x1u<<10)
#define HRTIM_TIMBCR2_ADROM_B_0X2       (0x2u<<10)
#define HRTIM_TIMBCR2_OUTROM_B_0X0      (0x0u<<8)
#define HRTIM_TIMBCR2_OUTROM_B_0X1      (0x1u<<8)
#define HRTIM_TIMBCR2_OUTROM_B_0X2      (0x2u<<8)
#define HRTIM_TIMBCR2_ROM_B_0X0         (0x0u<<6)
#define HRTIM_TIMBCR2_ROM_B_0X1         (0x1u<<6)
#define HRTIM_TIMBCR2_ROM_B_0X2         (0x2u<<6)
#define HRTIM_TIMBCR2_UDM_B_0X0         (0x0u<<4)
#define HRTIM_TIMBCR2_UDM_B_0X1         (0x1u<<4)
#define HRTIM_TIMBCR2_DCDR_B_0X0        (0x0u<<2)
#define HRTIM_TIMBCR2_DCDR_B_0X1        (0x1u<<2)
#define HRTIM_TIMBCR2_DCDS_B_0X0        (0x0u<<1)
#define HRTIM_TIMBCR2_DCDS_B_0X1        (0x1u<<1)
#define HRTIM_TIMBCR2_DCDE_B_0X0        (0x0u<<0)
#define HRTIM_TIMBCR2_DCDE_B_0X1        (0x1u<<0)

// TIMBEEFR3 Configuration

#define HRTIM_TIMBEEFR3_EEVACNT         (0x3Fu<<8)
#define HRTIM_TIMBEEFR3_EEVACNT_0       (0x1u<<8)
#define HRTIM_TIMBEEFR3_EEVASEL         (0xFu<<4)
#define HRTIM_TIMBEEFR3_EEVASEL_0       (0x1u<<4)
#define HRTIM_TIMBEEFR3_EEVARSTM        (0x1u<<2)
#define HRTIM_TIMBEEFR3_EEVACRES        (0x1u<<1)
#define HRTIM_TIMBEEFR3_EEVACE          (0x1u<<0)

#define HRTIM_TIMBEEFR3_EEVASEL_B_0X0   (0x0u<<4)
#define HRTIM_TIMBEEFR3_EEVASEL_B_0X1   (0x1u<<4)
#define HRTIM_TIMBEEFR3_EEVARSTM_B_0X0  (0x0u<<2)
#define HRTIM_TIMBEEFR3_EEVARSTM_B_0X1  (0x1u<<2)
#define HRTIM_TIMBEEFR3_EEVACRES_B_0X0  (0x0u<<1)
#define HRTIM_TIMBEEFR3_EEVACRES_B_0X1  (0x1u<<1)
#define HRTIM_TIMBEEFR3_EEVACE_B_0X0    (0x0u<<0)
#define HRTIM_TIMBEEFR3_EEVACE_B_0X1    (0x1u<<0)

// TIMCCR Configuration

#define HRTIM_TIMCCR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMCCR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMCCR_PREEN              (0x1u<<27)
#define HRTIM_TIMCCR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMCCR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMCCR_MSTU               (0x1u<<24)
#define HRTIM_TIMCCR_TEU                (0x1u<<23)
#define HRTIM_TIMCCR_TDU                (0x1u<<22)
#define HRTIM_TIMCCR_TCU                (0x1u<<21)
#define HRTIM_TIMCCR_TBU                (0x1u<<20)
#define HRTIM_TIMCCR_TAU                (0x1u<<19)
#define HRTIM_TIMCCR_TCRSTU             (0x1u<<18)
#define HRTIM_TIMCCR_TCREPU             (0x1u<<17)
#define HRTIM_TIMCCR_TFU                (0x1u<<16)
#define HRTIM_TIMCCR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMCCR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMCCR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMCCR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMCCR_SYNCSTRTC          (0x1u<<11)
#define HRTIM_TIMCCR_SYNCRSTC           (0x1u<<10)
#define HRTIM_TIMCCR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMCCR_INTLVD             (0x3u<<7)
#define HRTIM_TIMCCR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMCCR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMCCR_HALF               (0x1u<<5)
#define HRTIM_TIMCCR_RETRIG             (0x1u<<4)
#define HRTIM_TIMCCR_CONT               (0x1u<<3)
#define HRTIM_TIMCCR_CKPSCC             (0x7u<<0)
#define HRTIM_TIMCCR_CKPSCC_0           (0x1u<<0)

#define HRTIM_TIMCCR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMCCR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMCCR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMCCR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMCCR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMCCR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMCCR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMCCR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMCCR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMCCR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMCCR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMCCR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMCCR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMCCR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMCCR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMCCR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMCCR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMCCR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMCCR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMCCR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMCCR_TCRSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMCCR_TCRSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMCCR_TCREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMCCR_TCREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMCCR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMCCR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMCCR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMCCR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMCCR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMCCR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMCCR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMCCR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMCCR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMCCR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMCCR_SYNCSTRTC_B_0X0    (0x0u<<11)
#define HRTIM_TIMCCR_SYNCSTRTC_B_0X1    (0x1u<<11)
#define HRTIM_TIMCCR_SYNCRSTC_B_0X0     (0x0u<<10)
#define HRTIM_TIMCCR_SYNCRSTC_B_0X1     (0x1u<<10)
#define HRTIM_TIMCCR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMCCR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMCCR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMCCR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMCCR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMCCR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMCCR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMCCR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMCCR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMCCR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMCCR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMCCR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMCCR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMCCR_CONT_B_0X1         (0x1u<<3)

// TIMCISR Configuration

#define HRTIM_TIMCISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMCISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMCISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMCISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMCISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMCISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMCISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMCISR_RST               (0x1u<<13)
#define HRTIM_TIMCISR_RSTC2             (0x1u<<12)
#define HRTIM_TIMCISR_SETC2             (0x1u<<11)
#define HRTIM_TIMCISR_RSTC1             (0x1u<<10)
#define HRTIM_TIMCISR_SETC1             (0x1u<<9)
#define HRTIM_TIMCISR_CPT2              (0x1u<<8)
#define HRTIM_TIMCISR_CPT1              (0x1u<<7)
#define HRTIM_TIMCISR_UPD               (0x1u<<6)
#define HRTIM_TIMCISR_REP               (0x1u<<4)
#define HRTIM_TIMCISR_CMP4              (0x1u<<3)
#define HRTIM_TIMCISR_CMP3              (0x1u<<2)
#define HRTIM_TIMCISR_CMP2              (0x1u<<1)
#define HRTIM_TIMCISR_CMP1              (0x1u<<0)

