Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_TIMCISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMCISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMCISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMCISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMCISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMCISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMCISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMCISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMCISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMCISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMCISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMCISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMCISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMCISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMCISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMCISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMCISR_RSTC1_B_0X0       (0x0u<<10)
#define HRTIM_TIMCISR_RSTC1_B_0X1       (0x1u<<10)
#define HRTIM_TIMCISR_SETC1_B_0X0       (0x0u<<9)
#define HRTIM_TIMCISR_SETC1_B_0X1       (0x1u<<9)
#define HRTIM_TIMCISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMCISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMCISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMCISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMCISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMCISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMCISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMCISR_CMP1_B_0X1        (0x1u<<0)

// TIMCICR Configuration

#define HRTIM_TIMCICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMCICR_RSTC              (0x1u<<13)
#define HRTIM_TIMCICR_RSTC2C            (0x1u<<12)
#define HRTIM_TIMCICR_SETC2C            (0x1u<<11)
#define HRTIM_TIMCICR_RSTC1C            (0x1u<<10)
#define HRTIM_TIMCICR_SETC1C            (0x1u<<9)
#define HRTIM_TIMCICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMCICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMCICR_UPDC              (0x1u<<6)
#define HRTIM_TIMCICR_REPC              (0x1u<<4)
#define HRTIM_TIMCICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMCICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMCICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMCICR_CMP1C             (0x1u<<0)

// TIMCDIER Configuration

#define HRTIM_TIMCDIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMCDIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMCDIER_RSTC2DE          (0x1u<<28)
#define HRTIM_TIMCDIER_SETC2DE          (0x1u<<27)
#define HRTIM_TIMCDIER_RSTC1DE          (0x1u<<26)
#define HRTIM_TIMCDIER_SETC1DE          (0x1u<<25)
#define HRTIM_TIMCDIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMCDIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMCDIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMCDIER_REPDE            (0x1u<<20)
#define HRTIM_TIMCDIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMCDIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMCDIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMCDIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMCDIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMCDIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMCDIER_RSTC2IE          (0x1u<<12)
#define HRTIM_TIMCDIER_SETC2IE          (0x1u<<11)
#define HRTIM_TIMCDIER_RSTC1IE          (0x1u<<10)
#define HRTIM_TIMCDIER_SETC1IE          (0x1u<<9)
#define HRTIM_TIMCDIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMCDIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMCDIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMCDIER_REPIE            (0x1u<<4)
#define HRTIM_TIMCDIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMCDIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMCDIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMCDIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMCDIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMCDIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMCDIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMCDIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMCDIER_RSTC1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMCDIER_RSTC1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMCDIER_SETC1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMCDIER_SETC1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMCDIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMCDIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMCDIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMCDIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMCDIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMCDIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMCDIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMCDIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMCDIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMCDIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMCDIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMCDIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMCDIER_RSTC1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMCDIER_RSTC1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMCDIER_SETC1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMCDIER_SETC1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMCDIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMCDIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMCDIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMCDIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMCDIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMCDIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMCDIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMCDIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTCR Configuration

#define HRTIM_CNTCR_CNTC                (0xFFFFu<<0)
#define HRTIM_CNTCR_CNTC_0              (0x1u<<0)

// PERCR Configuration

#define HRTIM_PERCR_PERC                (0xFFFFu<<0)
#define HRTIM_PERCR_PERC_0              (0x1u<<0)

// REPCR Configuration

#define HRTIM_REPCR_REPC                (0xFFu<<0)
#define HRTIM_REPCR_REPC_0              (0x1u<<0)

// CMP1CR Configuration

#define HRTIM_CMP1CR_CMP1C              (0xFFFFu<<0)
#define HRTIM_CMP1CR_CMP1C_0            (0x1u<<0)

// CMP1CCR Configuration

#define HRTIM_CMP1CCR_REPC              (0xFFu<<16)
#define HRTIM_CMP1CCR_REPC_0            (0x1u<<16)
#define HRTIM_CMP1CCR_CMP1C             (0xFFFFu<<0)
#define HRTIM_CMP1CCR_CMP1C_0           (0x1u<<0)

// CMP2CR Configuration

#define HRTIM_CMP2CR_CMP2C              (0xFFFFu<<0)
#define HRTIM_CMP2CR_CMP2C_0            (0x1u<<0)

