Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// CMP3CR Configuration

#define HRTIM_CMP3CR_CMP3C              (0xFFFFu<<0)
#define HRTIM_CMP3CR_CMP3C_0            (0x1u<<0)

// CMP4CR Configuration

#define HRTIM_CMP4CR_CMP4C              (0xFFFFu<<0)
#define HRTIM_CMP4CR_CMP4C_0            (0x1u<<0)

// CPT1CR Configuration

#define HRTIM_CPT1CR_DIR                (0x1u<<16)
#define HRTIM_CPT1CR_CPT1C              (0xFFFFu<<0)
#define HRTIM_CPT1CR_CPT1C_0            (0x1u<<0)

#define HRTIM_CPT1CR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1CR_DIR_B_0X1          (0x1u<<16)

// CPT2CR Configuration

#define HRTIM_CPT2CR_DIR                (0x1u<<16)
#define HRTIM_CPT2CR_CPT2C              (0xFFFFu<<0)
#define HRTIM_CPT2CR_CPT2C_0            (0x1u<<0)

#define HRTIM_CPT2CR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2CR_DIR_B_0X1          (0x1u<<16)

// DTCR Configuration

#define HRTIM_DTCR_DTFLKC               (0x1u<<31)
#define HRTIM_DTCR_DTFSLKC              (0x1u<<30)
#define HRTIM_DTCR_SDTFC                (0x1u<<25)
#define HRTIM_DTCR_DTFC                 (0x1FFu<<16)
#define HRTIM_DTCR_DTFC_0               (0x1u<<16)
#define HRTIM_DTCR_DTRLKC               (0x1u<<15)
#define HRTIM_DTCR_DTRSLKC              (0x1u<<14)
#define HRTIM_DTCR_DTPRSC               (0x7u<<10)
#define HRTIM_DTCR_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTCR_SDTRC                (0x1u<<9)
#define HRTIM_DTCR_DTRC                 (0x1FFu<<0)
#define HRTIM_DTCR_DTRC_0               (0x1u<<0)

#define HRTIM_DTCR_DTFLKC_B_0X0         (0x0u<<31)
#define HRTIM_DTCR_DTFLKC_B_0X1         (0x1u<<31)
#define HRTIM_DTCR_DTFSLKC_B_0X0        (0x0u<<30)
#define HRTIM_DTCR_DTFSLKC_B_0X1        (0x1u<<30)
#define HRTIM_DTCR_SDTFC_B_0X0          (0x0u<<25)
#define HRTIM_DTCR_SDTFC_B_0X1          (0x1u<<25)
#define HRTIM_DTCR_DTRLKC_B_0X0         (0x0u<<15)
#define HRTIM_DTCR_DTRLKC_B_0X1         (0x1u<<15)
#define HRTIM_DTCR_DTRSLKC_B_0X0        (0x0u<<14)
#define HRTIM_DTCR_DTRSLKC_B_0X1        (0x1u<<14)
#define HRTIM_DTCR_SDTRC_B_0X0          (0x0u<<9)
#define HRTIM_DTCR_SDTRC_B_0X1          (0x1u<<9)

// SETC1R Configuration

#define HRTIM_SETC1R_UPDATE             (0x1u<<31)
#define HRTIM_SETC1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETC1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETC1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETC1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETC1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETC1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETC1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETC1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETC1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETC1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETC1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETC1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETC1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETC1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETC1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETC1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETC1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETC1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETC1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETC1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETC1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETC1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETC1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETC1R_MSTPER             (0x1u<<7)
#define HRTIM_SETC1R_CMP4               (0x1u<<6)
#define HRTIM_SETC1R_CMP3               (0x1u<<5)
#define HRTIM_SETC1R_CMP2               (0x1u<<4)
#define HRTIM_SETC1R_CMP1               (0x1u<<3)
#define HRTIM_SETC1R_PER                (0x1u<<2)
#define HRTIM_SETC1R_RESYNC             (0x1u<<1)
#define HRTIM_SETC1R_SST                (0x1u<<0)

// RSTC1R Configuration

#define HRTIM_RSTC1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTC1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTC1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTC1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTC1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTC1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTC1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTC1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTC1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTC1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTC1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTC1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTC1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTC1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTC1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTC1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTC1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTC1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTC1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTC1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTC1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTC1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTC1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTC1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTC1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTC1R_CMP4               (0x1u<<6)
#define HRTIM_RSTC1R_CMP3               (0x1u<<5)
#define HRTIM_RSTC1R_CMP2               (0x1u<<4)
#define HRTIM_RSTC1R_CMP1               (0x1u<<3)
#define HRTIM_RSTC1R_PER                (0x1u<<2)
#define HRTIM_RSTC1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTC1R_SST                (0x1u<<0)

// SETC2R Configuration

#define HRTIM_SETC2R_UPDATE             (0x1u<<31)
#define HRTIM_SETC2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETC2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETC2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETC2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETC2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETC2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETC2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETC2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETC2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETC2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETC2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETC2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETC2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETC2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETC2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETC2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETC2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETC2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETC2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETC2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETC2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETC2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETC2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETC2R_MSTPER             (0x1u<<7)
#define HRTIM_SETC2R_CMP4               (0x1u<<6)
#define HRTIM_SETC2R_CMP3               (0x1u<<5)
#define HRTIM_SETC2R_CMP2               (0x1u<<4)
#define HRTIM_SETC2R_CMP1               (0x1u<<3)
#define HRTIM_SETC2R_PER                (0x1u<<2)
#define HRTIM_SETC2R_RESYNC             (0x1u<<1)
#define HRTIM_SETC2R_SST                (0x1u<<0)

// RSTC2R Configuration

#define HRTIM_RSTC2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTC2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTC2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTC2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTC2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTC2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTC2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTC2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTC2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTC2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTC2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTC2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTC2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTC2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTC2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTC2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTC2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTC2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTC2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTC2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTC2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTC2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTC2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTC2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTC2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTC2R_CMP4               (0x1u<<6)
#define HRTIM_RSTC2R_CMP3               (0x1u<<5)
#define HRTIM_RSTC2R_CMP2               (0x1u<<4)
#define HRTIM_RSTC2R_CMP1               (0x1u<<3)
#define HRTIM_RSTC2R_PER                (0x1u<<2)
#define HRTIM_RSTC2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTC2R_SST                (0x1u<<0)

// EEFCR1 Configuration

