Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_EEFCR1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFCR1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFCR1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFCR1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFCR1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFCR1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFCR1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFCR1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFCR1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFCR1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFCR1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFCR1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFCR1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFCR1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFCR1_EE1LTCH            (0x1u<<0)

#define HRTIM_EEFCR1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFCR1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFCR1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFCR1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFCR2 Configuration

#define HRTIM_EEFCR2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFCR2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFCR2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFCR2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFCR2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFCR2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFCR2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFCR2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFCR2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFCR2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFCR2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFCR2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFCR2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFCR2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFCR2_EE6LTCH            (0x1u<<0)

// CHPCR Configuration

#define HRTIM_CHPCR_STRTPW              (0xFu<<7)
#define HRTIM_CHPCR_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPCR_CARDTY              (0x7u<<4)
#define HRTIM_CHPCR_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPCR_CARFRQ              (0xFu<<0)
#define HRTIM_CHPCR_CARFRQ_0            (0x1u<<0)

#define HRTIM_CHPCR_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPCR_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPCR_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPCR_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPCR_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPCR_CARFRQ_B_0XF        (0xFu<<0)

// CPT1CCR Configuration

#define HRTIM_CPT1CCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT1CCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT1CCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT1CCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT1CCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT1CCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT1CCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT1CCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT1CCR_TFCMP2            (0x1u<<23)
#define HRTIM_CPT1CCR_TFCMP1            (0x1u<<22)
#define HRTIM_CPT1CCR_TF1RST            (0x1u<<21)
#define HRTIM_CPT1CCR_TF1SET            (0x1u<<20)
#define HRTIM_CPT1CCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT1CCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT1CCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT1CCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT1CCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT1CCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT1CCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT1CCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT1CCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1CCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1CCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1CCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1CCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1CCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1CCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1CCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1CCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1CCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1CCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1CCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1CCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT1CCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT1CCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT1CCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT1CCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT1CCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT1CCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT1CCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT1CCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1CCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1CCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1CCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1CCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1CCR_SWCPT_B_0X1       (0x1u<<0)

// CPT2CCR Configuration

#define HRTIM_CPT2CCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT2CCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT2CCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT2CCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT2CCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT2CCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT2CCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT2CCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT2CCR_TFCMP2            (0x1u<<23)
#define HRTIM_CPT2CCR_TFCMP1            (0x1u<<22)
#define HRTIM_CPT2CCR_TF1RST            (0x1u<<21)
#define HRTIM_CPT2CCR_TF1SET            (0x1u<<20)
#define HRTIM_CPT2CCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT2CCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT2CCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT2CCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT2CCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT2CCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT2CCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT2CCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT2CCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2CCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2CCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2CCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2CCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2CCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2CCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2CCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2CCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2CCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2CCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2CCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2CCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT2CCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT2CCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT2CCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT2CCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT2CCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT2CCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT2CCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT2CCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2CCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2CCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2CCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2CCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2CCR_SWCPT_B_0X1       (0x1u<<0)

// OUTCR Configuration

#define HRTIM_OUTCR_DIDL2               (0x1u<<23)
#define HRTIM_OUTCR_CHP2                (0x1u<<22)
#define HRTIM_OUTCR_FAULT2              (0x3u<<20)
#define HRTIM_OUTCR_FAULT2_0            (0x1u<<20)
#define HRTIM_OUTCR_IDLES2              (0x1u<<19)
#define HRTIM_OUTCR_IDLEM2              (0x1u<<18)
#define HRTIM_OUTCR_POL2                (0x1u<<17)
#define HRTIM_OUTCR_BIAR                (0x1u<<14)
#define HRTIM_OUTCR_DLYPRT              (0x7u<<10)
#define HRTIM_OUTCR_DLYPRT_0            (0x1u<<10)
#define HRTIM_OUTCR_DLYPRTEN            (0x1u<<9)
#define HRTIM_OUTCR_DTEN                (0x1u<<8)
#define HRTIM_OUTCR_DIDL1               (0x1u<<7)
#define HRTIM_OUTCR_CHP1                (0x1u<<6)
#define HRTIM_OUTCR_FAULT1              (0x3u<<4)
#define HRTIM_OUTCR_FAULT1_0            (0x1u<<4)
#define HRTIM_OUTCR_IDLES1              (0x1u<<3)
#define HRTIM_OUTCR_IDLEM1              (0x1u<<2)
#define HRTIM_OUTCR_POL1                (0x1u<<1)

#define HRTIM_OUTCR_DIDL2_B_0X0         (0x0u<<23)
#define HRTIM_OUTCR_DIDL2_B_0X1         (0x1u<<23)
#define HRTIM_OUTCR_CHP2_B_0X0          (0x0u<<22)
#define HRTIM_OUTCR_CHP2_B_0X1          (0x1u<<22)
#define HRTIM_OUTCR_FAULT2_B_0X0        (0x0u<<20)
#define HRTIM_OUTCR_FAULT2_B_0X1        (0x1u<<20)
#define HRTIM_OUTCR_FAULT2_B_0X2        (0x2u<<20)
#define HRTIM_OUTCR_FAULT2_B_0X3        (0x3u<<20)
#define HRTIM_OUTCR_IDLES2_B_0X0        (0x0u<<19)
#define HRTIM_OUTCR_IDLES2_B_0X1        (0x1u<<19)
#define HRTIM_OUTCR_IDLEM2_B_0X0        (0x0u<<18)
#define HRTIM_OUTCR_IDLEM2_B_0X1        (0x1u<<18)
#define HRTIM_OUTCR_POL2_B_0X0          (0x0u<<17)
#define HRTIM_OUTCR_POL2_B_0X1          (0x1u<<17)
#define HRTIM_OUTCR_BIAR_B_0X0          (0x0u<<14)
#define HRTIM_OUTCR_BIAR_B_0X1          (0x1u<<14)
#define HRTIM_OUTCR_DLYPRT_B_0X0        (0x0u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X1        (0x1u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X2        (0x2u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X3        (0x3u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X4        (0x4u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X5        (0x5u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X6        (0x6u<<10)
#define HRTIM_OUTCR_DLYPRT_B_0X7        (0x7u<<10)
#define HRTIM_OUTCR_DLYPRTEN_B_0X0      (0x0u<<9)
#define HRTIM_OUTCR_DLYPRTEN_B_0X1      (0x1u<<9)
#define HRTIM_OUTCR_DTEN_B_0X0          (0x0u<<8)
#define HRTIM_OUTCR_DTEN_B_0X1          (0x1u<<8)
#define HRTIM_OUTCR_DIDL1_B_0X0         (0x0u<<7)
#define HRTIM_OUTCR_DIDL1_B_0X1         (0x1u<<7)
#define HRTIM_OUTCR_CHP1_B_0X0          (0x0u<<6)
#define HRTIM_OUTCR_CHP1_B_0X1          (0x1u<<6)
#define HRTIM_OUTCR_FAULT1_B_0X0        (0x0u<<4)
#define HRTIM_OUTCR_FAULT1_B_0X1        (0x1u<<4)
#define HRTIM_OUTCR_FAULT1_B_0X2        (0x2u<<4)
#define HRTIM_OUTCR_FAULT1_B_0X3        (0x3u<<4)
#define HRTIM_OUTCR_IDLES1_B_0X0        (0x0u<<3)
#define HRTIM_OUTCR_IDLES1_B_0X1        (0x1u<<3)
#define HRTIM_OUTCR_IDLEM1_B_0X0        (0x0u<<2)
#define HRTIM_OUTCR_IDLEM1_B_0X1        (0x1u<<2)
#define HRTIM_OUTCR_POL1_B_0X0          (0x0u<<1)
#define HRTIM_OUTCR_POL1_B_0X1          (0x1u<<1)

// FLTCR Configuration

#define HRTIM_FLTCR_FLTLCK              (0x1u<<31)
#define HRTIM_FLTCR_FLT6EN              (0x1u<<5)
#define HRTIM_FLTCR_FLT5EN              (0x1u<<4)
#define HRTIM_FLTCR_FLT4EN              (0x1u<<3)
#define HRTIM_FLTCR_FLT3EN              (0x1u<<2)
#define HRTIM_FLTCR_FLT2EN              (0x1u<<1)
#define HRTIM_FLTCR_FLT1EN              (0x1u<<0)

