Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_FLTCR_FLTLCK_B_0X0        (0x0u<<31)
#define HRTIM_FLTCR_FLTLCK_B_0X1        (0x1u<<31)
#define HRTIM_FLTCR_FLT6EN_B_0X0        (0x0u<<5)
#define HRTIM_FLTCR_FLT6EN_B_0X1        (0x1u<<5)
#define HRTIM_FLTCR_FLT5EN_B_0X0        (0x0u<<4)
#define HRTIM_FLTCR_FLT5EN_B_0X1        (0x1u<<4)
#define HRTIM_FLTCR_FLT4EN_B_0X0        (0x0u<<3)
#define HRTIM_FLTCR_FLT4EN_B_0X1        (0x1u<<3)
#define HRTIM_FLTCR_FLT3EN_B_0X0        (0x0u<<2)
#define HRTIM_FLTCR_FLT3EN_B_0X1        (0x1u<<2)
#define HRTIM_FLTCR_FLT2EN_B_0X0        (0x0u<<1)
#define HRTIM_FLTCR_FLT2EN_B_0X1        (0x1u<<1)
#define HRTIM_FLTCR_FLT1EN_B_0X0        (0x0u<<0)
#define HRTIM_FLTCR_FLT1EN_B_0X1        (0x1u<<0)

// TIMCCR2 Configuration

#define HRTIM_TIMCCR2_TRGHLF            (0x1u<<20)
#define HRTIM_TIMCCR2_GTCMP3            (0x1u<<17)
#define HRTIM_TIMCCR2_GTCMP1            (0x1u<<16)
#define HRTIM_TIMCCR2_FEROM             (0x3u<<14)
#define HRTIM_TIMCCR2_FEROM_0           (0x1u<<14)
#define HRTIM_TIMCCR2_BMROM             (0x3u<<12)
#define HRTIM_TIMCCR2_BMROM_0           (0x1u<<12)
#define HRTIM_TIMCCR2_ADROM             (0x3u<<10)
#define HRTIM_TIMCCR2_ADROM_0           (0x1u<<10)
#define HRTIM_TIMCCR2_OUTROM            (0x3u<<8)
#define HRTIM_TIMCCR2_OUTROM_0          (0x1u<<8)
#define HRTIM_TIMCCR2_ROM               (0x3u<<6)
#define HRTIM_TIMCCR2_ROM_0             (0x1u<<6)
#define HRTIM_TIMCCR2_UDM               (0x1u<<4)
#define HRTIM_TIMCCR2_DCDR              (0x1u<<2)
#define HRTIM_TIMCCR2_DCDS              (0x1u<<1)
#define HRTIM_TIMCCR2_DCDE              (0x1u<<0)

#define HRTIM_TIMCCR2_TRGHLF_B_0X0      (0x0u<<20)
#define HRTIM_TIMCCR2_TRGHLF_B_0X1      (0x1u<<20)
#define HRTIM_TIMCCR2_GTCMP3_B_0X0      (0x0u<<17)
#define HRTIM_TIMCCR2_GTCMP3_B_0X1      (0x1u<<17)
#define HRTIM_TIMCCR2_GTCMP1_B_0X0      (0x0u<<16)
#define HRTIM_TIMCCR2_GTCMP1_B_0X1      (0x1u<<16)
#define HRTIM_TIMCCR2_FEROM_B_0X0       (0x0u<<14)
#define HRTIM_TIMCCR2_FEROM_B_0X1       (0x1u<<14)
#define HRTIM_TIMCCR2_FEROM_B_0X2       (0x2u<<14)
#define HRTIM_TIMCCR2_BMROM_B_0X0       (0x0u<<12)
#define HRTIM_TIMCCR2_BMROM_B_0X1       (0x1u<<12)
#define HRTIM_TIMCCR2_BMROM_B_0X2       (0x2u<<12)
#define HRTIM_TIMCCR2_ADROM_B_0X0       (0x0u<<10)
#define HRTIM_TIMCCR2_ADROM_B_0X1       (0x1u<<10)
#define HRTIM_TIMCCR2_ADROM_B_0X2       (0x2u<<10)
#define HRTIM_TIMCCR2_OUTROM_B_0X0      (0x0u<<8)
#define HRTIM_TIMCCR2_OUTROM_B_0X1      (0x1u<<8)
#define HRTIM_TIMCCR2_OUTROM_B_0X2      (0x2u<<8)
#define HRTIM_TIMCCR2_ROM_B_0X0         (0x0u<<6)
#define HRTIM_TIMCCR2_ROM_B_0X1         (0x1u<<6)
#define HRTIM_TIMCCR2_ROM_B_0X2         (0x2u<<6)
#define HRTIM_TIMCCR2_UDM_B_0X0         (0x0u<<4)
#define HRTIM_TIMCCR2_UDM_B_0X1         (0x1u<<4)
#define HRTIM_TIMCCR2_DCDR_B_0X0        (0x0u<<2)
#define HRTIM_TIMCCR2_DCDR_B_0X1        (0x1u<<2)
#define HRTIM_TIMCCR2_DCDS_B_0X0        (0x0u<<1)
#define HRTIM_TIMCCR2_DCDS_B_0X1        (0x1u<<1)
#define HRTIM_TIMCCR2_DCDE_B_0X0        (0x0u<<0)
#define HRTIM_TIMCCR2_DCDE_B_0X1        (0x1u<<0)

// TIMCEEFR3 Configuration

#define HRTIM_TIMCEEFR3_EEVACNT         (0x3Fu<<8)
#define HRTIM_TIMCEEFR3_EEVACNT_0       (0x1u<<8)
#define HRTIM_TIMCEEFR3_EEVASEL         (0xFu<<4)
#define HRTIM_TIMCEEFR3_EEVASEL_0       (0x1u<<4)
#define HRTIM_TIMCEEFR3_EEVARSTM        (0x1u<<2)
#define HRTIM_TIMCEEFR3_EEVACRES        (0x1u<<1)
#define HRTIM_TIMCEEFR3_EEVACE          (0x1u<<0)

#define HRTIM_TIMCEEFR3_EEVASEL_B_0X0   (0x0u<<4)
#define HRTIM_TIMCEEFR3_EEVASEL_B_0X1   (0x1u<<4)
#define HRTIM_TIMCEEFR3_EEVARSTM_B_0X0  (0x0u<<2)
#define HRTIM_TIMCEEFR3_EEVARSTM_B_0X1  (0x1u<<2)
#define HRTIM_TIMCEEFR3_EEVACRES_B_0X0  (0x0u<<1)
#define HRTIM_TIMCEEFR3_EEVACRES_B_0X1  (0x1u<<1)
#define HRTIM_TIMCEEFR3_EEVACE_B_0X0    (0x0u<<0)
#define HRTIM_TIMCEEFR3_EEVACE_B_0X1    (0x1u<<0)

// TIMDCR Configuration

#define HRTIM_TIMDCR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMDCR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMDCR_PREEN              (0x1u<<27)
#define HRTIM_TIMDCR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMDCR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMDCR_MSTU               (0x1u<<24)
#define HRTIM_TIMDCR_TEU                (0x1u<<23)
#define HRTIM_TIMDCR_TDU                (0x1u<<22)
#define HRTIM_TIMDCR_TCU                (0x1u<<21)
#define HRTIM_TIMDCR_TBU                (0x1u<<20)
#define HRTIM_TIMDCR_TAU                (0x1u<<19)
#define HRTIM_TIMDCR_TDRSTU             (0x1u<<18)
#define HRTIM_TIMDCR_TDREPU             (0x1u<<17)
#define HRTIM_TIMDCR_TFU                (0x1u<<16)
#define HRTIM_TIMDCR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMDCR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMDCR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMDCR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMDCR_SYNCSTRTD          (0x1u<<11)
#define HRTIM_TIMDCR_SYNCRSTD           (0x1u<<10)
#define HRTIM_TIMDCR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMDCR_INTLVD             (0x3u<<7)
#define HRTIM_TIMDCR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMDCR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMDCR_HALF               (0x1u<<5)
#define HRTIM_TIMDCR_RETRIG             (0x1u<<4)
#define HRTIM_TIMDCR_CONT               (0x1u<<3)
#define HRTIM_TIMDCR_CKPSCD             (0x7u<<0)
#define HRTIM_TIMDCR_CKPSCD_0           (0x1u<<0)

#define HRTIM_TIMDCR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMDCR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMDCR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMDCR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMDCR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMDCR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMDCR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMDCR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMDCR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMDCR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMDCR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMDCR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMDCR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMDCR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMDCR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMDCR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMDCR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMDCR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMDCR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMDCR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMDCR_TDRSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMDCR_TDRSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMDCR_TDREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMDCR_TDREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMDCR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMDCR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMDCR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMDCR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMDCR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMDCR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMDCR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMDCR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMDCR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMDCR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMDCR_SYNCSTRTD_B_0X0    (0x0u<<11)
#define HRTIM_TIMDCR_SYNCSTRTD_B_0X1    (0x1u<<11)
#define HRTIM_TIMDCR_SYNCRSTD_B_0X0     (0x0u<<10)
#define HRTIM_TIMDCR_SYNCRSTD_B_0X1     (0x1u<<10)
#define HRTIM_TIMDCR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMDCR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMDCR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMDCR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMDCR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMDCR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMDCR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMDCR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMDCR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMDCR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMDCR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMDCR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMDCR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMDCR_CONT_B_0X1         (0x1u<<3)

// TIMDISR Configuration

