Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_TIMDISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMDISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMDISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMDISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMDISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMDISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMDISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMDISR_RST               (0x1u<<13)
#define HRTIM_TIMDISR_RSTD2             (0x1u<<12)
#define HRTIM_TIMDISR_SETD2             (0x1u<<11)
#define HRTIM_TIMDISR_RSTD1             (0x1u<<10)
#define HRTIM_TIMDISR_SETD1             (0x1u<<9)
#define HRTIM_TIMDISR_CPT2              (0x1u<<8)
#define HRTIM_TIMDISR_CPT1              (0x1u<<7)
#define HRTIM_TIMDISR_UPD               (0x1u<<6)
#define HRTIM_TIMDISR_REP               (0x1u<<4)
#define HRTIM_TIMDISR_CMP4              (0x1u<<3)
#define HRTIM_TIMDISR_CMP3              (0x1u<<2)
#define HRTIM_TIMDISR_CMP2              (0x1u<<1)
#define HRTIM_TIMDISR_CMP1              (0x1u<<0)

#define HRTIM_TIMDISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMDISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMDISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMDISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMDISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMDISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMDISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMDISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMDISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMDISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMDISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMDISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMDISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMDISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMDISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMDISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMDISR_RSTD1_B_0X0       (0x0u<<10)
#define HRTIM_TIMDISR_RSTD1_B_0X1       (0x1u<<10)
#define HRTIM_TIMDISR_SETD1_B_0X0       (0x0u<<9)
#define HRTIM_TIMDISR_SETD1_B_0X1       (0x1u<<9)
#define HRTIM_TIMDISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMDISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMDISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMDISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMDISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMDISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMDISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMDISR_CMP1_B_0X1        (0x1u<<0)

// TIMDICR Configuration

#define HRTIM_TIMDICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMDICR_RSTC              (0x1u<<13)
#define HRTIM_TIMDICR_RSTD2C            (0x1u<<12)
#define HRTIM_TIMDICR_SETD2C            (0x1u<<11)
#define HRTIM_TIMDICR_RSTD1C            (0x1u<<10)
#define HRTIM_TIMDICR_SETD1C            (0x1u<<9)
#define HRTIM_TIMDICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMDICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMDICR_UPDC              (0x1u<<6)
#define HRTIM_TIMDICR_REPC              (0x1u<<4)
#define HRTIM_TIMDICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMDICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMDICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMDICR_CMP1C             (0x1u<<0)

// TIMDDIER Configuration

#define HRTIM_TIMDDIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMDDIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMDDIER_RSTD2DE          (0x1u<<28)
#define HRTIM_TIMDDIER_SETD2DE          (0x1u<<27)
#define HRTIM_TIMDDIER_RSTD1DE          (0x1u<<26)
#define HRTIM_TIMDDIER_SETD1DE          (0x1u<<25)
#define HRTIM_TIMDDIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMDDIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMDDIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMDDIER_REPDE            (0x1u<<20)
#define HRTIM_TIMDDIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMDDIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMDDIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMDDIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMDDIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMDDIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMDDIER_RSTD2IE          (0x1u<<12)
#define HRTIM_TIMDDIER_SETD2IE          (0x1u<<11)
#define HRTIM_TIMDDIER_RSTD1IE          (0x1u<<10)
#define HRTIM_TIMDDIER_SETD1IE          (0x1u<<9)
#define HRTIM_TIMDDIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMDDIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMDDIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMDDIER_REPIE            (0x1u<<4)
#define HRTIM_TIMDDIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMDDIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMDDIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMDDIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMDDIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMDDIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMDDIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMDDIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMDDIER_RSTD1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMDDIER_RSTD1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMDDIER_SETD1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMDDIER_SETD1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMDDIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMDDIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMDDIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMDDIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMDDIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMDDIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMDDIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMDDIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMDDIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMDDIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMDDIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMDDIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMDDIER_RSTD1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMDDIER_RSTD1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMDDIER_SETD1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMDDIER_SETD1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMDDIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMDDIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMDDIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMDDIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMDDIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMDDIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMDDIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMDDIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTDR Configuration

#define HRTIM_CNTDR_CNTD                (0xFFFFu<<0)
#define HRTIM_CNTDR_CNTD_0              (0x1u<<0)

// PERDR Configuration

#define HRTIM_PERDR_PERD                (0xFFFFu<<0)
#define HRTIM_PERDR_PERD_0              (0x1u<<0)

// REPDR Configuration

#define HRTIM_REPDR_REPD                (0xFFu<<0)
#define HRTIM_REPDR_REPD_0              (0x1u<<0)

// CMP1DR Configuration

