Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_CMP1DR_CMP1D              (0xFFFFu<<0)
#define HRTIM_CMP1DR_CMP1D_0            (0x1u<<0)

// CMP1CDR Configuration

#define HRTIM_CMP1CDR_REPD              (0xFFu<<16)
#define HRTIM_CMP1CDR_REPD_0            (0x1u<<16)
#define HRTIM_CMP1CDR_CMP1D             (0xFFFFu<<0)
#define HRTIM_CMP1CDR_CMP1D_0           (0x1u<<0)

// CMP2DR Configuration

#define HRTIM_CMP2DR_CMP2D              (0xFFFFu<<0)
#define HRTIM_CMP2DR_CMP2D_0            (0x1u<<0)

// CMP3DR Configuration

#define HRTIM_CMP3DR_CMP3D              (0xFFFFu<<0)
#define HRTIM_CMP3DR_CMP3D_0            (0x1u<<0)

// CMP4DR Configuration

#define HRTIM_CMP4DR_CMP4D              (0xFFFFu<<0)
#define HRTIM_CMP4DR_CMP4D_0            (0x1u<<0)

// CPT1DR Configuration

#define HRTIM_CPT1DR_DIR                (0x1u<<16)
#define HRTIM_CPT1DR_CPT1D              (0xFFFFu<<0)
#define HRTIM_CPT1DR_CPT1D_0            (0x1u<<0)

#define HRTIM_CPT1DR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1DR_DIR_B_0X1          (0x1u<<16)

// CPT2DR Configuration

#define HRTIM_CPT2DR_DIR                (0x1u<<16)
#define HRTIM_CPT2DR_CPT2D              (0xFFFFu<<0)
#define HRTIM_CPT2DR_CPT2D_0            (0x1u<<0)

#define HRTIM_CPT2DR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2DR_DIR_B_0X1          (0x1u<<16)

// DTDR Configuration

#define HRTIM_DTDR_DTFLKD               (0x1u<<31)
#define HRTIM_DTDR_DTFSLKD              (0x1u<<30)
#define HRTIM_DTDR_SDTFD                (0x1u<<25)
#define HRTIM_DTDR_DTFD                 (0x1FFu<<16)
#define HRTIM_DTDR_DTFD_0               (0x1u<<16)
#define HRTIM_DTDR_DTRLKD               (0x1u<<15)
#define HRTIM_DTDR_DTRSLKD              (0x1u<<14)
#define HRTIM_DTDR_DTPRSC               (0x7u<<10)
#define HRTIM_DTDR_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTDR_SDTRD                (0x1u<<9)
#define HRTIM_DTDR_DTRD                 (0x1FFu<<0)
#define HRTIM_DTDR_DTRD_0               (0x1u<<0)

#define HRTIM_DTDR_DTFLKD_B_0X0         (0x0u<<31)
#define HRTIM_DTDR_DTFLKD_B_0X1         (0x1u<<31)
#define HRTIM_DTDR_DTFSLKD_B_0X0        (0x0u<<30)
#define HRTIM_DTDR_DTFSLKD_B_0X1        (0x1u<<30)
#define HRTIM_DTDR_SDTFD_B_0X0          (0x0u<<25)
#define HRTIM_DTDR_SDTFD_B_0X1          (0x1u<<25)
#define HRTIM_DTDR_DTRLKD_B_0X0         (0x0u<<15)
#define HRTIM_DTDR_DTRLKD_B_0X1         (0x1u<<15)
#define HRTIM_DTDR_DTRSLKD_B_0X0        (0x0u<<14)
#define HRTIM_DTDR_DTRSLKD_B_0X1        (0x1u<<14)
#define HRTIM_DTDR_SDTRD_B_0X0          (0x0u<<9)
#define HRTIM_DTDR_SDTRD_B_0X1          (0x1u<<9)

// SETD1R Configuration

#define HRTIM_SETD1R_UPDATE             (0x1u<<31)
#define HRTIM_SETD1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETD1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETD1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETD1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETD1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETD1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETD1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETD1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETD1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETD1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETD1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETD1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETD1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETD1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETD1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETD1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETD1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETD1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETD1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETD1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETD1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETD1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETD1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETD1R_MSTPER             (0x1u<<7)
#define HRTIM_SETD1R_CMP4               (0x1u<<6)
#define HRTIM_SETD1R_CMP3               (0x1u<<5)
#define HRTIM_SETD1R_CMP2               (0x1u<<4)
#define HRTIM_SETD1R_CMP1               (0x1u<<3)
#define HRTIM_SETD1R_PER                (0x1u<<2)
#define HRTIM_SETD1R_RESYNC             (0x1u<<1)
#define HRTIM_SETD1R_SST                (0x1u<<0)

// RSTD1R Configuration

#define HRTIM_RSTD1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTD1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTD1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTD1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTD1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTD1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTD1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTD1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTD1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTD1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTD1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTD1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTD1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTD1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTD1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTD1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTD1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTD1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTD1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTD1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTD1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTD1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTD1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTD1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTD1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTD1R_CMP4               (0x1u<<6)
#define HRTIM_RSTD1R_CMP3               (0x1u<<5)
#define HRTIM_RSTD1R_CMP2               (0x1u<<4)
#define HRTIM_RSTD1R_CMP1               (0x1u<<3)
#define HRTIM_RSTD1R_PER                (0x1u<<2)
#define HRTIM_RSTD1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTD1R_SST                (0x1u<<0)

// SETD2R Configuration

#define HRTIM_SETD2R_UPDATE             (0x1u<<31)
#define HRTIM_SETD2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETD2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETD2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETD2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETD2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETD2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETD2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETD2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETD2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETD2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETD2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETD2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETD2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETD2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETD2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETD2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETD2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETD2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETD2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETD2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETD2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETD2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETD2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETD2R_MSTPER             (0x1u<<7)
#define HRTIM_SETD2R_CMP4               (0x1u<<6)
#define HRTIM_SETD2R_CMP3               (0x1u<<5)
#define HRTIM_SETD2R_CMP2               (0x1u<<4)
#define HRTIM_SETD2R_CMP1               (0x1u<<3)
#define HRTIM_SETD2R_PER                (0x1u<<2)
#define HRTIM_SETD2R_RESYNC             (0x1u<<1)
#define HRTIM_SETD2R_SST                (0x1u<<0)

// RSTD2R Configuration

