Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_RSTD2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTD2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTD2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTD2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTD2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTD2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTD2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTD2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTD2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTD2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTD2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTD2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTD2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTD2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTD2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTD2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTD2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTD2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTD2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTD2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTD2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTD2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTD2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTD2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTD2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTD2R_CMP4               (0x1u<<6)
#define HRTIM_RSTD2R_CMP3               (0x1u<<5)
#define HRTIM_RSTD2R_CMP2               (0x1u<<4)
#define HRTIM_RSTD2R_CMP1               (0x1u<<3)
#define HRTIM_RSTD2R_PER                (0x1u<<2)
#define HRTIM_RSTD2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTD2R_SST                (0x1u<<0)

// EEFDR1 Configuration

#define HRTIM_EEFDR1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFDR1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFDR1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFDR1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFDR1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFDR1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFDR1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFDR1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFDR1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFDR1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFDR1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFDR1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFDR1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFDR1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFDR1_EE1LTCH            (0x1u<<0)

#define HRTIM_EEFDR1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFDR1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFDR1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFDR1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFDR2 Configuration

#define HRTIM_EEFDR2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFDR2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFDR2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFDR2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFDR2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFDR2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFDR2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFDR2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFDR2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFDR2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFDR2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFDR2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFDR2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFDR2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFDR2_EE6LTCH            (0x1u<<0)

// RSTDR Configuration

#define HRTIM_RSTDR_TIMFCMP2            (0x1u<<31)
#define HRTIM_RSTDR_TIMECMP4            (0x1u<<30)
#define HRTIM_RSTDR_TIMECMP2            (0x1u<<29)
#define HRTIM_RSTDR_TIMECMP1            (0x1u<<28)
#define HRTIM_RSTDR_TIMCCMP4            (0x1u<<27)
#define HRTIM_RSTDR_TIMCCMP2            (0x1u<<26)
#define HRTIM_RSTDR_TIMCCMP1            (0x1u<<25)
#define HRTIM_RSTDR_TIMBCMP4            (0x1u<<24)
#define HRTIM_RSTDR_TIMBCMP2            (0x1u<<23)
#define HRTIM_RSTDR_TIMBCMP1            (0x1u<<22)
#define HRTIM_RSTDR_TIMACMP4            (0x1u<<21)
#define HRTIM_RSTDR_TIMACMP2            (0x1u<<20)
#define HRTIM_RSTDR_TIMACMP1            (0x1u<<19)
#define HRTIM_RSTDR_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTDR_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTDR_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTDR_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTDR_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTDR_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTDR_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTDR_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTDR_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTDR_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTDR_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTDR_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTDR_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTDR_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTDR_MSTPER              (0x1u<<4)
#define HRTIM_RSTDR_CMP4                (0x1u<<3)
#define HRTIM_RSTDR_CMP2                (0x1u<<2)
#define HRTIM_RSTDR_UPDT                (0x1u<<1)
#define HRTIM_RSTDR_TIMFCMP1            (0x1u<<0)

// CHPDR Configuration

#define HRTIM_CHPDR_STRTPW              (0xFu<<7)
#define HRTIM_CHPDR_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPDR_CARDTY              (0x7u<<4)
#define HRTIM_CHPDR_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPDR_CARFRQ              (0xFu<<0)
#define HRTIM_CHPDR_CARFRQ_0            (0x1u<<0)

