Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_CHPDR_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPDR_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPDR_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPDR_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPDR_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPDR_CARFRQ_B_0XF        (0xFu<<0)

// CPT1DCR Configuration

#define HRTIM_CPT1DCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT1DCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT1DCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT1DCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT1DCR_TFCMP2            (0x1u<<27)
#define HRTIM_CPT1DCR_TFCMP1            (0x1u<<26)
#define HRTIM_CPT1DCR_TF1RST            (0x1u<<25)
#define HRTIM_CPT1DCR_TF1SET            (0x1u<<24)
#define HRTIM_CPT1DCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT1DCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT1DCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT1DCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT1DCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT1DCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT1DCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT1DCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT1DCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT1DCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT1DCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT1DCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT1DCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1DCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1DCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1DCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1DCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1DCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1DCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1DCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1DCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1DCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1DCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1DCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1DCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT1DCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT1DCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT1DCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT1DCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT1DCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT1DCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT1DCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT1DCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1DCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1DCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1DCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1DCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1DCR_SWCPT_B_0X1       (0x1u<<0)

// CPT2DCR Configuration

#define HRTIM_CPT2DCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT2DCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT2DCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT2DCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT2DCR_TFCMP2            (0x1u<<27)
#define HRTIM_CPT2DCR_TFCMP1            (0x1u<<26)
#define HRTIM_CPT2DCR_TF1RST            (0x1u<<25)
#define HRTIM_CPT2DCR_TF1SET            (0x1u<<24)
#define HRTIM_CPT2DCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT2DCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT2DCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT2DCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT2DCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT2DCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT2DCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT2DCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT2DCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT2DCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT2DCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT2DCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT2DCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2DCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2DCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2DCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2DCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2DCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2DCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2DCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2DCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2DCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2DCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2DCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2DCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT2DCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT2DCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT2DCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT2DCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT2DCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT2DCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT2DCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT2DCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2DCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2DCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2DCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2DCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2DCR_SWCPT_B_0X1       (0x1u<<0)

// OUTDR Configuration

#define HRTIM_OUTDR_DIDL2               (0x1u<<23)
#define HRTIM_OUTDR_CHP2                (0x1u<<22)
#define HRTIM_OUTDR_FAULT2              (0x3u<<20)
#define HRTIM_OUTDR_FAULT2_0            (0x1u<<20)
#define HRTIM_OUTDR_IDLES2              (0x1u<<19)
#define HRTIM_OUTDR_IDLEM2              (0x1u<<18)
#define HRTIM_OUTDR_POL2                (0x1u<<17)
#define HRTIM_OUTDR_BIAR                (0x1u<<14)
#define HRTIM_OUTDR_DLYPRT              (0x7u<<10)
#define HRTIM_OUTDR_DLYPRT_0            (0x1u<<10)
#define HRTIM_OUTDR_DLYPRTEN            (0x1u<<9)
#define HRTIM_OUTDR_DTEN                (0x1u<<8)
#define HRTIM_OUTDR_DIDL1               (0x1u<<7)
#define HRTIM_OUTDR_CHP1                (0x1u<<6)
#define HRTIM_OUTDR_FAULT1              (0x3u<<4)
#define HRTIM_OUTDR_FAULT1_0            (0x1u<<4)
#define HRTIM_OUTDR_IDLES1              (0x1u<<3)
#define HRTIM_OUTDR_IDLEM1              (0x1u<<2)
#define HRTIM_OUTDR_POL1                (0x1u<<1)

