Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_OUTDR_DIDL2_B_0X0         (0x0u<<23)
#define HRTIM_OUTDR_DIDL2_B_0X1         (0x1u<<23)
#define HRTIM_OUTDR_CHP2_B_0X0          (0x0u<<22)
#define HRTIM_OUTDR_CHP2_B_0X1          (0x1u<<22)
#define HRTIM_OUTDR_FAULT2_B_0X0        (0x0u<<20)
#define HRTIM_OUTDR_FAULT2_B_0X1        (0x1u<<20)
#define HRTIM_OUTDR_FAULT2_B_0X2        (0x2u<<20)
#define HRTIM_OUTDR_FAULT2_B_0X3        (0x3u<<20)
#define HRTIM_OUTDR_IDLES2_B_0X0        (0x0u<<19)
#define HRTIM_OUTDR_IDLES2_B_0X1        (0x1u<<19)
#define HRTIM_OUTDR_IDLEM2_B_0X0        (0x0u<<18)
#define HRTIM_OUTDR_IDLEM2_B_0X1        (0x1u<<18)
#define HRTIM_OUTDR_POL2_B_0X0          (0x0u<<17)
#define HRTIM_OUTDR_POL2_B_0X1          (0x1u<<17)
#define HRTIM_OUTDR_BIAR_B_0X0          (0x0u<<14)
#define HRTIM_OUTDR_BIAR_B_0X1          (0x1u<<14)
#define HRTIM_OUTDR_DLYPRT_B_0X0        (0x0u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X1        (0x1u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X2        (0x2u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X3        (0x3u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X4        (0x4u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X5        (0x5u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X6        (0x6u<<10)
#define HRTIM_OUTDR_DLYPRT_B_0X7        (0x7u<<10)
#define HRTIM_OUTDR_DLYPRTEN_B_0X0      (0x0u<<9)
#define HRTIM_OUTDR_DLYPRTEN_B_0X1      (0x1u<<9)
#define HRTIM_OUTDR_DTEN_B_0X0          (0x0u<<8)
#define HRTIM_OUTDR_DTEN_B_0X1          (0x1u<<8)
#define HRTIM_OUTDR_DIDL1_B_0X0         (0x0u<<7)
#define HRTIM_OUTDR_DIDL1_B_0X1         (0x1u<<7)
#define HRTIM_OUTDR_CHP1_B_0X0          (0x0u<<6)
#define HRTIM_OUTDR_CHP1_B_0X1          (0x1u<<6)
#define HRTIM_OUTDR_FAULT1_B_0X0        (0x0u<<4)
#define HRTIM_OUTDR_FAULT1_B_0X1        (0x1u<<4)
#define HRTIM_OUTDR_FAULT1_B_0X2        (0x2u<<4)
#define HRTIM_OUTDR_FAULT1_B_0X3        (0x3u<<4)
#define HRTIM_OUTDR_IDLES1_B_0X0        (0x0u<<3)
#define HRTIM_OUTDR_IDLES1_B_0X1        (0x1u<<3)
#define HRTIM_OUTDR_IDLEM1_B_0X0        (0x0u<<2)
#define HRTIM_OUTDR_IDLEM1_B_0X1        (0x1u<<2)
#define HRTIM_OUTDR_POL1_B_0X0          (0x0u<<1)
#define HRTIM_OUTDR_POL1_B_0X1          (0x1u<<1)

// FLTDR Configuration

#define HRTIM_FLTDR_FLTLCK              (0x1u<<31)
#define HRTIM_FLTDR_FLT6EN              (0x1u<<5)
#define HRTIM_FLTDR_FLT5EN              (0x1u<<4)
#define HRTIM_FLTDR_FLT4EN              (0x1u<<3)
#define HRTIM_FLTDR_FLT3EN              (0x1u<<2)
#define HRTIM_FLTDR_FLT2EN              (0x1u<<1)
#define HRTIM_FLTDR_FLT1EN              (0x1u<<0)

#define HRTIM_FLTDR_FLTLCK_B_0X0        (0x0u<<31)
#define HRTIM_FLTDR_FLTLCK_B_0X1        (0x1u<<31)
#define HRTIM_FLTDR_FLT6EN_B_0X0        (0x0u<<5)
#define HRTIM_FLTDR_FLT6EN_B_0X1        (0x1u<<5)
#define HRTIM_FLTDR_FLT5EN_B_0X0        (0x0u<<4)
#define HRTIM_FLTDR_FLT5EN_B_0X1        (0x1u<<4)
#define HRTIM_FLTDR_FLT4EN_B_0X0        (0x0u<<3)
#define HRTIM_FLTDR_FLT4EN_B_0X1        (0x1u<<3)
#define HRTIM_FLTDR_FLT3EN_B_0X0        (0x0u<<2)
#define HRTIM_FLTDR_FLT3EN_B_0X1        (0x1u<<2)
#define HRTIM_FLTDR_FLT2EN_B_0X0        (0x0u<<1)
#define HRTIM_FLTDR_FLT2EN_B_0X1        (0x1u<<1)
#define HRTIM_FLTDR_FLT1EN_B_0X0        (0x0u<<0)
#define HRTIM_FLTDR_FLT1EN_B_0X1        (0x1u<<0)

// TIMDCR2 Configuration

#define HRTIM_TIMDCR2_TRGHLF            (0x1u<<20)
#define HRTIM_TIMDCR2_GTCMP3            (0x1u<<17)
#define HRTIM_TIMDCR2_GTCMP1            (0x1u<<16)
#define HRTIM_TIMDCR2_FEROM             (0x3u<<14)
#define HRTIM_TIMDCR2_FEROM_0           (0x1u<<14)
#define HRTIM_TIMDCR2_BMROM             (0x3u<<12)
#define HRTIM_TIMDCR2_BMROM_0           (0x1u<<12)
#define HRTIM_TIMDCR2_ADROM             (0x3u<<10)
#define HRTIM_TIMDCR2_ADROM_0           (0x1u<<10)
#define HRTIM_TIMDCR2_OUTROM            (0x3u<<8)
#define HRTIM_TIMDCR2_OUTROM_0          (0x1u<<8)
#define HRTIM_TIMDCR2_ROM               (0x3u<<6)
#define HRTIM_TIMDCR2_ROM_0             (0x1u<<6)
#define HRTIM_TIMDCR2_UDM               (0x1u<<4)
#define HRTIM_TIMDCR2_DCDR              (0x1u<<2)
#define HRTIM_TIMDCR2_DCDS              (0x1u<<1)
#define HRTIM_TIMDCR2_DCDE              (0x1u<<0)

#define HRTIM_TIMDCR2_TRGHLF_B_0X0      (0x0u<<20)
#define HRTIM_TIMDCR2_TRGHLF_B_0X1      (0x1u<<20)
#define HRTIM_TIMDCR2_GTCMP3_B_0X0      (0x0u<<17)
#define HRTIM_TIMDCR2_GTCMP3_B_0X1      (0x1u<<17)
#define HRTIM_TIMDCR2_GTCMP1_B_0X0      (0x0u<<16)
#define HRTIM_TIMDCR2_GTCMP1_B_0X1      (0x1u<<16)
#define HRTIM_TIMDCR2_FEROM_B_0X0       (0x0u<<14)
#define HRTIM_TIMDCR2_FEROM_B_0X1       (0x1u<<14)
#define HRTIM_TIMDCR2_FEROM_B_0X2       (0x2u<<14)
#define HRTIM_TIMDCR2_BMROM_B_0X0       (0x0u<<12)
#define HRTIM_TIMDCR2_BMROM_B_0X1       (0x1u<<12)
#define HRTIM_TIMDCR2_BMROM_B_0X2       (0x2u<<12)
#define HRTIM_TIMDCR2_ADROM_B_0X0       (0x0u<<10)
#define HRTIM_TIMDCR2_ADROM_B_0X1       (0x1u<<10)
#define HRTIM_TIMDCR2_ADROM_B_0X2       (0x2u<<10)
#define HRTIM_TIMDCR2_OUTROM_B_0X0      (0x0u<<8)
#define HRTIM_TIMDCR2_OUTROM_B_0X1      (0x1u<<8)
#define HRTIM_TIMDCR2_OUTROM_B_0X2      (0x2u<<8)
#define HRTIM_TIMDCR2_ROM_B_0X0         (0x0u<<6)
#define HRTIM_TIMDCR2_ROM_B_0X1         (0x1u<<6)
#define HRTIM_TIMDCR2_ROM_B_0X2         (0x2u<<6)
#define HRTIM_TIMDCR2_UDM_B_0X0         (0x0u<<4)
#define HRTIM_TIMDCR2_UDM_B_0X1         (0x1u<<4)
#define HRTIM_TIMDCR2_DCDR_B_0X0        (0x0u<<2)
#define HRTIM_TIMDCR2_DCDR_B_0X1        (0x1u<<2)
#define HRTIM_TIMDCR2_DCDS_B_0X0        (0x0u<<1)
#define HRTIM_TIMDCR2_DCDS_B_0X1        (0x1u<<1)
#define HRTIM_TIMDCR2_DCDE_B_0X0        (0x0u<<0)
#define HRTIM_TIMDCR2_DCDE_B_0X1        (0x1u<<0)

// TIMDEEFR3 Configuration

#define HRTIM_TIMDEEFR3_EEVACNT         (0x3Fu<<8)
#define HRTIM_TIMDEEFR3_EEVACNT_0       (0x1u<<8)
#define HRTIM_TIMDEEFR3_EEVASEL         (0xFu<<4)
#define HRTIM_TIMDEEFR3_EEVASEL_0       (0x1u<<4)
#define HRTIM_TIMDEEFR3_EEVARSTM        (0x1u<<2)
#define HRTIM_TIMDEEFR3_EEVACRES        (0x1u<<1)
#define HRTIM_TIMDEEFR3_EEVACE          (0x1u<<0)

#define HRTIM_TIMDEEFR3_EEVASEL_B_0X0   (0x0u<<4)
#define HRTIM_TIMDEEFR3_EEVASEL_B_0X1   (0x1u<<4)
#define HRTIM_TIMDEEFR3_EEVARSTM_B_0X0  (0x0u<<2)
#define HRTIM_TIMDEEFR3_EEVARSTM_B_0X1  (0x1u<<2)
#define HRTIM_TIMDEEFR3_EEVACRES_B_0X0  (0x0u<<1)
#define HRTIM_TIMDEEFR3_EEVACRES_B_0X1  (0x1u<<1)
#define HRTIM_TIMDEEFR3_EEVACE_B_0X0    (0x0u<<0)
#define HRTIM_TIMDEEFR3_EEVACE_B_0X1    (0x1u<<0)

