Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// TIMECR Configuration

#define HRTIM_TIMECR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMECR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMECR_PREEN              (0x1u<<27)
#define HRTIM_TIMECR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMECR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMECR_MSTU               (0x1u<<24)
#define HRTIM_TIMECR_TEU                (0x1u<<23)
#define HRTIM_TIMECR_TDU                (0x1u<<22)
#define HRTIM_TIMECR_TCU                (0x1u<<21)
#define HRTIM_TIMECR_TBU                (0x1u<<20)
#define HRTIM_TIMECR_TAU                (0x1u<<19)
#define HRTIM_TIMECR_TERSTU             (0x1u<<18)
#define HRTIM_TIMECR_TEREPU             (0x1u<<17)
#define HRTIM_TIMECR_TFU                (0x1u<<16)
#define HRTIM_TIMECR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMECR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMECR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMECR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMECR_SYNCSTRTE          (0x1u<<11)
#define HRTIM_TIMECR_SYNCRSTE           (0x1u<<10)
#define HRTIM_TIMECR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMECR_INTLVD             (0x3u<<7)
#define HRTIM_TIMECR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMECR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMECR_HALF               (0x1u<<5)
#define HRTIM_TIMECR_RETRIG             (0x1u<<4)
#define HRTIM_TIMECR_CONT               (0x1u<<3)
#define HRTIM_TIMECR_CKPSCE             (0x7u<<0)
#define HRTIM_TIMECR_CKPSCE_0           (0x1u<<0)

#define HRTIM_TIMECR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMECR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMECR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMECR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMECR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMECR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMECR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMECR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMECR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMECR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMECR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMECR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMECR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMECR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMECR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMECR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMECR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMECR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMECR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMECR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMECR_TERSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMECR_TERSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMECR_TEREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMECR_TEREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMECR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMECR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMECR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMECR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMECR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMECR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMECR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMECR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMECR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMECR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMECR_SYNCSTRTE_B_0X0    (0x0u<<11)
#define HRTIM_TIMECR_SYNCSTRTE_B_0X1    (0x1u<<11)
#define HRTIM_TIMECR_SYNCRSTE_B_0X0     (0x0u<<10)
#define HRTIM_TIMECR_SYNCRSTE_B_0X1     (0x1u<<10)
#define HRTIM_TIMECR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMECR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMECR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMECR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMECR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMECR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMECR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMECR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMECR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMECR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMECR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMECR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMECR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMECR_CONT_B_0X1         (0x1u<<3)

// TIMEISR Configuration

#define HRTIM_TIMEISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMEISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMEISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMEISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMEISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMEISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMEISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMEISR_RST               (0x1u<<13)
#define HRTIM_TIMEISR_RSTE2             (0x1u<<12)
#define HRTIM_TIMEISR_SETE2             (0x1u<<11)
#define HRTIM_TIMEISR_RSTE1             (0x1u<<10)
#define HRTIM_TIMEISR_SETE1             (0x1u<<9)
#define HRTIM_TIMEISR_CPT2              (0x1u<<8)
#define HRTIM_TIMEISR_CPT1              (0x1u<<7)
#define HRTIM_TIMEISR_UPD               (0x1u<<6)
#define HRTIM_TIMEISR_REP               (0x1u<<4)
#define HRTIM_TIMEISR_CMP4              (0x1u<<3)
#define HRTIM_TIMEISR_CMP3              (0x1u<<2)
#define HRTIM_TIMEISR_CMP2              (0x1u<<1)
#define HRTIM_TIMEISR_CMP1              (0x1u<<0)

#define HRTIM_TIMEISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMEISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMEISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMEISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMEISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMEISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMEISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMEISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMEISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMEISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMEISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMEISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMEISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMEISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMEISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMEISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMEISR_RSTE1_B_0X0       (0x0u<<10)
#define HRTIM_TIMEISR_RSTE1_B_0X1       (0x1u<<10)
#define HRTIM_TIMEISR_SETE1_B_0X0       (0x0u<<9)
#define HRTIM_TIMEISR_SETE1_B_0X1       (0x1u<<9)
#define HRTIM_TIMEISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMEISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMEISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMEISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMEISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMEISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMEISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMEISR_CMP1_B_0X1        (0x1u<<0)

// TIMEICR Configuration

#define HRTIM_TIMEICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMEICR_RSTC              (0x1u<<13)
#define HRTIM_TIMEICR_RSTE2C            (0x1u<<12)
#define HRTIM_TIMEICR_SETE2C            (0x1u<<11)
#define HRTIM_TIMEICR_RSTE1C            (0x1u<<10)
#define HRTIM_TIMEICR_SETE1C            (0x1u<<9)
#define HRTIM_TIMEICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMEICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMEICR_UPDC              (0x1u<<6)
#define HRTIM_TIMEICR_REPC              (0x1u<<4)
#define HRTIM_TIMEICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMEICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMEICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMEICR_CMP1C             (0x1u<<0)

// TIMEDIER Configuration

#define HRTIM_TIMEDIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMEDIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMEDIER_RSTE2DE          (0x1u<<28)
#define HRTIM_TIMEDIER_SETE2DE          (0x1u<<27)
#define HRTIM_TIMEDIER_RSTE1DE          (0x1u<<26)
#define HRTIM_TIMEDIER_SETE1DE          (0x1u<<25)
#define HRTIM_TIMEDIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMEDIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMEDIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMEDIER_REPDE            (0x1u<<20)
#define HRTIM_TIMEDIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMEDIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMEDIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMEDIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMEDIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMEDIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMEDIER_RSTE2IE          (0x1u<<12)
#define HRTIM_TIMEDIER_SETE2IE          (0x1u<<11)
#define HRTIM_TIMEDIER_RSTE1IE          (0x1u<<10)
#define HRTIM_TIMEDIER_SETE1IE          (0x1u<<9)
#define HRTIM_TIMEDIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMEDIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMEDIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMEDIER_REPIE            (0x1u<<4)
#define HRTIM_TIMEDIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMEDIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMEDIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMEDIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMEDIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMEDIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMEDIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMEDIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMEDIER_RSTE1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMEDIER_RSTE1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMEDIER_SETE1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMEDIER_SETE1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMEDIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMEDIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMEDIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMEDIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMEDIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMEDIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMEDIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMEDIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMEDIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMEDIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMEDIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMEDIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMEDIER_RSTE1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMEDIER_RSTE1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMEDIER_SETE1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMEDIER_SETE1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMEDIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMEDIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMEDIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMEDIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMEDIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMEDIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMEDIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMEDIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTER Configuration

#define HRTIM_CNTER_CNTE                (0xFFFFu<<0)
#define HRTIM_CNTER_CNTE_0              (0x1u<<0)

// PERER Configuration

#define HRTIM_PERER_PERE                (0xFFFFu<<0)
#define HRTIM_PERER_PERE_0              (0x1u<<0)

