Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// REPER Configuration

#define HRTIM_REPER_REPE                (0xFFu<<0)
#define HRTIM_REPER_REPE_0              (0x1u<<0)

// CMP1ER Configuration

#define HRTIM_CMP1ER_CMP1E              (0xFFFFu<<0)
#define HRTIM_CMP1ER_CMP1E_0            (0x1u<<0)

// CMP1CER Configuration

#define HRTIM_CMP1CER_REPE              (0xFFu<<16)
#define HRTIM_CMP1CER_REPE_0            (0x1u<<16)
#define HRTIM_CMP1CER_CMP1E             (0xFFFFu<<0)
#define HRTIM_CMP1CER_CMP1E_0           (0x1u<<0)

// CMP2ER Configuration

#define HRTIM_CMP2ER_CMP2E              (0xFFFFu<<0)
#define HRTIM_CMP2ER_CMP2E_0            (0x1u<<0)

// CMP3ER Configuration

#define HRTIM_CMP3ER_CMP3E              (0xFFFFu<<0)
#define HRTIM_CMP3ER_CMP3E_0            (0x1u<<0)

// CMP4ER Configuration

#define HRTIM_CMP4ER_CMP4E              (0xFFFFu<<0)
#define HRTIM_CMP4ER_CMP4E_0            (0x1u<<0)

// CPT1ER Configuration

#define HRTIM_CPT1ER_DIR                (0x1u<<16)
#define HRTIM_CPT1ER_CPT1E              (0xFFFFu<<0)
#define HRTIM_CPT1ER_CPT1E_0            (0x1u<<0)

#define HRTIM_CPT1ER_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1ER_DIR_B_0X1          (0x1u<<16)

// CPT2ER Configuration

#define HRTIM_CPT2ER_DIR                (0x1u<<16)
#define HRTIM_CPT2ER_CPT2E              (0xFFFFu<<0)
#define HRTIM_CPT2ER_CPT2E_0            (0x1u<<0)

#define HRTIM_CPT2ER_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2ER_DIR_B_0X1          (0x1u<<16)

// DTER Configuration

#define HRTIM_DTER_DTFLKE               (0x1u<<31)
#define HRTIM_DTER_DTFSLKE              (0x1u<<30)
#define HRTIM_DTER_SDTFE                (0x1u<<25)
#define HRTIM_DTER_DTFE                 (0x1FFu<<16)
#define HRTIM_DTER_DTFE_0               (0x1u<<16)
#define HRTIM_DTER_DTRLKE               (0x1u<<15)
#define HRTIM_DTER_DTRSLKE              (0x1u<<14)
#define HRTIM_DTER_DTPRSC               (0x7u<<10)
#define HRTIM_DTER_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTER_SDTRE                (0x1u<<9)
#define HRTIM_DTER_DTRE                 (0x1FFu<<0)
#define HRTIM_DTER_DTRE_0               (0x1u<<0)

#define HRTIM_DTER_DTFLKE_B_0X0         (0x0u<<31)
#define HRTIM_DTER_DTFLKE_B_0X1         (0x1u<<31)
#define HRTIM_DTER_DTFSLKE_B_0X0        (0x0u<<30)
#define HRTIM_DTER_DTFSLKE_B_0X1        (0x1u<<30)
#define HRTIM_DTER_SDTFE_B_0X0          (0x0u<<25)
#define HRTIM_DTER_SDTFE_B_0X1          (0x1u<<25)
#define HRTIM_DTER_DTRLKE_B_0X0         (0x0u<<15)
#define HRTIM_DTER_DTRLKE_B_0X1         (0x1u<<15)
#define HRTIM_DTER_DTRSLKE_B_0X0        (0x0u<<14)
#define HRTIM_DTER_DTRSLKE_B_0X1        (0x1u<<14)
#define HRTIM_DTER_SDTRE_B_0X0          (0x0u<<9)
#define HRTIM_DTER_SDTRE_B_0X1          (0x1u<<9)

// SETE1R Configuration

#define HRTIM_SETE1R_UPDATE             (0x1u<<31)
#define HRTIM_SETE1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETE1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETE1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETE1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETE1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETE1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETE1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETE1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETE1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETE1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETE1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETE1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETE1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETE1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETE1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETE1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETE1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETE1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETE1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETE1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETE1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETE1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETE1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETE1R_MSTPER             (0x1u<<7)
#define HRTIM_SETE1R_CMP4               (0x1u<<6)
#define HRTIM_SETE1R_CMP3               (0x1u<<5)
#define HRTIM_SETE1R_CMP2               (0x1u<<4)
#define HRTIM_SETE1R_CMP1               (0x1u<<3)
#define HRTIM_SETE1R_PER                (0x1u<<2)
#define HRTIM_SETE1R_RESYNC             (0x1u<<1)
#define HRTIM_SETE1R_SST                (0x1u<<0)

// RSTE1R Configuration

#define HRTIM_RSTE1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTE1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTE1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTE1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTE1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTE1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTE1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTE1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTE1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTE1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTE1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTE1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTE1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTE1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTE1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTE1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTE1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTE1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTE1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTE1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTE1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTE1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTE1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTE1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTE1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTE1R_CMP4               (0x1u<<6)
#define HRTIM_RSTE1R_CMP3               (0x1u<<5)
#define HRTIM_RSTE1R_CMP2               (0x1u<<4)
#define HRTIM_RSTE1R_CMP1               (0x1u<<3)
#define HRTIM_RSTE1R_PER                (0x1u<<2)
#define HRTIM_RSTE1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTE1R_SST                (0x1u<<0)

// SETE2R Configuration

#define HRTIM_SETE2R_UPDATE             (0x1u<<31)
#define HRTIM_SETE2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETE2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETE2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETE2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETE2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETE2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETE2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETE2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETE2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETE2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETE2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETE2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETE2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETE2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETE2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETE2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETE2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETE2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETE2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETE2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETE2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETE2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETE2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETE2R_MSTPER             (0x1u<<7)
#define HRTIM_SETE2R_CMP4               (0x1u<<6)
#define HRTIM_SETE2R_CMP3               (0x1u<<5)
#define HRTIM_SETE2R_CMP2               (0x1u<<4)
#define HRTIM_SETE2R_CMP1               (0x1u<<3)
#define HRTIM_SETE2R_PER                (0x1u<<2)
#define HRTIM_SETE2R_RESYNC             (0x1u<<1)
#define HRTIM_SETE2R_SST                (0x1u<<0)

// RSTE2R Configuration

#define HRTIM_RSTE2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTE2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTE2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTE2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTE2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTE2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTE2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTE2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTE2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTE2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTE2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTE2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTE2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTE2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTE2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTE2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTE2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTE2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTE2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTE2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTE2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTE2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTE2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTE2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTE2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTE2R_CMP4               (0x1u<<6)
#define HRTIM_RSTE2R_CMP3               (0x1u<<5)
#define HRTIM_RSTE2R_CMP2               (0x1u<<4)
#define HRTIM_RSTE2R_CMP1               (0x1u<<3)
#define HRTIM_RSTE2R_PER                (0x1u<<2)
#define HRTIM_RSTE2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTE2R_SST                (0x1u<<0)

// EEFER1 Configuration

#define HRTIM_EEFER1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFER1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFER1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFER1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFER1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFER1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFER1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFER1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFER1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFER1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFER1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFER1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFER1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFER1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFER1_EE1LTCH            (0x1u<<0)

#define HRTIM_EEFER1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFER1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFER1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFER1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFER2 Configuration

#define HRTIM_EEFER2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFER2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFER2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFER2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFER2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFER2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFER2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFER2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFER2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFER2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFER2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFER2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFER2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFER2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFER2_EE6LTCH            (0x1u<<0)

// RSTCR Configuration

#define HRTIM_RSTCR_TIMFCMP2            (0x1u<<31)
#define HRTIM_RSTCR_TIMECMP4            (0x1u<<30)
#define HRTIM_RSTCR_TIMECMP2            (0x1u<<29)
#define HRTIM_RSTCR_TIMECMP1            (0x1u<<28)
#define HRTIM_RSTCR_TIMDCMP4            (0x1u<<27)
#define HRTIM_RSTCR_TIMDCMP2            (0x1u<<26)
#define HRTIM_RSTCR_TIMDCMP1            (0x1u<<25)
#define HRTIM_RSTCR_TIMBCMP4            (0x1u<<24)
#define HRTIM_RSTCR_TIMBCMP2            (0x1u<<23)
#define HRTIM_RSTCR_TIMBCMP1            (0x1u<<22)
#define HRTIM_RSTCR_TIMACMP4            (0x1u<<21)
#define HRTIM_RSTCR_TIMACMP2            (0x1u<<20)
#define HRTIM_RSTCR_TIMACMP1            (0x1u<<19)
#define HRTIM_RSTCR_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTCR_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTCR_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTCR_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTCR_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTCR_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTCR_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTCR_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTCR_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTCR_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTCR_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTCR_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTCR_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTCR_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTCR_MSTPER              (0x1u<<4)
#define HRTIM_RSTCR_CMP4                (0x1u<<3)
#define HRTIM_RSTCR_CMP2                (0x1u<<2)
#define HRTIM_RSTCR_UPDT                (0x1u<<1)
#define HRTIM_RSTCR_TIMFCMP1            (0x1u<<0)

// RSTER Configuration

