Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_RSTER_TIMFCMP2            (0x1u<<31)
#define HRTIM_RSTER_TIMDCMP4            (0x1u<<30)
#define HRTIM_RSTER_TIMDCMP2            (0x1u<<29)
#define HRTIM_RSTER_TIMDCMP1            (0x1u<<28)
#define HRTIM_RSTER_TIMCCMP4            (0x1u<<27)
#define HRTIM_RSTER_TIMCCMP2            (0x1u<<26)
#define HRTIM_RSTER_TIMCCMP1            (0x1u<<25)
#define HRTIM_RSTER_TIMBCMP4            (0x1u<<24)
#define HRTIM_RSTER_TIMBCMP2            (0x1u<<23)
#define HRTIM_RSTER_TIMBCMP1            (0x1u<<22)
#define HRTIM_RSTER_TIMACMP4            (0x1u<<21)
#define HRTIM_RSTER_TIMACMP2            (0x1u<<20)
#define HRTIM_RSTER_TIMACMP1            (0x1u<<19)
#define HRTIM_RSTER_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTER_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTER_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTER_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTER_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTER_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTER_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTER_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTER_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTER_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTER_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTER_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTER_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTER_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTER_MSTPER              (0x1u<<4)
#define HRTIM_RSTER_CMP4                (0x1u<<3)
#define HRTIM_RSTER_CMP2                (0x1u<<2)
#define HRTIM_RSTER_UPDT                (0x1u<<1)
#define HRTIM_RSTER_TIMFCMP1            (0x1u<<0)

// CHPER Configuration

#define HRTIM_CHPER_STRTPW              (0xFu<<7)
#define HRTIM_CHPER_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPER_CARDTY              (0x7u<<4)
#define HRTIM_CHPER_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPER_CARFRQ              (0xFu<<0)
#define HRTIM_CHPER_CARFRQ_0            (0x1u<<0)

#define HRTIM_CHPER_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPER_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPER_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPER_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPER_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPER_CARFRQ_B_0XF        (0xFu<<0)

// CPT1ECR Configuration

#define HRTIM_CPT1ECR_TFCMP2            (0x1u<<31)
#define HRTIM_CPT1ECR_TFCMP1            (0x1u<<30)
#define HRTIM_CPT1ECR_TF1RST            (0x1u<<29)
#define HRTIM_CPT1ECR_TF1SET            (0x1u<<28)
#define HRTIM_CPT1ECR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT1ECR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT1ECR_TD1RST            (0x1u<<25)
#define HRTIM_CPT1ECR_TD1SET            (0x1u<<24)
#define HRTIM_CPT1ECR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT1ECR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT1ECR_TC1RST            (0x1u<<21)
#define HRTIM_CPT1ECR_TC1SET            (0x1u<<20)
#define HRTIM_CPT1ECR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT1ECR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT1ECR_TB1RST            (0x1u<<17)
#define HRTIM_CPT1ECR_TB1SET            (0x1u<<16)
#define HRTIM_CPT1ECR_TACMP2            (0x1u<<15)
#define HRTIM_CPT1ECR_TACMP1            (0x1u<<14)
#define HRTIM_CPT1ECR_TA1RST            (0x1u<<13)
#define HRTIM_CPT1ECR_TA1SET            (0x1u<<12)
#define HRTIM_CPT1ECR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1ECR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1ECR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1ECR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1ECR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1ECR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1ECR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1ECR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1ECR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1ECR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1ECR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1ECR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1ECR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT1ECR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT1ECR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT1ECR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT1ECR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT1ECR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT1ECR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT1ECR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT1ECR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1ECR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1ECR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1ECR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1ECR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1ECR_SWCPT_B_0X1       (0x1u<<0)

// CPT2ECR Configuration

#define HRTIM_CPT2ECR_TFCMP2            (0x1u<<31)
#define HRTIM_CPT2ECR_TFCMP1            (0x1u<<30)
#define HRTIM_CPT2ECR_TF1RST            (0x1u<<29)
#define HRTIM_CPT2ECR_TF1SET            (0x1u<<28)
#define HRTIM_CPT2ECR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT2ECR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT2ECR_TD1RST            (0x1u<<25)
#define HRTIM_CPT2ECR_TD1SET            (0x1u<<24)
#define HRTIM_CPT2ECR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT2ECR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT2ECR_TC1RST            (0x1u<<21)
#define HRTIM_CPT2ECR_TC1SET            (0x1u<<20)
#define HRTIM_CPT2ECR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT2ECR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT2ECR_TB1RST            (0x1u<<17)
#define HRTIM_CPT2ECR_TB1SET            (0x1u<<16)
#define HRTIM_CPT2ECR_TACMP2            (0x1u<<15)
#define HRTIM_CPT2ECR_TACMP1            (0x1u<<14)
#define HRTIM_CPT2ECR_TA1RST            (0x1u<<13)
#define HRTIM_CPT2ECR_TA1SET            (0x1u<<12)
#define HRTIM_CPT2ECR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2ECR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2ECR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2ECR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2ECR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2ECR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2ECR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2ECR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2ECR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2ECR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2ECR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2ECR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2ECR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT2ECR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT2ECR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT2ECR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT2ECR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT2ECR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT2ECR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT2ECR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT2ECR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2ECR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2ECR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2ECR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2ECR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2ECR_SWCPT_B_0X1       (0x1u<<0)

// OUTER Configuration

