Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// TIMFCR Configuration

#define HRTIM_TIMFCR_UPDGAT             (0xFu<<28)
#define HRTIM_TIMFCR_UPDGAT_0           (0x1u<<28)
#define HRTIM_TIMFCR_PREEN              (0x1u<<27)
#define HRTIM_TIMFCR_DACSYNC            (0x3u<<25)
#define HRTIM_TIMFCR_DACSYNC_0          (0x1u<<25)
#define HRTIM_TIMFCR_MSTU               (0x1u<<24)
#define HRTIM_TIMFCR_TEU                (0x1u<<23)
#define HRTIM_TIMFCR_TDU                (0x1u<<22)
#define HRTIM_TIMFCR_TCU                (0x1u<<21)
#define HRTIM_TIMFCR_TBU                (0x1u<<20)
#define HRTIM_TIMFCR_TAU                (0x1u<<19)
#define HRTIM_TIMFCR_TFRSTU             (0x1u<<18)
#define HRTIM_TIMFCR_TFREPU             (0x1u<<17)
#define HRTIM_TIMFCR_TFU                (0x1u<<16)
#define HRTIM_TIMFCR_DELCMP4            (0x3u<<14)
#define HRTIM_TIMFCR_DELCMP4_0          (0x1u<<14)
#define HRTIM_TIMFCR_DELCMP2            (0x3u<<12)
#define HRTIM_TIMFCR_DELCMP2_0          (0x1u<<12)
#define HRTIM_TIMFCR_SYNCSTRTF          (0x1u<<11)
#define HRTIM_TIMFCR_SYNCRSTF           (0x1u<<10)
#define HRTIM_TIMFCR_RSYNCU             (0x1u<<9)
#define HRTIM_TIMFCR_INTLVD             (0x3u<<7)
#define HRTIM_TIMFCR_INTLVD_0           (0x1u<<7)
#define HRTIM_TIMFCR_PSHPLL             (0x1u<<6)
#define HRTIM_TIMFCR_HALF               (0x1u<<5)
#define HRTIM_TIMFCR_RETRIG             (0x1u<<4)
#define HRTIM_TIMFCR_CONT               (0x1u<<3)
#define HRTIM_TIMFCR_CKPSCF             (0x7u<<0)
#define HRTIM_TIMFCR_CKPSCF_0           (0x1u<<0)

#define HRTIM_TIMFCR_UPDGAT_B_0X0       (0x0u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X1       (0x1u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X2       (0x2u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X3       (0x3u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X4       (0x4u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X5       (0x5u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X6       (0x6u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X7       (0x7u<<28)
#define HRTIM_TIMFCR_UPDGAT_B_0X8       (0x8u<<28)
#define HRTIM_TIMFCR_PREEN_B_0X0        (0x0u<<27)
#define HRTIM_TIMFCR_PREEN_B_0X1        (0x1u<<27)
#define HRTIM_TIMFCR_DACSYNC_B_0X0      (0x0u<<25)
#define HRTIM_TIMFCR_DACSYNC_B_0X1      (0x1u<<25)
#define HRTIM_TIMFCR_DACSYNC_B_0X2      (0x2u<<25)
#define HRTIM_TIMFCR_DACSYNC_B_0X3      (0x3u<<25)
#define HRTIM_TIMFCR_MSTU_B_0X0         (0x0u<<24)
#define HRTIM_TIMFCR_MSTU_B_0X1         (0x1u<<24)
#define HRTIM_TIMFCR_TEU_B_0X0          (0x0u<<23)
#define HRTIM_TIMFCR_TEU_B_0X1          (0x1u<<23)
#define HRTIM_TIMFCR_TDU_B_0X0          (0x0u<<22)
#define HRTIM_TIMFCR_TDU_B_0X1          (0x1u<<22)
#define HRTIM_TIMFCR_TCU_B_0X0          (0x0u<<21)
#define HRTIM_TIMFCR_TCU_B_0X1          (0x1u<<21)
#define HRTIM_TIMFCR_TBU_B_0X0          (0x0u<<20)
#define HRTIM_TIMFCR_TBU_B_0X1          (0x1u<<20)
#define HRTIM_TIMFCR_TAU_B_0X0          (0x0u<<19)
#define HRTIM_TIMFCR_TAU_B_0X1          (0x1u<<19)
#define HRTIM_TIMFCR_TFRSTU_B_0X0       (0x0u<<18)
#define HRTIM_TIMFCR_TFRSTU_B_0X1       (0x1u<<18)
#define HRTIM_TIMFCR_TFREPU_B_0X0       (0x0u<<17)
#define HRTIM_TIMFCR_TFREPU_B_0X1       (0x1u<<17)
#define HRTIM_TIMFCR_TFU_B_0X0          (0x0u<<16)
#define HRTIM_TIMFCR_TFU_B_0X1          (0x1u<<16)
#define HRTIM_TIMFCR_DELCMP4_B_0X0      (0x0u<<14)
#define HRTIM_TIMFCR_DELCMP4_B_0X1      (0x1u<<14)
#define HRTIM_TIMFCR_DELCMP4_B_0X2      (0x2u<<14)
#define HRTIM_TIMFCR_DELCMP4_B_0X3      (0x3u<<14)
#define HRTIM_TIMFCR_DELCMP2_B_0X0      (0x0u<<12)
#define HRTIM_TIMFCR_DELCMP2_B_0X1      (0x1u<<12)
#define HRTIM_TIMFCR_DELCMP2_B_0X2      (0x2u<<12)
#define HRTIM_TIMFCR_DELCMP2_B_0X3      (0x3u<<12)
#define HRTIM_TIMFCR_SYNCSTRTF_B_0X0    (0x0u<<11)
#define HRTIM_TIMFCR_SYNCSTRTF_B_0X1    (0x1u<<11)
#define HRTIM_TIMFCR_SYNCRSTF_B_0X0     (0x0u<<10)
#define HRTIM_TIMFCR_SYNCRSTF_B_0X1     (0x1u<<10)
#define HRTIM_TIMFCR_RSYNCU_B_0X0       (0x0u<<9)
#define HRTIM_TIMFCR_RSYNCU_B_0X1       (0x1u<<9)
#define HRTIM_TIMFCR_INTLVD_B_0X0       (0x0u<<7)
#define HRTIM_TIMFCR_INTLVD_B_0X1       (0x1u<<7)
#define HRTIM_TIMFCR_INTLVD_B_0X2       (0x2u<<7)
#define HRTIM_TIMFCR_INTLVD_B_0X3       (0x3u<<7)
#define HRTIM_TIMFCR_PSHPLL_B_0X0       (0x0u<<6)
#define HRTIM_TIMFCR_PSHPLL_B_0X1       (0x1u<<6)
#define HRTIM_TIMFCR_HALF_B_0X0         (0x0u<<5)
#define HRTIM_TIMFCR_HALF_B_0X1         (0x1u<<5)
#define HRTIM_TIMFCR_RETRIG_B_0X0       (0x0u<<4)
#define HRTIM_TIMFCR_RETRIG_B_0X1       (0x1u<<4)
#define HRTIM_TIMFCR_CONT_B_0X0         (0x0u<<3)
#define HRTIM_TIMFCR_CONT_B_0X1         (0x1u<<3)

// TIMFISR Configuration

#define HRTIM_TIMFISR_O2CPY             (0x1u<<21)
#define HRTIM_TIMFISR_O1CPY             (0x1u<<20)
#define HRTIM_TIMFISR_O2STAT            (0x1u<<19)
#define HRTIM_TIMFISR_O1STAT            (0x1u<<18)
#define HRTIM_TIMFISR_IPPSTAT           (0x1u<<17)
#define HRTIM_TIMFISR_CPPSTAT           (0x1u<<16)
#define HRTIM_TIMFISR_DLYPRT            (0x1u<<14)
#define HRTIM_TIMFISR_RST               (0x1u<<13)
#define HRTIM_TIMFISR_RSTF2             (0x1u<<12)
#define HRTIM_TIMFISR_SETF2             (0x1u<<11)
#define HRTIM_TIMFISR_RSTF1             (0x1u<<10)
#define HRTIM_TIMFISR_SETF1             (0x1u<<9)
#define HRTIM_TIMFISR_CPT2              (0x1u<<8)
#define HRTIM_TIMFISR_CPT1              (0x1u<<7)
#define HRTIM_TIMFISR_UPD               (0x1u<<6)
#define HRTIM_TIMFISR_REP               (0x1u<<4)
#define HRTIM_TIMFISR_CMP4              (0x1u<<3)
#define HRTIM_TIMFISR_CMP3              (0x1u<<2)
#define HRTIM_TIMFISR_CMP2              (0x1u<<1)
#define HRTIM_TIMFISR_CMP1              (0x1u<<0)

#define HRTIM_TIMFISR_O2CPY_B_0X0       (0x0u<<21)
#define HRTIM_TIMFISR_O2CPY_B_0X1       (0x1u<<21)
#define HRTIM_TIMFISR_O1CPY_B_0X0       (0x0u<<20)
#define HRTIM_TIMFISR_O1CPY_B_0X1       (0x1u<<20)
#define HRTIM_TIMFISR_O2STAT_B_0X0      (0x0u<<19)
#define HRTIM_TIMFISR_O2STAT_B_0X1      (0x1u<<19)
#define HRTIM_TIMFISR_O1STAT_B_0X0      (0x0u<<18)
#define HRTIM_TIMFISR_O1STAT_B_0X1      (0x1u<<18)
#define HRTIM_TIMFISR_IPPSTAT_B_0X0     (0x0u<<17)
#define HRTIM_TIMFISR_IPPSTAT_B_0X1     (0x1u<<17)
#define HRTIM_TIMFISR_CPPSTAT_B_0X0     (0x0u<<16)
#define HRTIM_TIMFISR_CPPSTAT_B_0X1     (0x1u<<16)
#define HRTIM_TIMFISR_DLYPRT_B_0X0      (0x0u<<14)
#define HRTIM_TIMFISR_DLYPRT_B_0X1      (0x1u<<14)
#define HRTIM_TIMFISR_RST_B_0X0         (0x0u<<13)
#define HRTIM_TIMFISR_RST_B_0X1         (0x1u<<13)
#define HRTIM_TIMFISR_RSTF1_B_0X0       (0x0u<<10)
#define HRTIM_TIMFISR_RSTF1_B_0X1       (0x1u<<10)
#define HRTIM_TIMFISR_SETF1_B_0X0       (0x0u<<9)
#define HRTIM_TIMFISR_SETF1_B_0X1       (0x1u<<9)
#define HRTIM_TIMFISR_CPT1_B_0X0        (0x0u<<7)
#define HRTIM_TIMFISR_CPT1_B_0X1        (0x1u<<7)
#define HRTIM_TIMFISR_UPD_B_0X0         (0x0u<<6)
#define HRTIM_TIMFISR_UPD_B_0X1         (0x1u<<6)
#define HRTIM_TIMFISR_REP_B_0X0         (0x0u<<4)
#define HRTIM_TIMFISR_REP_B_0X1         (0x1u<<4)
#define HRTIM_TIMFISR_CMP1_B_0X0        (0x0u<<0)
#define HRTIM_TIMFISR_CMP1_B_0X1        (0x1u<<0)

