Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// TIMFICR Configuration

#define HRTIM_TIMFICR_DLYPRTC           (0x1u<<14)
#define HRTIM_TIMFICR_RSTC              (0x1u<<13)
#define HRTIM_TIMFICR_RSTF2C            (0x1u<<12)
#define HRTIM_TIMFICR_SETF2C            (0x1u<<11)
#define HRTIM_TIMFICR_RSTF1C            (0x1u<<10)
#define HRTIM_TIMFICR_SETF1C            (0x1u<<9)
#define HRTIM_TIMFICR_CPT2C             (0x1u<<8)
#define HRTIM_TIMFICR_CPT1C             (0x1u<<7)
#define HRTIM_TIMFICR_UPDC              (0x1u<<6)
#define HRTIM_TIMFICR_REPC              (0x1u<<4)
#define HRTIM_TIMFICR_CMP4C             (0x1u<<3)
#define HRTIM_TIMFICR_CMP3C             (0x1u<<2)
#define HRTIM_TIMFICR_CMP2C             (0x1u<<1)
#define HRTIM_TIMFICR_CMP1C             (0x1u<<0)

// TIMFDIER Configuration

#define HRTIM_TIMFDIER_DLYPRTDE         (0x1u<<30)
#define HRTIM_TIMFDIER_RSTDE            (0x1u<<29)
#define HRTIM_TIMFDIER_RSTF2DE          (0x1u<<28)
#define HRTIM_TIMFDIER_SETF2DE          (0x1u<<27)
#define HRTIM_TIMFDIER_RSTF1DE          (0x1u<<26)
#define HRTIM_TIMFDIER_SETF1DE          (0x1u<<25)
#define HRTIM_TIMFDIER_CPT2DE           (0x1u<<24)
#define HRTIM_TIMFDIER_CPT1DE           (0x1u<<23)
#define HRTIM_TIMFDIER_UPDDE            (0x1u<<22)
#define HRTIM_TIMFDIER_REPDE            (0x1u<<20)
#define HRTIM_TIMFDIER_CMP4DE           (0x1u<<19)
#define HRTIM_TIMFDIER_CMP3DE           (0x1u<<18)
#define HRTIM_TIMFDIER_CMP2DE           (0x1u<<17)
#define HRTIM_TIMFDIER_CMP1DE           (0x1u<<16)
#define HRTIM_TIMFDIER_DLYPRTIE         (0x1u<<14)
#define HRTIM_TIMFDIER_RSTIE            (0x1u<<13)
#define HRTIM_TIMFDIER_RSTF2IE          (0x1u<<12)
#define HRTIM_TIMFDIER_SETF2IE          (0x1u<<11)
#define HRTIM_TIMFDIER_RSTF1IE          (0x1u<<10)
#define HRTIM_TIMFDIER_SETF1IE          (0x1u<<9)
#define HRTIM_TIMFDIER_CPT2IE           (0x1u<<8)
#define HRTIM_TIMFDIER_CPT1IE           (0x1u<<7)
#define HRTIM_TIMFDIER_UPDIE            (0x1u<<6)
#define HRTIM_TIMFDIER_REPIE            (0x1u<<4)
#define HRTIM_TIMFDIER_CMP4IE           (0x1u<<3)
#define HRTIM_TIMFDIER_CMP3IE           (0x1u<<2)
#define HRTIM_TIMFDIER_CMP2IE           (0x1u<<1)
#define HRTIM_TIMFDIER_CMP1IE           (0x1u<<0)

#define HRTIM_TIMFDIER_DLYPRTDE_B_0X0   (0x0u<<30)
#define HRTIM_TIMFDIER_DLYPRTDE_B_0X1   (0x1u<<30)
#define HRTIM_TIMFDIER_RSTDE_B_0X0      (0x0u<<29)
#define HRTIM_TIMFDIER_RSTDE_B_0X1      (0x1u<<29)
#define HRTIM_TIMFDIER_RSTF1DE_B_0X0    (0x0u<<26)
#define HRTIM_TIMFDIER_RSTF1DE_B_0X1    (0x1u<<26)
#define HRTIM_TIMFDIER_SETF1DE_B_0X0    (0x0u<<25)
#define HRTIM_TIMFDIER_SETF1DE_B_0X1    (0x1u<<25)
#define HRTIM_TIMFDIER_CPT1DE_B_0X0     (0x0u<<23)
#define HRTIM_TIMFDIER_CPT1DE_B_0X1     (0x1u<<23)
#define HRTIM_TIMFDIER_UPDDE_B_0X0      (0x0u<<22)
#define HRTIM_TIMFDIER_UPDDE_B_0X1      (0x1u<<22)
#define HRTIM_TIMFDIER_REPDE_B_0X0      (0x0u<<20)
#define HRTIM_TIMFDIER_REPDE_B_0X1      (0x1u<<20)
#define HRTIM_TIMFDIER_CMP1DE_B_0X0     (0x0u<<16)
#define HRTIM_TIMFDIER_CMP1DE_B_0X1     (0x1u<<16)
#define HRTIM_TIMFDIER_DLYPRTIE_B_0X0   (0x0u<<14)
#define HRTIM_TIMFDIER_DLYPRTIE_B_0X1   (0x1u<<14)
#define HRTIM_TIMFDIER_RSTIE_B_0X0      (0x0u<<13)
#define HRTIM_TIMFDIER_RSTIE_B_0X1      (0x1u<<13)
#define HRTIM_TIMFDIER_RSTF1IE_B_0X0    (0x0u<<10)
#define HRTIM_TIMFDIER_RSTF1IE_B_0X1    (0x1u<<10)
#define HRTIM_TIMFDIER_SETF1IE_B_0X0    (0x0u<<9)
#define HRTIM_TIMFDIER_SETF1IE_B_0X1    (0x1u<<9)
#define HRTIM_TIMFDIER_CPT1IE_B_0X0     (0x0u<<7)
#define HRTIM_TIMFDIER_CPT1IE_B_0X1     (0x1u<<7)
#define HRTIM_TIMFDIER_UPDIE_B_0X0      (0x0u<<6)
#define HRTIM_TIMFDIER_UPDIE_B_0X1      (0x1u<<6)
#define HRTIM_TIMFDIER_REPIE_B_0X0      (0x0u<<4)
#define HRTIM_TIMFDIER_REPIE_B_0X1      (0x1u<<4)
#define HRTIM_TIMFDIER_CMP1IE_B_0X0     (0x0u<<0)
#define HRTIM_TIMFDIER_CMP1IE_B_0X1     (0x1u<<0)

// CNTFR Configuration

#define HRTIM_CNTFR_CNTF                (0xFFFFu<<0)
#define HRTIM_CNTFR_CNTF_0              (0x1u<<0)

// PERFR Configuration

#define HRTIM_PERFR_PERF                (0xFFFFu<<0)
#define HRTIM_PERFR_PERF_0              (0x1u<<0)

// REPFR Configuration

#define HRTIM_REPFR_REPF                (0xFFu<<0)
#define HRTIM_REPFR_REPF_0              (0x1u<<0)

// CMP1FR Configuration

#define HRTIM_CMP1FR_CMP1F              (0xFFFFu<<0)
#define HRTIM_CMP1FR_CMP1F_0            (0x1u<<0)

// CMP1CFR Configuration

#define HRTIM_CMP1CFR_REPF              (0xFFu<<16)
#define HRTIM_CMP1CFR_REPF_0            (0x1u<<16)
#define HRTIM_CMP1CFR_CMP1F             (0xFFFFu<<0)
#define HRTIM_CMP1CFR_CMP1F_0           (0x1u<<0)

// CMP2FR Configuration

#define HRTIM_CMP2FR_CMP2F              (0xFFFFu<<0)
#define HRTIM_CMP2FR_CMP2F_0            (0x1u<<0)

// CMP3FR Configuration

#define HRTIM_CMP3FR_CMP3F              (0xFFFFu<<0)
#define HRTIM_CMP3FR_CMP3F_0            (0x1u<<0)

// CMP4FR Configuration

#define HRTIM_CMP4FR_CMP4F              (0xFFFFu<<0)
#define HRTIM_CMP4FR_CMP4F_0            (0x1u<<0)

// CPT1FR Configuration

#define HRTIM_CPT1FR_DIR                (0x1u<<16)
#define HRTIM_CPT1FR_CPT1F              (0xFFFFu<<0)
#define HRTIM_CPT1FR_CPT1F_0            (0x1u<<0)

#define HRTIM_CPT1FR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT1FR_DIR_B_0X1          (0x1u<<16)

// CPT2FR Configuration

#define HRTIM_CPT2FR_DIR                (0x1u<<16)
#define HRTIM_CPT2FR_CPT2F              (0xFFFFu<<0)
#define HRTIM_CPT2FR_CPT2F_0            (0x1u<<0)

#define HRTIM_CPT2FR_DIR_B_0X0          (0x0u<<16)
#define HRTIM_CPT2FR_DIR_B_0X1          (0x1u<<16)

// DTFR Configuration

#define HRTIM_DTFR_DTFLKF               (0x1u<<31)
#define HRTIM_DTFR_DTFSLKF              (0x1u<<30)
#define HRTIM_DTFR_SDTFF                (0x1u<<25)
#define HRTIM_DTFR_DTFF                 (0x1FFu<<16)
#define HRTIM_DTFR_DTFF_0               (0x1u<<16)
#define HRTIM_DTFR_DTRLKF               (0x1u<<15)
#define HRTIM_DTFR_DTRSLKF              (0x1u<<14)
#define HRTIM_DTFR_DTPRSC               (0x7u<<10)
#define HRTIM_DTFR_DTPRSC_0             (0x1u<<10)
#define HRTIM_DTFR_SDTRF                (0x1u<<9)
#define HRTIM_DTFR_DTRF                 (0x1FFu<<0)
#define HRTIM_DTFR_DTRF_0               (0x1u<<0)

#define HRTIM_DTFR_DTFLKF_B_0X0         (0x0u<<31)
#define HRTIM_DTFR_DTFLKF_B_0X1         (0x1u<<31)
#define HRTIM_DTFR_DTFSLKF_B_0X0        (0x0u<<30)
#define HRTIM_DTFR_DTFSLKF_B_0X1        (0x1u<<30)
#define HRTIM_DTFR_SDTFF_B_0X0          (0x0u<<25)
#define HRTIM_DTFR_SDTFF_B_0X1          (0x1u<<25)
#define HRTIM_DTFR_DTRLKF_B_0X0         (0x0u<<15)
#define HRTIM_DTFR_DTRLKF_B_0X1         (0x1u<<15)
#define HRTIM_DTFR_DTRSLKF_B_0X0        (0x0u<<14)
#define HRTIM_DTFR_DTRSLKF_B_0X1        (0x1u<<14)
#define HRTIM_DTFR_SDTRF_B_0X0          (0x0u<<9)
#define HRTIM_DTFR_SDTRF_B_0X1          (0x1u<<9)

// SETF1R Configuration

