Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_SETF1R_UPDATE             (0x1u<<31)
#define HRTIM_SETF1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETF1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETF1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETF1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETF1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETF1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETF1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETF1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETF1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETF1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETF1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETF1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETF1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETF1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETF1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETF1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETF1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETF1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETF1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETF1R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETF1R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETF1R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETF1R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETF1R_MSTPER             (0x1u<<7)
#define HRTIM_SETF1R_CMP4               (0x1u<<6)
#define HRTIM_SETF1R_CMP3               (0x1u<<5)
#define HRTIM_SETF1R_CMP2               (0x1u<<4)
#define HRTIM_SETF1R_CMP1               (0x1u<<3)
#define HRTIM_SETF1R_PER                (0x1u<<2)
#define HRTIM_SETF1R_RESYNC             (0x1u<<1)
#define HRTIM_SETF1R_SST                (0x1u<<0)

// RSTF1R Configuration

#define HRTIM_RSTF1R_UPDATE             (0x1u<<31)
#define HRTIM_RSTF1R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTF1R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTF1R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTF1R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTF1R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTF1R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTF1R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTF1R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTF1R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTF1R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTF1R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTF1R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTF1R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTF1R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTF1R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTF1R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTF1R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTF1R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTF1R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTF1R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTF1R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTF1R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTF1R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTF1R_MSTPER             (0x1u<<7)
#define HRTIM_RSTF1R_CMP4               (0x1u<<6)
#define HRTIM_RSTF1R_CMP3               (0x1u<<5)
#define HRTIM_RSTF1R_CMP2               (0x1u<<4)
#define HRTIM_RSTF1R_CMP1               (0x1u<<3)
#define HRTIM_RSTF1R_PER                (0x1u<<2)
#define HRTIM_RSTF1R_RESYNC             (0x1u<<1)
#define HRTIM_RSTF1R_SST                (0x1u<<0)

// SETF2R Configuration

#define HRTIM_SETF2R_UPDATE             (0x1u<<31)
#define HRTIM_SETF2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_SETF2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_SETF2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_SETF2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_SETF2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_SETF2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_SETF2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_SETF2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_SETF2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_SETF2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_SETF2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_SETF2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_SETF2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_SETF2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_SETF2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_SETF2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_SETF2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_SETF2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_SETF2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_SETF2R_MSTCMP4            (0x1u<<11)
#define HRTIM_SETF2R_MSTCMP3            (0x1u<<10)
#define HRTIM_SETF2R_MSTCMP2            (0x1u<<9)
#define HRTIM_SETF2R_MSTCMP1            (0x1u<<8)
#define HRTIM_SETF2R_MSTPER             (0x1u<<7)
#define HRTIM_SETF2R_CMP4               (0x1u<<6)
#define HRTIM_SETF2R_CMP3               (0x1u<<5)
#define HRTIM_SETF2R_CMP2               (0x1u<<4)
#define HRTIM_SETF2R_CMP1               (0x1u<<3)
#define HRTIM_SETF2R_PER                (0x1u<<2)
#define HRTIM_SETF2R_RESYNC             (0x1u<<1)
#define HRTIM_SETF2R_SST                (0x1u<<0)

// RSTF2R Configuration

#define HRTIM_RSTF2R_UPDATE             (0x1u<<31)
#define HRTIM_RSTF2R_EXTEVNT10          (0x1u<<30)
#define HRTIM_RSTF2R_EXTEVNT9           (0x1u<<29)
#define HRTIM_RSTF2R_EXTEVNT8           (0x1u<<28)
#define HRTIM_RSTF2R_EXTEVNT7           (0x1u<<27)
#define HRTIM_RSTF2R_EXTEVNT6           (0x1u<<26)
#define HRTIM_RSTF2R_EXTEVNT5           (0x1u<<25)
#define HRTIM_RSTF2R_EXTEVNT4           (0x1u<<24)
#define HRTIM_RSTF2R_EXTEVNT3           (0x1u<<23)
#define HRTIM_RSTF2R_EXTEVNT2           (0x1u<<22)
#define HRTIM_RSTF2R_EXTEVNT1           (0x1u<<21)
#define HRTIM_RSTF2R_TIMEVNT9           (0x1u<<20)
#define HRTIM_RSTF2R_TIMEVNT8           (0x1u<<19)
#define HRTIM_RSTF2R_TIMEVNT7           (0x1u<<18)
#define HRTIM_RSTF2R_TIMEVNT6           (0x1u<<17)
#define HRTIM_RSTF2R_TIMEVNT5           (0x1u<<16)
#define HRTIM_RSTF2R_TIMEVNT4           (0x1u<<15)
#define HRTIM_RSTF2R_TIMEVNT3           (0x1u<<14)
#define HRTIM_RSTF2R_TIMEVNT2           (0x1u<<13)
#define HRTIM_RSTF2R_TIMEVNT1           (0x1u<<12)
#define HRTIM_RSTF2R_MSTCMP4            (0x1u<<11)
#define HRTIM_RSTF2R_MSTCMP3            (0x1u<<10)
#define HRTIM_RSTF2R_MSTCMP2            (0x1u<<9)
#define HRTIM_RSTF2R_MSTCMP1            (0x1u<<8)
#define HRTIM_RSTF2R_MSTPER             (0x1u<<7)
#define HRTIM_RSTF2R_CMP4               (0x1u<<6)
#define HRTIM_RSTF2R_CMP3               (0x1u<<5)
#define HRTIM_RSTF2R_CMP2               (0x1u<<4)
#define HRTIM_RSTF2R_CMP1               (0x1u<<3)
#define HRTIM_RSTF2R_PER                (0x1u<<2)
#define HRTIM_RSTF2R_RESYNC             (0x1u<<1)
#define HRTIM_RSTF2R_SST                (0x1u<<0)

// EEFFR1 Configuration

#define HRTIM_EEFFR1_EE5FLTR            (0xFu<<25)
#define HRTIM_EEFFR1_EE5FLTR_0          (0x1u<<25)
#define HRTIM_EEFFR1_EE5LTCH            (0x1u<<24)
#define HRTIM_EEFFR1_EE4FLTR            (0xFu<<19)
#define HRTIM_EEFFR1_EE4FLTR_0          (0x1u<<19)
#define HRTIM_EEFFR1_EE4LTCH            (0x1u<<18)
#define HRTIM_EEFFR1_EE3FLTR            (0xFu<<13)
#define HRTIM_EEFFR1_EE3FLTR_0          (0x1u<<13)
#define HRTIM_EEFFR1_EE3LTCH            (0x1u<<12)
#define HRTIM_EEFFR1_EE2FLTR            (0xFu<<7)
#define HRTIM_EEFFR1_EE2FLTR_0          (0x1u<<7)
#define HRTIM_EEFFR1_EE2LTCH            (0x1u<<6)
#define HRTIM_EEFFR1_EE1FLTR            (0xFu<<1)
#define HRTIM_EEFFR1_EE1FLTR_0          (0x1u<<1)
#define HRTIM_EEFFR1_EE1LTCH            (0x1u<<0)

