Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_EEFFR1_EE1FLTR_B_0X0      (0x0u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X1      (0x1u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X2      (0x2u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X3      (0x3u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X4      (0x4u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X5      (0x5u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X6      (0x6u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X7      (0x7u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X8      (0x8u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0X9      (0x9u<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XA      (0xAu<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XB      (0xBu<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XC      (0xCu<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XD      (0xDu<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XE      (0xEu<<1)
#define HRTIM_EEFFR1_EE1FLTR_B_0XF      (0xFu<<1)
#define HRTIM_EEFFR1_EE1LTCH_B_0X0      (0x0u<<0)
#define HRTIM_EEFFR1_EE1LTCH_B_0X1      (0x1u<<0)

// EEFFR2 Configuration

#define HRTIM_EEFFR2_EE10FLTR           (0xFu<<25)
#define HRTIM_EEFFR2_EE10FLTR_0         (0x1u<<25)
#define HRTIM_EEFFR2_EE10LTCH           (0x1u<<24)
#define HRTIM_EEFFR2_EE9FLTR            (0xFu<<19)
#define HRTIM_EEFFR2_EE9FLTR_0          (0x1u<<19)
#define HRTIM_EEFFR2_EE9LTCH            (0x1u<<18)
#define HRTIM_EEFFR2_EE8FLTR            (0xFu<<13)
#define HRTIM_EEFFR2_EE8FLTR_0          (0x1u<<13)
#define HRTIM_EEFFR2_EE8LTCH            (0x1u<<12)
#define HRTIM_EEFFR2_EE7FLTR            (0xFu<<7)
#define HRTIM_EEFFR2_EE7FLTR_0          (0x1u<<7)
#define HRTIM_EEFFR2_EE7LTCH            (0x1u<<6)
#define HRTIM_EEFFR2_EE6FLTR            (0xFu<<1)
#define HRTIM_EEFFR2_EE6FLTR_0          (0x1u<<1)
#define HRTIM_EEFFR2_EE6LTCH            (0x1u<<0)

// RSTFR Configuration

#define HRTIM_RSTFR_TIMECMP2            (0x1u<<31)
#define HRTIM_RSTFR_TIMDCMP4            (0x1u<<30)
#define HRTIM_RSTFR_TIMDCMP2            (0x1u<<29)
#define HRTIM_RSTFR_TIMDCMP1            (0x1u<<28)
#define HRTIM_RSTFR_TIMCCMP4            (0x1u<<27)
#define HRTIM_RSTFR_TIMCCMP2            (0x1u<<26)
#define HRTIM_RSTFR_TIMCCMP1            (0x1u<<25)
#define HRTIM_RSTFR_TIMBCMP4            (0x1u<<24)
#define HRTIM_RSTFR_TIMBCMP2            (0x1u<<23)
#define HRTIM_RSTFR_TIMBCMP1            (0x1u<<22)
#define HRTIM_RSTFR_TIMACMP4            (0x1u<<21)
#define HRTIM_RSTFR_TIMACMP2            (0x1u<<20)
#define HRTIM_RSTFR_TIMACMP1            (0x1u<<19)
#define HRTIM_RSTFR_EXTEVNT10           (0x1u<<18)
#define HRTIM_RSTFR_EXTEVNT9            (0x1u<<17)
#define HRTIM_RSTFR_EXTEVNT8            (0x1u<<16)
#define HRTIM_RSTFR_EXTEVNT7            (0x1u<<15)
#define HRTIM_RSTFR_EXTEVNT6            (0x1u<<14)
#define HRTIM_RSTFR_EXTEVNT5            (0x1u<<13)
#define HRTIM_RSTFR_EXTEVNT4            (0x1u<<12)
#define HRTIM_RSTFR_EXTEVNT3            (0x1u<<11)
#define HRTIM_RSTFR_EXTEVNT2            (0x1u<<10)
#define HRTIM_RSTFR_EXTEVNT1            (0x1u<<9)
#define HRTIM_RSTFR_MSTCMP4             (0x1u<<8)
#define HRTIM_RSTFR_MSTCMP3             (0x1u<<7)
#define HRTIM_RSTFR_MSTCMP2             (0x1u<<6)
#define HRTIM_RSTFR_MSTCMP1             (0x1u<<5)
#define HRTIM_RSTFR_MSTPER              (0x1u<<4)
#define HRTIM_RSTFR_CMP4                (0x1u<<3)
#define HRTIM_RSTFR_CMP2                (0x1u<<2)
#define HRTIM_RSTFR_UPDT                (0x1u<<1)
#define HRTIM_RSTFR_TIMECMP1            (0x1u<<0)

// CHPFR Configuration

#define HRTIM_CHPFR_STRTPW              (0xFu<<7)
#define HRTIM_CHPFR_STRTPW_0            (0x1u<<7)
#define HRTIM_CHPFR_CARDTY              (0x7u<<4)
#define HRTIM_CHPFR_CARDTY_0            (0x1u<<4)
#define HRTIM_CHPFR_CARFRQ              (0xFu<<0)
#define HRTIM_CHPFR_CARFRQ_0            (0x1u<<0)

#define HRTIM_CHPFR_STRTPW_B_0X0        (0x0u<<7)
#define HRTIM_CHPFR_STRTPW_B_0XF        (0xFu<<7)
#define HRTIM_CHPFR_CARDTY_B_0X0        (0x0u<<4)
#define HRTIM_CHPFR_CARDTY_B_0X7        (0x7u<<4)
#define HRTIM_CHPFR_CARFRQ_B_0X0        (0x0u<<0)
#define HRTIM_CHPFR_CARFRQ_B_0XF        (0xFu<<0)

// CPT1FCR Configuration

#define HRTIM_CPT1FCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT1FCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT1FCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT1FCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT1FCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT1FCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT1FCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT1FCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT1FCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT1FCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT1FCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT1FCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT1FCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT1FCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT1FCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT1FCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT1FCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT1FCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT1FCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT1FCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT1FCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT1FCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT1FCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT1FCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT1FCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT1FCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT1FCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT1FCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT1FCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT1FCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT1FCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT1FCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT1FCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT1FCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT1FCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT1FCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT1FCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT1FCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT1FCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT1FCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT1FCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT1FCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT1FCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT1FCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT1FCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT1FCR_SWCPT_B_0X1       (0x1u<<0)

// CPT2FCR Configuration

#define HRTIM_CPT2FCR_TECMP2            (0x1u<<31)
#define HRTIM_CPT2FCR_TECMP1            (0x1u<<30)
#define HRTIM_CPT2FCR_TE1RST            (0x1u<<29)
#define HRTIM_CPT2FCR_TE1SET            (0x1u<<28)
#define HRTIM_CPT2FCR_TDCMP2            (0x1u<<27)
#define HRTIM_CPT2FCR_TDCMP1            (0x1u<<26)
#define HRTIM_CPT2FCR_TD1RST            (0x1u<<25)
#define HRTIM_CPT2FCR_TD1SET            (0x1u<<24)
#define HRTIM_CPT2FCR_TCCMP2            (0x1u<<23)
#define HRTIM_CPT2FCR_TCCMP1            (0x1u<<22)
#define HRTIM_CPT2FCR_TC1RST            (0x1u<<21)
#define HRTIM_CPT2FCR_TC1SET            (0x1u<<20)
#define HRTIM_CPT2FCR_TBCMP2            (0x1u<<19)
#define HRTIM_CPT2FCR_TBCMP1            (0x1u<<18)
#define HRTIM_CPT2FCR_TB1RST            (0x1u<<17)
#define HRTIM_CPT2FCR_TB1SET            (0x1u<<16)
#define HRTIM_CPT2FCR_TACMP2            (0x1u<<15)
#define HRTIM_CPT2FCR_TACMP1            (0x1u<<14)
#define HRTIM_CPT2FCR_TA1RST            (0x1u<<13)
#define HRTIM_CPT2FCR_TA1SET            (0x1u<<12)
#define HRTIM_CPT2FCR_EXEV10CPT         (0x1u<<11)
#define HRTIM_CPT2FCR_EXEV9CPT          (0x1u<<10)
#define HRTIM_CPT2FCR_EXEV8CPT          (0x1u<<9)
#define HRTIM_CPT2FCR_EXEV7CPT          (0x1u<<8)
#define HRTIM_CPT2FCR_EXEV6CPT          (0x1u<<7)
#define HRTIM_CPT2FCR_EXEV5CPT          (0x1u<<6)
#define HRTIM_CPT2FCR_EXEV4CPT          (0x1u<<5)
#define HRTIM_CPT2FCR_EXEV3CPT          (0x1u<<4)
#define HRTIM_CPT2FCR_EXEV2CPT          (0x1u<<3)
#define HRTIM_CPT2FCR_EXEV1CPT          (0x1u<<2)
#define HRTIM_CPT2FCR_UPDCPT            (0x1u<<1)
#define HRTIM_CPT2FCR_SWCPT             (0x1u<<0)

#define HRTIM_CPT2FCR_TACMP2_B_0X0      (0x0u<<15)
#define HRTIM_CPT2FCR_TACMP2_B_0X1      (0x1u<<15)
#define HRTIM_CPT2FCR_TACMP1_B_0X0      (0x0u<<14)
#define HRTIM_CPT2FCR_TACMP1_B_0X1      (0x1u<<14)
#define HRTIM_CPT2FCR_TA1RST_B_0X0      (0x0u<<13)
#define HRTIM_CPT2FCR_TA1RST_B_0X1      (0x1u<<13)
#define HRTIM_CPT2FCR_TA1SET_B_0X0      (0x0u<<12)
#define HRTIM_CPT2FCR_TA1SET_B_0X1      (0x1u<<12)
#define HRTIM_CPT2FCR_EXEV1CPT_B_0X0    (0x0u<<2)
#define HRTIM_CPT2FCR_EXEV1CPT_B_0X1    (0x1u<<2)
#define HRTIM_CPT2FCR_UPDCPT_B_0X0      (0x0u<<1)
#define HRTIM_CPT2FCR_UPDCPT_B_0X1      (0x1u<<1)
#define HRTIM_CPT2FCR_SWCPT_B_0X0       (0x0u<<0)
#define HRTIM_CPT2FCR_SWCPT_B_0X1       (0x1u<<0)

