Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// OUTFR Configuration

#define HRTIM_OUTFR_DIDL2               (0x1u<<23)
#define HRTIM_OUTFR_CHP2                (0x1u<<22)
#define HRTIM_OUTFR_FAULT2              (0x3u<<20)
#define HRTIM_OUTFR_FAULT2_0            (0x1u<<20)
#define HRTIM_OUTFR_IDLES2              (0x1u<<19)
#define HRTIM_OUTFR_IDLEM2              (0x1u<<18)
#define HRTIM_OUTFR_POL2                (0x1u<<17)
#define HRTIM_OUTFR_BIAR                (0x1u<<14)
#define HRTIM_OUTFR_DLYPRT              (0x7u<<10)
#define HRTIM_OUTFR_DLYPRT_0            (0x1u<<10)
#define HRTIM_OUTFR_DLYPRTEN            (0x1u<<9)
#define HRTIM_OUTFR_DTEN                (0x1u<<8)
#define HRTIM_OUTFR_DIDL1               (0x1u<<7)
#define HRTIM_OUTFR_CHP1                (0x1u<<6)
#define HRTIM_OUTFR_FAULT1              (0x3u<<4)
#define HRTIM_OUTFR_FAULT1_0            (0x1u<<4)
#define HRTIM_OUTFR_IDLES1              (0x1u<<3)
#define HRTIM_OUTFR_IDLEM1              (0x1u<<2)
#define HRTIM_OUTFR_POL1                (0x1u<<1)

#define HRTIM_OUTFR_DIDL2_B_0X0         (0x0u<<23)
#define HRTIM_OUTFR_DIDL2_B_0X1         (0x1u<<23)
#define HRTIM_OUTFR_CHP2_B_0X0          (0x0u<<22)
#define HRTIM_OUTFR_CHP2_B_0X1          (0x1u<<22)
#define HRTIM_OUTFR_FAULT2_B_0X0        (0x0u<<20)
#define HRTIM_OUTFR_FAULT2_B_0X1        (0x1u<<20)
#define HRTIM_OUTFR_FAULT2_B_0X2        (0x2u<<20)
#define HRTIM_OUTFR_FAULT2_B_0X3        (0x3u<<20)
#define HRTIM_OUTFR_IDLES2_B_0X0        (0x0u<<19)
#define HRTIM_OUTFR_IDLES2_B_0X1        (0x1u<<19)
#define HRTIM_OUTFR_IDLEM2_B_0X0        (0x0u<<18)
#define HRTIM_OUTFR_IDLEM2_B_0X1        (0x1u<<18)
#define HRTIM_OUTFR_POL2_B_0X0          (0x0u<<17)
#define HRTIM_OUTFR_POL2_B_0X1          (0x1u<<17)
#define HRTIM_OUTFR_BIAR_B_0X0          (0x0u<<14)
#define HRTIM_OUTFR_BIAR_B_0X1          (0x1u<<14)
#define HRTIM_OUTFR_DLYPRT_B_0X0        (0x0u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X1        (0x1u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X2        (0x2u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X3        (0x3u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X4        (0x4u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X5        (0x5u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X6        (0x6u<<10)
#define HRTIM_OUTFR_DLYPRT_B_0X7        (0x7u<<10)
#define HRTIM_OUTFR_DLYPRTEN_B_0X0      (0x0u<<9)
#define HRTIM_OUTFR_DLYPRTEN_B_0X1      (0x1u<<9)
#define HRTIM_OUTFR_DTEN_B_0X0          (0x0u<<8)
#define HRTIM_OUTFR_DTEN_B_0X1          (0x1u<<8)
#define HRTIM_OUTFR_DIDL1_B_0X0         (0x0u<<7)
#define HRTIM_OUTFR_DIDL1_B_0X1         (0x1u<<7)
#define HRTIM_OUTFR_CHP1_B_0X0          (0x0u<<6)
#define HRTIM_OUTFR_CHP1_B_0X1          (0x1u<<6)
#define HRTIM_OUTFR_FAULT1_B_0X0        (0x0u<<4)
#define HRTIM_OUTFR_FAULT1_B_0X1        (0x1u<<4)
#define HRTIM_OUTFR_FAULT1_B_0X2        (0x2u<<4)
#define HRTIM_OUTFR_FAULT1_B_0X3        (0x3u<<4)
#define HRTIM_OUTFR_IDLES1_B_0X0        (0x0u<<3)
#define HRTIM_OUTFR_IDLES1_B_0X1        (0x1u<<3)
#define HRTIM_OUTFR_IDLEM1_B_0X0        (0x0u<<2)
#define HRTIM_OUTFR_IDLEM1_B_0X1        (0x1u<<2)
#define HRTIM_OUTFR_POL1_B_0X0          (0x0u<<1)
#define HRTIM_OUTFR_POL1_B_0X1          (0x1u<<1)

// FLTFR Configuration

#define HRTIM_FLTFR_FLTLCK              (0x1u<<31)
#define HRTIM_FLTFR_FLT6EN              (0x1u<<5)
#define HRTIM_FLTFR_FLT5EN              (0x1u<<4)
#define HRTIM_FLTFR_FLT4EN              (0x1u<<3)
#define HRTIM_FLTFR_FLT3EN              (0x1u<<2)
#define HRTIM_FLTFR_FLT2EN              (0x1u<<1)
#define HRTIM_FLTFR_FLT1EN              (0x1u<<0)

#define HRTIM_FLTFR_FLTLCK_B_0X0        (0x0u<<31)
#define HRTIM_FLTFR_FLTLCK_B_0X1        (0x1u<<31)
#define HRTIM_FLTFR_FLT6EN_B_0X0        (0x0u<<5)
#define HRTIM_FLTFR_FLT6EN_B_0X1        (0x1u<<5)
#define HRTIM_FLTFR_FLT5EN_B_0X0        (0x0u<<4)
#define HRTIM_FLTFR_FLT5EN_B_0X1        (0x1u<<4)
#define HRTIM_FLTFR_FLT4EN_B_0X0        (0x0u<<3)
#define HRTIM_FLTFR_FLT4EN_B_0X1        (0x1u<<3)
#define HRTIM_FLTFR_FLT3EN_B_0X0        (0x0u<<2)
#define HRTIM_FLTFR_FLT3EN_B_0X1        (0x1u<<2)
#define HRTIM_FLTFR_FLT2EN_B_0X0        (0x0u<<1)
#define HRTIM_FLTFR_FLT2EN_B_0X1        (0x1u<<1)
#define HRTIM_FLTFR_FLT1EN_B_0X0        (0x0u<<0)
#define HRTIM_FLTFR_FLT1EN_B_0X1        (0x1u<<0)

// TIMFCR2 Configuration

#define HRTIM_TIMFCR2_TRGHLF            (0x1u<<20)
#define HRTIM_TIMFCR2_GTCMP3            (0x1u<<17)
#define HRTIM_TIMFCR2_GTCMP1            (0x1u<<16)
#define HRTIM_TIMFCR2_FEROM             (0x3u<<14)
#define HRTIM_TIMFCR2_FEROM_0           (0x1u<<14)
#define HRTIM_TIMFCR2_BMROM             (0x3u<<12)
#define HRTIM_TIMFCR2_BMROM_0           (0x1u<<12)
#define HRTIM_TIMFCR2_ADROM             (0x3u<<10)
#define HRTIM_TIMFCR2_ADROM_0           (0x1u<<10)
#define HRTIM_TIMFCR2_OUTROM            (0x3u<<8)
#define HRTIM_TIMFCR2_OUTROM_0          (0x1u<<8)
#define HRTIM_TIMFCR2_ROM               (0x3u<<6)
#define HRTIM_TIMFCR2_ROM_0             (0x1u<<6)
#define HRTIM_TIMFCR2_UDM               (0x1u<<4)
#define HRTIM_TIMFCR2_DCDR              (0x1u<<2)
#define HRTIM_TIMFCR2_DCDS              (0x1u<<1)
#define HRTIM_TIMFCR2_DCDE              (0x1u<<0)

#define HRTIM_TIMFCR2_TRGHLF_B_0X0      (0x0u<<20)
#define HRTIM_TIMFCR2_TRGHLF_B_0X1      (0x1u<<20)
#define HRTIM_TIMFCR2_GTCMP3_B_0X0      (0x0u<<17)
#define HRTIM_TIMFCR2_GTCMP3_B_0X1      (0x1u<<17)
#define HRTIM_TIMFCR2_GTCMP1_B_0X0      (0x0u<<16)
#define HRTIM_TIMFCR2_GTCMP1_B_0X1      (0x1u<<16)
#define HRTIM_TIMFCR2_FEROM_B_0X0       (0x0u<<14)
#define HRTIM_TIMFCR2_FEROM_B_0X1       (0x1u<<14)
#define HRTIM_TIMFCR2_FEROM_B_0X2       (0x2u<<14)
#define HRTIM_TIMFCR2_BMROM_B_0X0       (0x0u<<12)
#define HRTIM_TIMFCR2_BMROM_B_0X1       (0x1u<<12)
#define HRTIM_TIMFCR2_BMROM_B_0X2       (0x2u<<12)
#define HRTIM_TIMFCR2_ADROM_B_0X0       (0x0u<<10)
#define HRTIM_TIMFCR2_ADROM_B_0X1       (0x1u<<10)
#define HRTIM_TIMFCR2_ADROM_B_0X2       (0x2u<<10)
#define HRTIM_TIMFCR2_OUTROM_B_0X0      (0x0u<<8)
#define HRTIM_TIMFCR2_OUTROM_B_0X1      (0x1u<<8)
#define HRTIM_TIMFCR2_OUTROM_B_0X2      (0x2u<<8)
#define HRTIM_TIMFCR2_ROM_B_0X0         (0x0u<<6)
#define HRTIM_TIMFCR2_ROM_B_0X1         (0x1u<<6)
#define HRTIM_TIMFCR2_ROM_B_0X2         (0x2u<<6)
#define HRTIM_TIMFCR2_UDM_B_0X0         (0x0u<<4)
#define HRTIM_TIMFCR2_UDM_B_0X1         (0x1u<<4)
#define HRTIM_TIMFCR2_DCDR_B_0X0        (0x0u<<2)
#define HRTIM_TIMFCR2_DCDR_B_0X1        (0x1u<<2)
#define HRTIM_TIMFCR2_DCDS_B_0X0        (0x0u<<1)
#define HRTIM_TIMFCR2_DCDS_B_0X1        (0x1u<<1)
#define HRTIM_TIMFCR2_DCDE_B_0X0        (0x0u<<0)
#define HRTIM_TIMFCR2_DCDE_B_0X1        (0x1u<<0)

// TIMFEEFR3 Configuration

