Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_TIMFEEFR3_EEVACNT         (0x3Fu<<8)
#define HRTIM_TIMFEEFR3_EEVACNT_0       (0x1u<<8)
#define HRTIM_TIMFEEFR3_EEVASEL         (0xFu<<4)
#define HRTIM_TIMFEEFR3_EEVASEL_0       (0x1u<<4)
#define HRTIM_TIMFEEFR3_EEVARSTM        (0x1u<<2)
#define HRTIM_TIMFEEFR3_EEVACRES        (0x1u<<1)
#define HRTIM_TIMFEEFR3_EEVACE          (0x1u<<0)

#define HRTIM_TIMFEEFR3_EEVASEL_B_0X0   (0x0u<<4)
#define HRTIM_TIMFEEFR3_EEVASEL_B_0X1   (0x1u<<4)
#define HRTIM_TIMFEEFR3_EEVARSTM_B_0X0  (0x0u<<2)
#define HRTIM_TIMFEEFR3_EEVARSTM_B_0X1  (0x1u<<2)
#define HRTIM_TIMFEEFR3_EEVACRES_B_0X0  (0x0u<<1)
#define HRTIM_TIMFEEFR3_EEVACRES_B_0X1  (0x1u<<1)
#define HRTIM_TIMFEEFR3_EEVACE_B_0X0    (0x0u<<0)
#define HRTIM_TIMFEEFR3_EEVACE_B_0X1    (0x1u<<0)

// CR1 Configuration

#define HRTIM_CR1_AD4USRC               (0x7u<<25)
#define HRTIM_CR1_AD4USRC_0             (0x1u<<25)
#define HRTIM_CR1_AD3USRC               (0x7u<<22)
#define HRTIM_CR1_AD3USRC_0             (0x1u<<22)
#define HRTIM_CR1_AD2USRC               (0x7u<<19)
#define HRTIM_CR1_AD2USRC_0             (0x1u<<19)
#define HRTIM_CR1_AD1USRC               (0x7u<<16)
#define HRTIM_CR1_AD1USRC_0             (0x1u<<16)
#define HRTIM_CR1_TFUDIS                (0x1u<<6)
#define HRTIM_CR1_TEUDIS                (0x1u<<5)
#define HRTIM_CR1_TDUDIS                (0x1u<<4)
#define HRTIM_CR1_TCUDIS                (0x1u<<3)
#define HRTIM_CR1_TBUDIS                (0x1u<<2)
#define HRTIM_CR1_TAUDIS                (0x1u<<1)
#define HRTIM_CR1_MUDIS                 (0x1u<<0)

#define HRTIM_CR1_AD1USRC_B_0X0         (0x0u<<16)
#define HRTIM_CR1_AD1USRC_B_0X1         (0x1u<<16)
#define HRTIM_CR1_AD1USRC_B_0X2         (0x2u<<16)
#define HRTIM_CR1_AD1USRC_B_0X3         (0x3u<<16)
#define HRTIM_CR1_AD1USRC_B_0X4         (0x4u<<16)
#define HRTIM_CR1_AD1USRC_B_0X5         (0x5u<<16)
#define HRTIM_CR1_AD1USRC_B_0X6         (0x6u<<16)
#define HRTIM_CR1_TAUDIS_B_0X0          (0x0u<<1)
#define HRTIM_CR1_TAUDIS_B_0X1          (0x1u<<1)
#define HRTIM_CR1_MUDIS_B_0X0           (0x0u<<0)
#define HRTIM_CR1_MUDIS_B_0X1           (0x1u<<0)

// CR2 Configuration

#define HRTIM_CR2_DBSS                  (0x7u<<24)
#define HRTIM_CR2_DBSS_0                (0x1u<<24)
#define HRTIM_CR2_SWPF                  (0x1u<<21)
#define HRTIM_CR2_SWPE                  (0x1u<<20)
#define HRTIM_CR2_SWPD                  (0x1u<<19)
#define HRTIM_CR2_SWPC                  (0x1u<<18)
#define HRTIM_CR2_SWPB                  (0x1u<<17)
#define HRTIM_CR2_SWPA                  (0x1u<<16)
#define HRTIM_CR2_TFRST                 (0x1u<<14)
#define HRTIM_CR2_TERST                 (0x1u<<13)
#define HRTIM_CR2_TDRST                 (0x1u<<12)
#define HRTIM_CR2_TCRST                 (0x1u<<11)
#define HRTIM_CR2_TBRST                 (0x1u<<10)
#define HRTIM_CR2_TARST                 (0x1u<<9)
#define HRTIM_CR2_MRST                  (0x1u<<8)
#define HRTIM_CR2_TFSWU                 (0x1u<<6)
#define HRTIM_CR2_TESWU                 (0x1u<<5)
#define HRTIM_CR2_TDSWU                 (0x1u<<4)
#define HRTIM_CR2_TCSWU                 (0x1u<<3)
#define HRTIM_CR2_TBSWU                 (0x1u<<2)
#define HRTIM_CR2_TASWU                 (0x1u<<1)
#define HRTIM_CR2_MSWU                  (0x1u<<0)

#define HRTIM_CR2_DBSS_B_0X1            (0x1u<<24)
#define HRTIM_CR2_DBSS_B_0X2            (0x2u<<24)
#define HRTIM_CR2_DBSS_B_0X3            (0x3u<<24)
#define HRTIM_CR2_DBSS_B_0X4            (0x4u<<24)
#define HRTIM_CR2_DBSS_B_0X5            (0x5u<<24)
#define HRTIM_CR2_DBSS_B_0X6            (0x6u<<24)
#define HRTIM_CR2_DBSS_B_0X7            (0x7u<<24)
#define HRTIM_CR2_SWPA_B_0X0            (0x0u<<16)
#define HRTIM_CR2_SWPA_B_0X1            (0x1u<<16)

// ISR Configuration

#define HRTIM_ISR_BMPER                 (0x1u<<17)
#define HRTIM_ISR_FLT6                  (0x1u<<6)
#define HRTIM_ISR_SYSFLT                (0x1u<<5)
#define HRTIM_ISR_FLT5                  (0x1u<<4)
#define HRTIM_ISR_FLT4                  (0x1u<<3)
#define HRTIM_ISR_FLT3                  (0x1u<<2)
#define HRTIM_ISR_FLT2                  (0x1u<<1)
#define HRTIM_ISR_FLT1                  (0x1u<<0)

#define HRTIM_ISR_BMPER_B_0X0           (0x0u<<17)
#define HRTIM_ISR_BMPER_B_0X1           (0x1u<<17)
#define HRTIM_ISR_FLT1_B_0X0            (0x0u<<0)
#define HRTIM_ISR_FLT1_B_0X1            (0x1u<<0)

// ICR Configuration

#define HRTIM_ICR_BMPERC                (0x1u<<17)
#define HRTIM_ICR_FLT6C                 (0x1u<<6)
#define HRTIM_ICR_SYSFLTC               (0x1u<<5)
#define HRTIM_ICR_FLT5C                 (0x1u<<4)
#define HRTIM_ICR_FLT4C                 (0x1u<<3)
#define HRTIM_ICR_FLT3C                 (0x1u<<2)
#define HRTIM_ICR_FLT2C                 (0x1u<<1)
#define HRTIM_ICR_FLT1C                 (0x1u<<0)

// IER Configuration

#define HRTIM_IER_BMPERIE               (0x1u<<17)
#define HRTIM_IER_FLT6IE                (0x1u<<6)
#define HRTIM_IER_SYSFLTIE              (0x1u<<5)
#define HRTIM_IER_FLT5IE                (0x1u<<4)
#define HRTIM_IER_FLT4IE                (0x1u<<3)
#define HRTIM_IER_FLT3IE                (0x1u<<2)
#define HRTIM_IER_FLT2IE                (0x1u<<1)
#define HRTIM_IER_FLT1IE                (0x1u<<0)

#define HRTIM_IER_BMPERIE_B_0X0         (0x0u<<17)
#define HRTIM_IER_BMPERIE_B_0X1         (0x1u<<17)
#define HRTIM_IER_FLT1IE_B_0X0          (0x0u<<0)
#define HRTIM_IER_FLT1IE_B_0X1          (0x1u<<0)

// OENR Configuration

#define HRTIM_OENR_TF2OEN               (0x1u<<11)
#define HRTIM_OENR_TF1OEN               (0x1u<<10)
#define HRTIM_OENR_TE2OEN               (0x1u<<9)
#define HRTIM_OENR_TE1OEN               (0x1u<<8)
#define HRTIM_OENR_TD2OEN               (0x1u<<7)
#define HRTIM_OENR_TD1OEN               (0x1u<<6)
#define HRTIM_OENR_TC2OEN               (0x1u<<5)
#define HRTIM_OENR_TC1OEN               (0x1u<<4)
#define HRTIM_OENR_TB2OEN               (0x1u<<3)
#define HRTIM_OENR_TB1OEN               (0x1u<<2)
#define HRTIM_OENR_TA2OEN               (0x1u<<1)
#define HRTIM_OENR_TA1OEN               (0x1u<<0)

#define HRTIM_OENR_TA1OEN_B_0X0         (0x0u<<0)
#define HRTIM_OENR_TA1OEN_B_0X1         (0x1u<<0)

// ODISR Configuration

#define HRTIM_ODISR_TF2ODIS             (0x1u<<11)
#define HRTIM_ODISR_TF1ODIS             (0x1u<<10)
#define HRTIM_ODISR_TE2ODIS             (0x1u<<9)
#define HRTIM_ODISR_TE1ODIS             (0x1u<<8)
#define HRTIM_ODISR_TD2ODIS             (0x1u<<7)
#define HRTIM_ODISR_TD1ODIS             (0x1u<<6)
#define HRTIM_ODISR_TC2ODIS             (0x1u<<5)
#define HRTIM_ODISR_TC1ODIS             (0x1u<<4)
#define HRTIM_ODISR_TB2ODIS             (0x1u<<3)
#define HRTIM_ODISR_TB1ODIS             (0x1u<<2)
#define HRTIM_ODISR_TA2ODIS             (0x1u<<1)
#define HRTIM_ODISR_TA1ODIS             (0x1u<<0)

// ODSR Configuration

#define HRTIM_ODSR_TF2ODS               (0x1u<<11)
#define HRTIM_ODSR_TF1ODS               (0x1u<<10)
#define HRTIM_ODSR_TE2ODS               (0x1u<<9)
#define HRTIM_ODSR_TE1ODS               (0x1u<<8)
#define HRTIM_ODSR_TD2ODS               (0x1u<<7)
#define HRTIM_ODSR_TD1ODS               (0x1u<<6)
#define HRTIM_ODSR_TC2ODS               (0x1u<<5)
#define HRTIM_ODSR_TC1ODS               (0x1u<<4)
#define HRTIM_ODSR_TB2ODS               (0x1u<<3)
#define HRTIM_ODSR_TB1ODS               (0x1u<<2)
#define HRTIM_ODSR_TA2ODS               (0x1u<<1)
#define HRTIM_ODSR_TA1ODS               (0x1u<<0)

#define HRTIM_ODSR_TA1ODS_B_0X0         (0x0u<<0)
#define HRTIM_ODSR_TA1ODS_B_0X1         (0x1u<<0)

// BMCR Configuration

#define HRTIM_BMCR_BMSTAT               (0x1u<<31)
#define HRTIM_BMCR_TFBM                 (0x1u<<22)
#define HRTIM_BMCR_TEBM                 (0x1u<<21)
#define HRTIM_BMCR_TDBM                 (0x1u<<20)
#define HRTIM_BMCR_TCBM                 (0x1u<<19)
#define HRTIM_BMCR_TBBM                 (0x1u<<18)
#define HRTIM_BMCR_TABM                 (0x1u<<17)
#define HRTIM_BMCR_MTBM                 (0x1u<<16)
#define HRTIM_BMCR_BMPREN               (0x1u<<10)
#define HRTIM_BMCR_BMPRSC               (0xFu<<6)
#define HRTIM_BMCR_BMPRSC_0             (0x1u<<6)
#define HRTIM_BMCR_BMCLK                (0xFu<<2)
#define HRTIM_BMCR_BMCLK_0              (0x1u<<2)
#define HRTIM_BMCR_BMOM                 (0x1u<<1)
#define HRTIM_BMCR_BME                  (0x1u<<0)

