Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
#define HRTIM_BMCR_BMSTAT_B_0X0         (0x0u<<31)
#define HRTIM_BMCR_BMSTAT_B_0X1         (0x1u<<31)
#define HRTIM_BMCR_TABM_B_0X0           (0x0u<<17)
#define HRTIM_BMCR_TABM_B_0X1           (0x1u<<17)
#define HRTIM_BMCR_MTBM_B_0X0           (0x0u<<16)
#define HRTIM_BMCR_MTBM_B_0X1           (0x1u<<16)
#define HRTIM_BMCR_BMPREN_B_0X0         (0x0u<<10)
#define HRTIM_BMCR_BMPREN_B_0X1         (0x1u<<10)
#define HRTIM_BMCR_BMPRSC_B_0X0         (0x0u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X1         (0x1u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X2         (0x2u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X3         (0x3u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X4         (0x4u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X5         (0x5u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X6         (0x6u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X7         (0x7u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X8         (0x8u<<6)
#define HRTIM_BMCR_BMPRSC_B_0X9         (0x9u<<6)
#define HRTIM_BMCR_BMPRSC_B_0XA         (0xAu<<6)
#define HRTIM_BMCR_BMPRSC_B_0XB         (0xBu<<6)
#define HRTIM_BMCR_BMPRSC_B_0XC         (0xCu<<6)
#define HRTIM_BMCR_BMPRSC_B_0XD         (0xDu<<6)
#define HRTIM_BMCR_BMPRSC_B_0XE         (0xEu<<6)
#define HRTIM_BMCR_BMPRSC_B_0XF         (0xFu<<6)
#define HRTIM_BMCR_BMCLK_B_0X0          (0x0u<<2)
#define HRTIM_BMCR_BMCLK_B_0X1          (0x1u<<2)
#define HRTIM_BMCR_BMCLK_B_0X2          (0x2u<<2)
#define HRTIM_BMCR_BMCLK_B_0X3          (0x3u<<2)
#define HRTIM_BMCR_BMCLK_B_0X4          (0x4u<<2)
#define HRTIM_BMCR_BMCLK_B_0X5          (0x5u<<2)
#define HRTIM_BMCR_BMCLK_B_0X6          (0x6u<<2)
#define HRTIM_BMCR_BMCLK_B_0X7          (0x7u<<2)
#define HRTIM_BMCR_BMCLK_B_0X8          (0x8u<<2)
#define HRTIM_BMCR_BMCLK_B_0X9          (0x9u<<2)
#define HRTIM_BMCR_BMCLK_B_0XA          (0xAu<<2)
#define HRTIM_BMCR_BMCLK_B_0XB          (0xBu<<2)
#define HRTIM_BMCR_BMOM_B_0X0           (0x0u<<1)
#define HRTIM_BMCR_BMOM_B_0X1           (0x1u<<1)
#define HRTIM_BMCR_BME_B_0X0            (0x0u<<0)
#define HRTIM_BMCR_BME_B_0X1            (0x1u<<0)

// BMTRGR Configuration

#define HRTIM_BMTRGR_OCHPEV             (0x1u<<31)
#define HRTIM_BMTRGR_EEV8               (0x1u<<30)
#define HRTIM_BMTRGR_EEV7               (0x1u<<29)
#define HRTIM_BMTRGR_TDEEV8             (0x1u<<28)
#define HRTIM_BMTRGR_TAEEV7             (0x1u<<27)
#define HRTIM_BMTRGR_TECMP2             (0x1u<<26)
#define HRTIM_BMTRGR_TECMP1             (0x1u<<25)
#define HRTIM_BMTRGR_TEREP              (0x1u<<24)
#define HRTIM_BMTRGR_TFCMP1             (0x1u<<23)
#define HRTIM_BMTRGR_TDCMP2             (0x1u<<22)
#define HRTIM_BMTRGR_TFREP              (0x1u<<21)
#define HRTIM_BMTRGR_TDREP              (0x1u<<20)
#define HRTIM_BMTRGR_TDRST              (0x1u<<19)
#define HRTIM_BMTRGR_TFRST              (0x1u<<18)
#define HRTIM_BMTRGR_TCCMP1             (0x1u<<17)
#define HRTIM_BMTRGR_TCREP              (0x1u<<16)
#define HRTIM_BMTRGR_TCRST              (0x1u<<15)
#define HRTIM_BMTRGR_TBCMP2             (0x1u<<14)
#define HRTIM_BMTRGR_TBCMP1             (0x1u<<13)
#define HRTIM_BMTRGR_TBREP              (0x1u<<12)
#define HRTIM_BMTRGR_TBRST              (0x1u<<11)
#define HRTIM_BMTRGR_TACMP2             (0x1u<<10)
#define HRTIM_BMTRGR_TACMP1             (0x1u<<9)
#define HRTIM_BMTRGR_TAREP              (0x1u<<8)
#define HRTIM_BMTRGR_TARST              (0x1u<<7)
#define HRTIM_BMTRGR_MSTCMP4            (0x1u<<6)
#define HRTIM_BMTRGR_MSTCMP3            (0x1u<<5)
#define HRTIM_BMTRGR_MSTCMP2            (0x1u<<4)
#define HRTIM_BMTRGR_MSTCMP1            (0x1u<<3)
#define HRTIM_BMTRGR_MSTREP             (0x1u<<2)
#define HRTIM_BMTRGR_MSTRST             (0x1u<<1)
#define HRTIM_BMTRGR_SW                 (0x1u<<0)

// BMCMPR Configuration

#define HRTIM_BMCMPR_BMCMP              (0xFFFFu<<0)
#define HRTIM_BMCMPR_BMCMP_0            (0x1u<<0)

// BMPER Configuration

#define HRTIM_BMPER_BMPER               (0xFFFFu<<0)
#define HRTIM_BMPER_BMPER_0             (0x1u<<0)

// EECR1 Configuration

#define HRTIM_EECR1_EE5FAST             (0x1u<<29)
#define HRTIM_EECR1_EE5SNS              (0x3u<<27)
#define HRTIM_EECR1_EE5SNS_0            (0x1u<<27)
#define HRTIM_EECR1_EE5POL              (0x1u<<26)
#define HRTIM_EECR1_EE5SRC              (0x3u<<24)
#define HRTIM_EECR1_EE5SRC_0            (0x1u<<24)
#define HRTIM_EECR1_EE4FAST             (0x1u<<23)
#define HRTIM_EECR1_EE4SNS              (0x3u<<21)
#define HRTIM_EECR1_EE4SNS_0            (0x1u<<21)
#define HRTIM_EECR1_EE4POL              (0x1u<<20)
#define HRTIM_EECR1_EE4SRC              (0x3u<<18)
#define HRTIM_EECR1_EE4SRC_0            (0x1u<<18)
#define HRTIM_EECR1_EE3FAST             (0x1u<<17)
#define HRTIM_EECR1_EE3SNS              (0x3u<<15)
#define HRTIM_EECR1_EE3SNS_0            (0x1u<<15)
#define HRTIM_EECR1_EE3POL              (0x1u<<14)
#define HRTIM_EECR1_EE3SRC              (0x3u<<12)
#define HRTIM_EECR1_EE3SRC_0            (0x1u<<12)
#define HRTIM_EECR1_EE2FAST             (0x1u<<11)
#define HRTIM_EECR1_EE2SNS              (0x3u<<9)
#define HRTIM_EECR1_EE2SNS_0            (0x1u<<9)
#define HRTIM_EECR1_EE2POL              (0x1u<<8)
#define HRTIM_EECR1_EE2SRC              (0x3u<<6)
#define HRTIM_EECR1_EE2SRC_0            (0x1u<<6)
#define HRTIM_EECR1_EE1FAST             (0x1u<<5)
#define HRTIM_EECR1_EE1SNS              (0x3u<<3)
#define HRTIM_EECR1_EE1SNS_0            (0x1u<<3)
#define HRTIM_EECR1_EE1POL              (0x1u<<2)
#define HRTIM_EECR1_EE1SRC              (0x3u<<0)
#define HRTIM_EECR1_EE1SRC_0            (0x1u<<0)

#define HRTIM_EECR1_EE1FAST_B_0X0       (0x0u<<5)
#define HRTIM_EECR1_EE1FAST_B_0X1       (0x1u<<5)
#define HRTIM_EECR1_EE1SNS_B_0X0        (0x0u<<3)
#define HRTIM_EECR1_EE1SNS_B_0X1        (0x1u<<3)
#define HRTIM_EECR1_EE1SNS_B_0X2        (0x2u<<3)
#define HRTIM_EECR1_EE1SNS_B_0X3        (0x3u<<3)
#define HRTIM_EECR1_EE1POL_B_0X0        (0x0u<<2)
#define HRTIM_EECR1_EE1POL_B_0X1        (0x1u<<2)
#define HRTIM_EECR1_EE1SRC_B_0X0        (0x0u<<0)
#define HRTIM_EECR1_EE1SRC_B_0X1        (0x1u<<0)
#define HRTIM_EECR1_EE1SRC_B_0X2        (0x2u<<0)
#define HRTIM_EECR1_EE1SRC_B_0X3        (0x3u<<0)

