Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// EECR2 Configuration

#define HRTIM_EECR2_EE10SNS             (0x3u<<27)
#define HRTIM_EECR2_EE10SNS_0           (0x1u<<27)
#define HRTIM_EECR2_EE10POL             (0x1u<<26)
#define HRTIM_EECR2_EE10SRC             (0x3u<<24)
#define HRTIM_EECR2_EE10SRC_0           (0x1u<<24)
#define HRTIM_EECR2_EE9SNS              (0x3u<<21)
#define HRTIM_EECR2_EE9SNS_0            (0x1u<<21)
#define HRTIM_EECR2_EE9POL              (0x1u<<20)
#define HRTIM_EECR2_EE9SRC              (0x3u<<18)
#define HRTIM_EECR2_EE9SRC_0            (0x1u<<18)
#define HRTIM_EECR2_EE8SNS              (0x3u<<15)
#define HRTIM_EECR2_EE8SNS_0            (0x1u<<15)
#define HRTIM_EECR2_EE8POL              (0x1u<<14)
#define HRTIM_EECR2_EE8SRC              (0x3u<<12)
#define HRTIM_EECR2_EE8SRC_0            (0x1u<<12)
#define HRTIM_EECR2_EE7SNS              (0x3u<<9)
#define HRTIM_EECR2_EE7SNS_0            (0x1u<<9)
#define HRTIM_EECR2_EE7POL              (0x1u<<8)
#define HRTIM_EECR2_EE7SRC              (0x3u<<6)
#define HRTIM_EECR2_EE7SRC_0            (0x1u<<6)
#define HRTIM_EECR2_EE6SNS              (0x3u<<3)
#define HRTIM_EECR2_EE6SNS_0            (0x1u<<3)
#define HRTIM_EECR2_EE6POL              (0x1u<<2)
#define HRTIM_EECR2_EE6SRC              (0x3u<<0)
#define HRTIM_EECR2_EE6SRC_0            (0x1u<<0)

// EECR3 Configuration

#define HRTIM_EECR3_EEVSD               (0x3u<<30)
#define HRTIM_EECR3_EEVSD_0             (0x1u<<30)
#define HRTIM_EECR3_EE10F               (0xFu<<24)
#define HRTIM_EECR3_EE10F_0             (0x1u<<24)
#define HRTIM_EECR3_EE9F                (0xFu<<18)
#define HRTIM_EECR3_EE9F_0              (0x1u<<18)
#define HRTIM_EECR3_EE8F                (0xFu<<12)
#define HRTIM_EECR3_EE8F_0              (0x1u<<12)
#define HRTIM_EECR3_EE7F                (0xFu<<6)
#define HRTIM_EECR3_EE7F_0              (0x1u<<6)
#define HRTIM_EECR3_EE6F                (0xFu<<0)
#define HRTIM_EECR3_EE6F_0              (0x1u<<0)

#define HRTIM_EECR3_EEVSD_B_0X0         (0x0u<<30)
#define HRTIM_EECR3_EEVSD_B_0X1         (0x1u<<30)
#define HRTIM_EECR3_EEVSD_B_0X2         (0x2u<<30)
#define HRTIM_EECR3_EEVSD_B_0X3         (0x3u<<30)
#define HRTIM_EECR3_EE6F_B_0X0          (0x0u<<0)
#define HRTIM_EECR3_EE6F_B_0X1          (0x1u<<0)
#define HRTIM_EECR3_EE6F_B_0X2          (0x2u<<0)
#define HRTIM_EECR3_EE6F_B_0X3          (0x3u<<0)
#define HRTIM_EECR3_EE6F_B_0X4          (0x4u<<0)
#define HRTIM_EECR3_EE6F_B_0X5          (0x5u<<0)
#define HRTIM_EECR3_EE6F_B_0X6          (0x6u<<0)
#define HRTIM_EECR3_EE6F_B_0X7          (0x7u<<0)
#define HRTIM_EECR3_EE6F_B_0X8          (0x8u<<0)
#define HRTIM_EECR3_EE6F_B_0X9          (0x9u<<0)
#define HRTIM_EECR3_EE6F_B_0XA          (0xAu<<0)
#define HRTIM_EECR3_EE6F_B_0XB          (0xBu<<0)
#define HRTIM_EECR3_EE6F_B_0XC          (0xCu<<0)
#define HRTIM_EECR3_EE6F_B_0XD          (0xDu<<0)
#define HRTIM_EECR3_EE6F_B_0XE          (0xEu<<0)
#define HRTIM_EECR3_EE6F_B_0XF          (0xFu<<0)

// ADC1R Configuration

#define HRTIM_ADC1R_ADC1TEPER           (0x1u<<31)
#define HRTIM_ADC1R_ADC1TEC4            (0x1u<<30)
#define HRTIM_ADC1R_ADC1TEC3            (0x1u<<29)
#define HRTIM_ADC1R_ADC1TFRST           (0x1u<<28)
#define HRTIM_ADC1R_ADC1TDPER           (0x1u<<27)
#define HRTIM_ADC1R_ADC1TDC4            (0x1u<<26)
#define HRTIM_ADC1R_ADC1TDC3            (0x1u<<25)
#define HRTIM_ADC1R_ADC1TFPER           (0x1u<<24)
#define HRTIM_ADC1R_ADC1TCPER           (0x1u<<23)
#define HRTIM_ADC1R_ADC1TCC4            (0x1u<<22)
#define HRTIM_ADC1R_ADC1TCC3            (0x1u<<21)
#define HRTIM_ADC1R_ADC1TFC4            (0x1u<<20)
#define HRTIM_ADC1R_ADC1TBRST           (0x1u<<19)
#define HRTIM_ADC1R_ADC1TBPER           (0x1u<<18)
#define HRTIM_ADC1R_ADC1TBC4            (0x1u<<17)
#define HRTIM_ADC1R_ADC1TBC3            (0x1u<<16)
#define HRTIM_ADC1R_ADC1TFC3            (0x1u<<15)
#define HRTIM_ADC1R_ADC1TARST           (0x1u<<14)
#define HRTIM_ADC1R_ADC1TAPER           (0x1u<<13)
#define HRTIM_ADC1R_ADC1TAC4            (0x1u<<12)
#define HRTIM_ADC1R_ADC1TAC3            (0x1u<<11)
#define HRTIM_ADC1R_ADC1TFC2            (0x1u<<10)
#define HRTIM_ADC1R_ADC1EEV5            (0x1u<<9)
#define HRTIM_ADC1R_ADC1EEV4            (0x1u<<8)
#define HRTIM_ADC1R_ADC1EEV3            (0x1u<<7)
#define HRTIM_ADC1R_ADC1EEV2            (0x1u<<6)
#define HRTIM_ADC1R_ADC1EEV1            (0x1u<<5)
#define HRTIM_ADC1R_ADC1MPER            (0x1u<<4)
#define HRTIM_ADC1R_ADC1MC4             (0x1u<<3)
#define HRTIM_ADC1R_ADC1MC3             (0x1u<<2)
#define HRTIM_ADC1R_ADC1MC2             (0x1u<<1)
#define HRTIM_ADC1R_ADC1MC1             (0x1u<<0)

// ADC2R Configuration

#define HRTIM_ADC2R_ADC2TERST           (0x1u<<31)
#define HRTIM_ADC2R_ADC2TEC4            (0x1u<<30)
#define HRTIM_ADC2R_ADC2TEC3            (0x1u<<29)
#define HRTIM_ADC2R_ADC2TEC2            (0x1u<<28)
#define HRTIM_ADC2R_ADC2TDRST           (0x1u<<27)
#define HRTIM_ADC2R_ADC2TDPER           (0x1u<<26)
#define HRTIM_ADC2R_ADC2TDC4            (0x1u<<25)
#define HRTIM_ADC2R_ADC2TFPER           (0x1u<<24)
#define HRTIM_ADC2R_ADC2TDC2            (0x1u<<23)
#define HRTIM_ADC2R_ADC2TCRST           (0x1u<<22)
#define HRTIM_ADC2R_ADC2TCPER           (0x1u<<21)
#define HRTIM_ADC2R_ADC2TCC4            (0x1u<<20)
#define HRTIM_ADC2R_ADC2TFC4            (0x1u<<19)
#define HRTIM_ADC2R_ADC2TCC2            (0x1u<<18)
#define HRTIM_ADC2R_ADC2TBPER           (0x1u<<17)
#define HRTIM_ADC2R_ADC2TBC4            (0x1u<<16)
#define HRTIM_ADC2R_ADC2TFC3            (0x1u<<15)
#define HRTIM_ADC2R_ADC2TBC2            (0x1u<<14)
#define HRTIM_ADC2R_ADC2TAPER           (0x1u<<13)
#define HRTIM_ADC2R_ADC2TAC4            (0x1u<<12)
#define HRTIM_ADC2R_ADC2TFC2            (0x1u<<11)
#define HRTIM_ADC2R_ADC2TAC2            (0x1u<<10)
#define HRTIM_ADC2R_ADC2EEV10           (0x1u<<9)
#define HRTIM_ADC2R_ADC2EEV9            (0x1u<<8)
#define HRTIM_ADC2R_ADC2EEV8            (0x1u<<7)
#define HRTIM_ADC2R_ADC2EEV7            (0x1u<<6)
#define HRTIM_ADC2R_ADC2EEV6            (0x1u<<5)
#define HRTIM_ADC2R_ADC2MPER            (0x1u<<4)
#define HRTIM_ADC2R_ADC2MC4             (0x1u<<3)
#define HRTIM_ADC2R_ADC2MC3             (0x1u<<2)
#define HRTIM_ADC2R_ADC2MC2             (0x1u<<1)
#define HRTIM_ADC2R_ADC2MC1             (0x1u<<0)

// ADC3R Configuration

#define HRTIM_ADC3R_ADC3TEPER           (0x1u<<31)
#define HRTIM_ADC3R_ADC3TEC4            (0x1u<<30)
#define HRTIM_ADC3R_ADC3TEC3            (0x1u<<29)
#define HRTIM_ADC3R_ADC3TFRST           (0x1u<<28)
#define HRTIM_ADC3R_ADC3TDPER           (0x1u<<27)
#define HRTIM_ADC3R_ADC3TDC4            (0x1u<<26)
#define HRTIM_ADC3R_ADC3TDC3            (0x1u<<25)
#define HRTIM_ADC3R_ADC3TFPER           (0x1u<<24)
#define HRTIM_ADC3R_ADC3TCPER           (0x1u<<23)
#define HRTIM_ADC3R_ADC3TCC4            (0x1u<<22)
#define HRTIM_ADC3R_ADC3TCC3            (0x1u<<21)
#define HRTIM_ADC3R_ADC3TFC4            (0x1u<<20)
#define HRTIM_ADC3R_ADC3TBRST           (0x1u<<19)
#define HRTIM_ADC3R_ADC3TBPER           (0x1u<<18)
#define HRTIM_ADC3R_ADC3TBC4            (0x1u<<17)
#define HRTIM_ADC3R_ADC3TBC3            (0x1u<<16)
#define HRTIM_ADC3R_ADC3TFC3            (0x1u<<15)
#define HRTIM_ADC3R_ADC3TARST           (0x1u<<14)
#define HRTIM_ADC3R_ADC3TAPER           (0x1u<<13)
#define HRTIM_ADC3R_ADC3TAC4            (0x1u<<12)
#define HRTIM_ADC3R_ADC3TAC3            (0x1u<<11)
#define HRTIM_ADC3R_ADC3TFC2            (0x1u<<10)
#define HRTIM_ADC3R_ADC3EEV5            (0x1u<<9)
#define HRTIM_ADC3R_ADC3EEV4            (0x1u<<8)
#define HRTIM_ADC3R_ADC3EEV3            (0x1u<<7)
#define HRTIM_ADC3R_ADC3EEV2            (0x1u<<6)
#define HRTIM_ADC3R_ADC3EEV1            (0x1u<<5)
#define HRTIM_ADC3R_ADC3MPER            (0x1u<<4)
#define HRTIM_ADC3R_ADC3MC4             (0x1u<<3)
#define HRTIM_ADC3R_ADC3MC3             (0x1u<<2)
#define HRTIM_ADC3R_ADC3MC2             (0x1u<<1)
#define HRTIM_ADC3R_ADC3MC1             (0x1u<<0)

// ADC4R Configuration

#define HRTIM_ADC4R_ADC4TERST           (0x1u<<31)
#define HRTIM_ADC4R_ADC4TEC4            (0x1u<<30)
#define HRTIM_ADC4R_ADC4TEC3            (0x1u<<29)
#define HRTIM_ADC4R_ADC4TEC2            (0x1u<<28)
#define HRTIM_ADC4R_ADC4TDRST           (0x1u<<27)
#define HRTIM_ADC4R_ADC4TDPER           (0x1u<<26)
#define HRTIM_ADC4R_ADC4TDC4            (0x1u<<25)
#define HRTIM_ADC4R_ADC4TFPER           (0x1u<<24)
#define HRTIM_ADC4R_ADC4TDC2            (0x1u<<23)
#define HRTIM_ADC4R_ADC4TCRST           (0x1u<<22)
#define HRTIM_ADC4R_ADC4TCPER           (0x1u<<21)
#define HRTIM_ADC4R_ADC4TCC4            (0x1u<<20)
#define HRTIM_ADC4R_ADC4TFC4            (0x1u<<19)
#define HRTIM_ADC4R_ADC4TCC2            (0x1u<<18)
#define HRTIM_ADC4R_ADC4TBPER           (0x1u<<17)
#define HRTIM_ADC4R_ADC4TBC4            (0x1u<<16)
#define HRTIM_ADC4R_ADC4TFC3            (0x1u<<15)
#define HRTIM_ADC4R_ADC4TBC2            (0x1u<<14)
#define HRTIM_ADC4R_ADC4TAPER           (0x1u<<13)
#define HRTIM_ADC4R_ADC4TAC4            (0x1u<<12)
#define HRTIM_ADC4R_ADC4TFC2            (0x1u<<11)
#define HRTIM_ADC4R_ADC4TAC2            (0x1u<<10)
#define HRTIM_ADC4R_ADC4EEV10           (0x1u<<9)
#define HRTIM_ADC4R_ADC4EEV9            (0x1u<<8)
#define HRTIM_ADC4R_ADC4EEV8            (0x1u<<7)
#define HRTIM_ADC4R_ADC4EEV7            (0x1u<<6)
#define HRTIM_ADC4R_ADC4EEV6            (0x1u<<5)
#define HRTIM_ADC4R_ADC4MPER            (0x1u<<4)
#define HRTIM_ADC4R_ADC4MC4             (0x1u<<3)
#define HRTIM_ADC4R_ADC4MC3             (0x1u<<2)
#define HRTIM_ADC4R_ADC4MC2             (0x1u<<1)
#define HRTIM_ADC4R_ADC4MC1             (0x1u<<0)

// FLTINR1 Configuration

#define HRTIM_FLTINR1_FLT4LCK           (0x1u<<31)
#define HRTIM_FLTINR1_FLT4F             (0xFu<<27)
#define HRTIM_FLTINR1_FLT4F_0           (0x1u<<27)
#define HRTIM_FLTINR1_FLT4SRC           (0x1u<<26)
#define HRTIM_FLTINR1_FLT4P             (0x1u<<25)
#define HRTIM_FLTINR1_FLT4E             (0x1u<<24)
#define HRTIM_FLTINR1_FLT3LCK           (0x1u<<23)
#define HRTIM_FLTINR1_FLT3F             (0xFu<<19)
#define HRTIM_FLTINR1_FLT3F_0           (0x1u<<19)
#define HRTIM_FLTINR1_FLT3SRC           (0x1u<<18)
#define HRTIM_FLTINR1_FLT3P             (0x1u<<17)
#define HRTIM_FLTINR1_FLT3E             (0x1u<<16)
#define HRTIM_FLTINR1_FLT2LCK           (0x1u<<15)
#define HRTIM_FLTINR1_FLT2F             (0xFu<<11)
#define HRTIM_FLTINR1_FLT2F_0           (0x1u<<11)
#define HRTIM_FLTINR1_FLT2SRC           (0x1u<<10)
#define HRTIM_FLTINR1_FLT2P             (0x1u<<9)
#define HRTIM_FLTINR1_FLT2E             (0x1u<<8)
#define HRTIM_FLTINR1_FLT1LCK           (0x1u<<7)
#define HRTIM_FLTINR1_FLT1F             (0xFu<<3)
#define HRTIM_FLTINR1_FLT1F_0           (0x1u<<3)
#define HRTIM_FLTINR1_FLT1SRC           (0x1u<<2)
#define HRTIM_FLTINR1_FLT1P             (0x1u<<1)
#define HRTIM_FLTINR1_FLT1E             (0x1u<<0)

// FLTINR2 Configuration

#define HRTIM_FLTINR2_FLTSD             (0x3u<<24)
#define HRTIM_FLTINR2_FLTSD_0           (0x1u<<24)
#define HRTIM_FLTINR2_FLT6SRC_1         (0x1u<<21)
#define HRTIM_FLTINR2_FLT5SRC_1         (0x1u<<20)
#define HRTIM_FLTINR2_FLT4SRC           (0x1u<<19)
#define HRTIM_FLTINR2_FLT3SRC           (0x1u<<18)
#define HRTIM_FLTINR2_FLT2SRC           (0x1u<<17)
#define HRTIM_FLTINR2_FLT1SRC           (0x1u<<16)
#define HRTIM_FLTINR2_FLT6LCK           (0x1u<<15)
#define HRTIM_FLTINR2_FLT6F             (0xFu<<11)
#define HRTIM_FLTINR2_FLT6F_0           (0x1u<<11)
#define HRTIM_FLTINR2_FLT6SRC           (0x1u<<10)
#define HRTIM_FLTINR2_FLT6P             (0x1u<<9)
#define HRTIM_FLTINR2_FLT6E             (0x1u<<8)
#define HRTIM_FLTINR2_FLT5LCK           (0x1u<<7)
#define HRTIM_FLTINR2_FLT5F             (0xFu<<3)
#define HRTIM_FLTINR2_FLT5F_0           (0x1u<<3)
#define HRTIM_FLTINR2_FLT5SRC           (0x1u<<2)
#define HRTIM_FLTINR2_FLT5P             (0x1u<<1)
#define HRTIM_FLTINR2_FLT5E             (0x1u<<0)

#define HRTIM_FLTINR2_FLTSD_B_0X0       (0x0u<<24)
#define HRTIM_FLTINR2_FLTSD_B_0X1       (0x1u<<24)
#define HRTIM_FLTINR2_FLTSD_B_0X2       (0x2u<<24)
#define HRTIM_FLTINR2_FLTSD_B_0X3       (0x3u<<24)
#define HRTIM_FLTINR2_FLT5LCK_B_0X0     (0x0u<<7)
#define HRTIM_FLTINR2_FLT5LCK_B_0X1     (0x1u<<7)
#define HRTIM_FLTINR2_FLT5F_B_0X0       (0x0u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X1       (0x1u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X2       (0x2u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X3       (0x3u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X4       (0x4u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X5       (0x5u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X6       (0x6u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X7       (0x7u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X8       (0x8u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0X9       (0x9u<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XA       (0xAu<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XB       (0xBu<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XC       (0xCu<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XD       (0xDu<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XE       (0xEu<<3)
#define HRTIM_FLTINR2_FLT5F_B_0XF       (0xFu<<3)
#define HRTIM_FLTINR2_FLT5SRC_B_0X0     (0x0u<<2)
#define HRTIM_FLTINR2_FLT5P_B_0X0       (0x0u<<1)
#define HRTIM_FLTINR2_FLT5P_B_0X1       (0x1u<<1)
#define HRTIM_FLTINR2_FLT5E_B_0X0       (0x0u<<0)
#define HRTIM_FLTINR2_FLT5E_B_0X1       (0x1u<<0)

// BDMUPR Configuration

#define HRTIM_BDMUPR_MCMP4              (0x1u<<9)
#define HRTIM_BDMUPR_MCMP3              (0x1u<<8)
#define HRTIM_BDMUPR_MCMP2              (0x1u<<7)
#define HRTIM_BDMUPR_MCMP1              (0x1u<<6)
#define HRTIM_BDMUPR_MREP               (0x1u<<5)
#define HRTIM_BDMUPR_MPER               (0x1u<<4)
#define HRTIM_BDMUPR_MCNT               (0x1u<<3)
#define HRTIM_BDMUPR_MDIER              (0x1u<<2)
#define HRTIM_BDMUPR_MICR               (0x1u<<1)
#define HRTIM_BDMUPR_MCR                (0x1u<<0)

#define HRTIM_BDMUPR_MCR_B_0X0          (0x0u<<0)
#define HRTIM_BDMUPR_MCR_B_0X1          (0x1u<<0)

