Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// BDTAUPR Configuration

#define HRTIM_BDTAUPR_TIMAEEFR3         (0x1u<<22)
#define HRTIM_BDTAUPR_TIMACR2           (0x1u<<21)
#define HRTIM_BDTAUPR_TIMAFLTR          (0x1u<<20)
#define HRTIM_BDTAUPR_TIMAOUTR          (0x1u<<19)
#define HRTIM_BDTAUPR_TIMACHPR          (0x1u<<18)
#define HRTIM_BDTAUPR_TIMARSTR          (0x1u<<17)
#define HRTIM_BDTAUPR_TIMAEEFR2         (0x1u<<16)
#define HRTIM_BDTAUPR_TIMAEEFR1         (0x1u<<15)
#define HRTIM_BDTAUPR_TIMARST2R         (0x1u<<14)
#define HRTIM_BDTAUPR_TIMASET2R         (0x1u<<13)
#define HRTIM_BDTAUPR_TIMARST1R         (0x1u<<12)
#define HRTIM_BDTAUPR_TIMASET1R         (0x1u<<11)
#define HRTIM_BDTAUPR_TIMADTR           (0x1u<<10)
#define HRTIM_BDTAUPR_TIMACMP4          (0x1u<<9)
#define HRTIM_BDTAUPR_TIMACMP3          (0x1u<<8)
#define HRTIM_BDTAUPR_TIMACMP2          (0x1u<<7)
#define HRTIM_BDTAUPR_TIMACMP1          (0x1u<<6)
#define HRTIM_BDTAUPR_TIMAREP           (0x1u<<5)
#define HRTIM_BDTAUPR_TIMAPER           (0x1u<<4)
#define HRTIM_BDTAUPR_TIMACNT           (0x1u<<3)
#define HRTIM_BDTAUPR_TIMADIER          (0x1u<<2)
#define HRTIM_BDTAUPR_TIMAICR           (0x1u<<1)
#define HRTIM_BDTAUPR_TIMACR            (0x1u<<0)

#define HRTIM_BDTAUPR_TIMACR_B_0X0      (0x0u<<0)
#define HRTIM_BDTAUPR_TIMACR_B_0X1      (0x1u<<0)

// BDTBUPR Configuration

#define HRTIM_BDTBUPR_TIMBEEFR3         (0x1u<<22)
#define HRTIM_BDTBUPR_TIMBCR2           (0x1u<<21)
#define HRTIM_BDTBUPR_TIMBFLTR          (0x1u<<20)
#define HRTIM_BDTBUPR_TIMBOUTR          (0x1u<<19)
#define HRTIM_BDTBUPR_TIMBCHPR          (0x1u<<18)
#define HRTIM_BDTBUPR_TIMBRSTR          (0x1u<<17)
#define HRTIM_BDTBUPR_TIMBEEFR2         (0x1u<<16)
#define HRTIM_BDTBUPR_TIMBEEFR1         (0x1u<<15)
#define HRTIM_BDTBUPR_TIMBRST2R         (0x1u<<14)
#define HRTIM_BDTBUPR_TIMBSET2R         (0x1u<<13)
#define HRTIM_BDTBUPR_TIMBRST1R         (0x1u<<12)
#define HRTIM_BDTBUPR_TIMBSET1R         (0x1u<<11)
#define HRTIM_BDTBUPR_TIMBDTR           (0x1u<<10)
#define HRTIM_BDTBUPR_TIMBCMP4          (0x1u<<9)
#define HRTIM_BDTBUPR_TIMBCMP3          (0x1u<<8)
#define HRTIM_BDTBUPR_TIMBCMP2          (0x1u<<7)
#define HRTIM_BDTBUPR_TIMBCMP1          (0x1u<<6)
#define HRTIM_BDTBUPR_TIMBREP           (0x1u<<5)
#define HRTIM_BDTBUPR_TIMBPER           (0x1u<<4)
#define HRTIM_BDTBUPR_TIMBCNT           (0x1u<<3)
#define HRTIM_BDTBUPR_TIMBDIER          (0x1u<<2)
#define HRTIM_BDTBUPR_TIMBICR           (0x1u<<1)
#define HRTIM_BDTBUPR_TIMBCR            (0x1u<<0)

#define HRTIM_BDTBUPR_TIMBCR_B_0X0      (0x0u<<0)
#define HRTIM_BDTBUPR_TIMBCR_B_0X1      (0x1u<<0)

// BDTCUPR Configuration

#define HRTIM_BDTCUPR_TIMCEEFR3         (0x1u<<22)
#define HRTIM_BDTCUPR_TIMCCR2           (0x1u<<21)
#define HRTIM_BDTCUPR_TIMCFLTR          (0x1u<<20)
#define HRTIM_BDTCUPR_TIMCOUTR          (0x1u<<19)
#define HRTIM_BDTCUPR_TIMCCHPR          (0x1u<<18)
#define HRTIM_BDTCUPR_TIMCRSTR          (0x1u<<17)
#define HRTIM_BDTCUPR_TIMCEEFR2         (0x1u<<16)
#define HRTIM_BDTCUPR_TIMCEEFR1         (0x1u<<15)
#define HRTIM_BDTCUPR_TIMCRST2R         (0x1u<<14)
#define HRTIM_BDTCUPR_TIMCSET2R         (0x1u<<13)
#define HRTIM_BDTCUPR_TIMCRST1R         (0x1u<<12)
#define HRTIM_BDTCUPR_TIMCSET1R         (0x1u<<11)
#define HRTIM_BDTCUPR_TIMCDTR           (0x1u<<10)
#define HRTIM_BDTCUPR_TIMCCMP4          (0x1u<<9)
#define HRTIM_BDTCUPR_TIMCCMP3          (0x1u<<8)
#define HRTIM_BDTCUPR_TIMCCMP2          (0x1u<<7)
#define HRTIM_BDTCUPR_TIMCCMP1          (0x1u<<6)
#define HRTIM_BDTCUPR_TIMCREP           (0x1u<<5)
#define HRTIM_BDTCUPR_TIMCPER           (0x1u<<4)
#define HRTIM_BDTCUPR_TIMCCNT           (0x1u<<3)
#define HRTIM_BDTCUPR_TIMCDIER          (0x1u<<2)
#define HRTIM_BDTCUPR_TIMCICR           (0x1u<<1)
#define HRTIM_BDTCUPR_TIMCCR            (0x1u<<0)

#define HRTIM_BDTCUPR_TIMCCR_B_0X0      (0x0u<<0)
#define HRTIM_BDTCUPR_TIMCCR_B_0X1      (0x1u<<0)

// BDTDUPR Configuration

#define HRTIM_BDTDUPR_TIMDEEFR3         (0x1u<<22)
#define HRTIM_BDTDUPR_TIMDCR2           (0x1u<<21)
#define HRTIM_BDTDUPR_TIMDFLTR          (0x1u<<20)
#define HRTIM_BDTDUPR_TIMDOUTR          (0x1u<<19)
#define HRTIM_BDTDUPR_TIMDCHPR          (0x1u<<18)
#define HRTIM_BDTDUPR_TIMDRSTR          (0x1u<<17)
#define HRTIM_BDTDUPR_TIMDEEFR2         (0x1u<<16)
#define HRTIM_BDTDUPR_TIMDEEFR1         (0x1u<<15)
#define HRTIM_BDTDUPR_TIMDRST2R         (0x1u<<14)
#define HRTIM_BDTDUPR_TIMDSET2R         (0x1u<<13)
#define HRTIM_BDTDUPR_TIMDRST1R         (0x1u<<12)
#define HRTIM_BDTDUPR_TIMDSET1R         (0x1u<<11)
#define HRTIM_BDTDUPR_TIMDDTR           (0x1u<<10)
#define HRTIM_BDTDUPR_TIMDCMP4          (0x1u<<9)
#define HRTIM_BDTDUPR_TIMDCMP3          (0x1u<<8)
#define HRTIM_BDTDUPR_TIMDCMP2          (0x1u<<7)
#define HRTIM_BDTDUPR_TIMDCMP1          (0x1u<<6)
#define HRTIM_BDTDUPR_TIMDREP           (0x1u<<5)
#define HRTIM_BDTDUPR_TIMDPER           (0x1u<<4)
#define HRTIM_BDTDUPR_TIMDCNT           (0x1u<<3)
#define HRTIM_BDTDUPR_TIMDDIER          (0x1u<<2)
#define HRTIM_BDTDUPR_TIMDICR           (0x1u<<1)
#define HRTIM_BDTDUPR_TIMDCR            (0x1u<<0)

#define HRTIM_BDTDUPR_TIMDCR_B_0X0      (0x0u<<0)
#define HRTIM_BDTDUPR_TIMDCR_B_0X1      (0x1u<<0)

// BDTEUPR Configuration

#define HRTIM_BDTEUPR_TIMEEEFR3         (0x1u<<22)
#define HRTIM_BDTEUPR_TIMECR2           (0x1u<<21)
#define HRTIM_BDTEUPR_TIMEFLTR          (0x1u<<20)
#define HRTIM_BDTEUPR_TIMEOUTR          (0x1u<<19)
#define HRTIM_BDTEUPR_TIMECHPR          (0x1u<<18)
#define HRTIM_BDTEUPR_TIMERSTR          (0x1u<<17)
#define HRTIM_BDTEUPR_TIMEEEFR2         (0x1u<<16)
#define HRTIM_BDTEUPR_TIMEEEFR1         (0x1u<<15)
#define HRTIM_BDTEUPR_TIMERST2R         (0x1u<<14)
#define HRTIM_BDTEUPR_TIMESET2R         (0x1u<<13)
#define HRTIM_BDTEUPR_TIMERST1R         (0x1u<<12)
#define HRTIM_BDTEUPR_TIMESET1R         (0x1u<<11)
#define HRTIM_BDTEUPR_TIMEDTR           (0x1u<<10)
#define HRTIM_BDTEUPR_TIMECMP4          (0x1u<<9)
#define HRTIM_BDTEUPR_TIMECMP3          (0x1u<<8)
#define HRTIM_BDTEUPR_TIMECMP2          (0x1u<<7)
#define HRTIM_BDTEUPR_TIMECMP1          (0x1u<<6)
#define HRTIM_BDTEUPR_TIMEREP           (0x1u<<5)
#define HRTIM_BDTEUPR_TIMEPER           (0x1u<<4)
#define HRTIM_BDTEUPR_TIMECNT           (0x1u<<3)
#define HRTIM_BDTEUPR_TIMEDIER          (0x1u<<2)
#define HRTIM_BDTEUPR_TIMEICR           (0x1u<<1)
#define HRTIM_BDTEUPR_TIMECR            (0x1u<<0)

#define HRTIM_BDTEUPR_TIMECR_B_0X0      (0x0u<<0)
#define HRTIM_BDTEUPR_TIMECR_B_0X1      (0x1u<<0)

// BDMADR Configuration

#define HRTIM_BDMADR_BDMADR             (0xFFFFFFFFu<<0)
#define HRTIM_BDMADR_BDMADR_0           (0x1u<<0)

