Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hrtim.h
// BDTFUPR Configuration

#define HRTIM_BDTFUPR_TIMFEEFR3         (0x1u<<22)
#define HRTIM_BDTFUPR_TIMFCR2           (0x1u<<21)
#define HRTIM_BDTFUPR_TIMFFLTR          (0x1u<<20)
#define HRTIM_BDTFUPR_TIMFOUTR          (0x1u<<19)
#define HRTIM_BDTFUPR_TIMFCHPR          (0x1u<<18)
#define HRTIM_BDTFUPR_TIMFRSTR          (0x1u<<17)
#define HRTIM_BDTFUPR_TIMFEEFR2         (0x1u<<16)
#define HRTIM_BDTFUPR_TIMFEEFR1         (0x1u<<15)
#define HRTIM_BDTFUPR_TIMFRST2R         (0x1u<<14)
#define HRTIM_BDTFUPR_TIMFSET2R         (0x1u<<13)
#define HRTIM_BDTFUPR_TIMFRST1R         (0x1u<<12)
#define HRTIM_BDTFUPR_TIMFSET1R         (0x1u<<11)
#define HRTIM_BDTFUPR_TIMFDTR           (0x1u<<10)
#define HRTIM_BDTFUPR_TIMFCMP4          (0x1u<<9)
#define HRTIM_BDTFUPR_TIMFCMP3          (0x1u<<8)
#define HRTIM_BDTFUPR_TIMFCMP2          (0x1u<<7)
#define HRTIM_BDTFUPR_TIMFCMP1          (0x1u<<6)
#define HRTIM_BDTFUPR_TIMFREP           (0x1u<<5)
#define HRTIM_BDTFUPR_TIMFPER           (0x1u<<4)
#define HRTIM_BDTFUPR_TIMFCNT           (0x1u<<3)
#define HRTIM_BDTFUPR_TIMFDIER          (0x1u<<2)
#define HRTIM_BDTFUPR_TIMFICR           (0x1u<<1)
#define HRTIM_BDTFUPR_TIMFCR            (0x1u<<0)

#define HRTIM_BDTFUPR_TIMFCR_B_0X0      (0x0u<<0)
#define HRTIM_BDTFUPR_TIMFCR_B_0X1      (0x1u<<0)

// ADCER Configuration

#define HRTIM_ADCER_ADC10TRG            (0x1Fu<<26)
#define HRTIM_ADCER_ADC10TRG_0          (0x1u<<26)
#define HRTIM_ADCER_ADC9TRG             (0x1Fu<<21)
#define HRTIM_ADCER_ADC9TRG_0           (0x1u<<21)
#define HRTIM_ADCER_ADC8TRG             (0x1Fu<<16)
#define HRTIM_ADCER_ADC8TRG_0           (0x1u<<16)
#define HRTIM_ADCER_ADC7TRG             (0x1Fu<<10)
#define HRTIM_ADCER_ADC7TRG_0           (0x1u<<10)
#define HRTIM_ADCER_ADC6TRG             (0x1Fu<<5)
#define HRTIM_ADCER_ADC6TRG_0           (0x1u<<5)
#define HRTIM_ADCER_ADC5TRG             (0x1Fu<<0)
#define HRTIM_ADCER_ADC5TRG_0           (0x1u<<0)

#define HRTIM_ADCER_ADC6TRG_B_0X0       (0x0u<<5)
#define HRTIM_ADCER_ADC6TRG_B_0X1       (0x1u<<5)
#define HRTIM_ADCER_ADC6TRG_B_0X2       (0x2u<<5)
#define HRTIM_ADCER_ADC6TRG_B_0X3       (0x3u<<5)
#define HRTIM_ADCER_ADC5TRG_B_0X0       (0x0u<<0)
#define HRTIM_ADCER_ADC5TRG_B_0X1       (0x1u<<0)
#define HRTIM_ADCER_ADC5TRG_B_0X2       (0x2u<<0)
#define HRTIM_ADCER_ADC5TRG_B_0X3       (0x3u<<0)

// ADCUR Configuration

#define HRTIM_ADCUR_AD10USRC            (0x7u<<20)
#define HRTIM_ADCUR_AD10USRC_0          (0x1u<<20)
#define HRTIM_ADCUR_AD9USRC             (0x7u<<16)
#define HRTIM_ADCUR_AD9USRC_0           (0x1u<<16)
#define HRTIM_ADCUR_AD8USRC             (0x7u<<12)
#define HRTIM_ADCUR_AD8USRC_0           (0x1u<<12)
#define HRTIM_ADCUR_AD7USRC             (0x7u<<8)
#define HRTIM_ADCUR_AD7USRC_0           (0x1u<<8)
#define HRTIM_ADCUR_AD6USRC             (0x7u<<4)
#define HRTIM_ADCUR_AD6USRC_0           (0x1u<<4)
#define HRTIM_ADCUR_AD5USRC             (0x7u<<0)
#define HRTIM_ADCUR_AD5USRC_0           (0x1u<<0)

#define HRTIM_ADCUR_AD5USRC_B_0X0       (0x0u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X1       (0x1u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X2       (0x2u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X3       (0x3u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X4       (0x4u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X5       (0x5u<<0)
#define HRTIM_ADCUR_AD5USRC_B_0X6       (0x6u<<0)

// ADCPS1 Configuration

#define HRTIM_ADCPS1_ADC5PSC            (0x1Fu<<24)
#define HRTIM_ADCPS1_ADC5PSC_0          (0x1u<<24)
#define HRTIM_ADCPS1_ADC4PSC            (0x1Fu<<18)
#define HRTIM_ADCPS1_ADC4PSC_0          (0x1u<<18)
#define HRTIM_ADCPS1_ADC3PSC            (0x1Fu<<12)
#define HRTIM_ADCPS1_ADC3PSC_0          (0x1u<<12)
#define HRTIM_ADCPS1_ADC2PSC            (0x1Fu<<6)
#define HRTIM_ADCPS1_ADC2PSC_0          (0x1u<<6)
#define HRTIM_ADCPS1_ADC1PSC            (0x1Fu<<0)
#define HRTIM_ADCPS1_ADC1PSC_0          (0x1u<<0)

// ADCPS2 Configuration

#define HRTIM_ADCPS2_ADC10PSC           (0x1Fu<<24)
#define HRTIM_ADCPS2_ADC10PSC_0         (0x1u<<24)
#define HRTIM_ADCPS2_ADC9PSC            (0x1Fu<<18)
#define HRTIM_ADCPS2_ADC9PSC_0          (0x1u<<18)
#define HRTIM_ADCPS2_ADC8PSC            (0x1Fu<<12)
#define HRTIM_ADCPS2_ADC8PSC_0          (0x1u<<12)
#define HRTIM_ADCPS2_ADC7PSC            (0x1Fu<<6)
#define HRTIM_ADCPS2_ADC7PSC_0          (0x1u<<6)
#define HRTIM_ADCPS2_ADC6PSC            (0x1Fu<<0)
#define HRTIM_ADCPS2_ADC6PSC_0          (0x1u<<0)

// FLTINR3 Configuration

#define HRTIM_FLTINR3_FLT4RSTM          (0x1u<<31)
#define HRTIM_FLTINR3_FLT4CRES          (0x1u<<30)
#define HRTIM_FLTINR3_FLT4CNT           (0xFu<<26)
#define HRTIM_FLTINR3_FLT4CNT_0         (0x1u<<26)
#define HRTIM_FLTINR3_FLT4BLKS          (0x1u<<25)
#define HRTIM_FLTINR3_FLT4BLKE          (0x1u<<24)
#define HRTIM_FLTINR3_FLT3RSTM          (0x1u<<23)
#define HRTIM_FLTINR3_FLT3CRES          (0x1u<<22)
#define HRTIM_FLTINR3_FLT3CNT           (0xFu<<18)
#define HRTIM_FLTINR3_FLT3CNT_0         (0x1u<<18)
#define HRTIM_FLTINR3_FLT3BLKS          (0x1u<<17)
#define HRTIM_FLTINR3_FLT3BLKE          (0x1u<<16)
#define HRTIM_FLTINR3_FLT2RSTM          (0x1u<<15)
#define HRTIM_FLTINR3_FLT2CRES          (0x1u<<14)
#define HRTIM_FLTINR3_FLT2CNT           (0xFu<<10)
#define HRTIM_FLTINR3_FLT2CNT_0         (0x1u<<10)
#define HRTIM_FLTINR3_FLT2BLKS          (0x1u<<9)
#define HRTIM_FLTINR3_FLT2BLKE          (0x1u<<8)
#define HRTIM_FLTINR3_FLT1RSTM          (0x1u<<7)
#define HRTIM_FLTINR3_FLT1CRES          (0x1u<<6)
#define HRTIM_FLTINR3_FLT1CNT           (0xFu<<2)
#define HRTIM_FLTINR3_FLT1CNT_0         (0x1u<<2)
#define HRTIM_FLTINR3_FLT1BLKS          (0x1u<<1)
#define HRTIM_FLTINR3_FLT1BLKE          (0x1u<<0)

// FLTINR4 Configuration

#define HRTIM_FLTINR4_FLT6RSTM          (0x1u<<15)
#define HRTIM_FLTINR4_FLT6CRES          (0x1u<<14)
#define HRTIM_FLTINR4_FLT6CNT           (0xFu<<10)
#define HRTIM_FLTINR4_FLT6CNT_0         (0x1u<<10)
#define HRTIM_FLTINR4_FLT6BLKS          (0x1u<<9)
#define HRTIM_FLTINR4_FLT6BLKE          (0x1u<<8)
#define HRTIM_FLTINR4_FLT5RSTM          (0x1u<<7)
#define HRTIM_FLTINR4_FLT5CRES          (0x1u<<6)
#define HRTIM_FLTINR4_FLT5CNT           (0xFu<<2)
#define HRTIM_FLTINR4_FLT5CNT_0         (0x1u<<2)
#define HRTIM_FLTINR4_FLT5BLKS          (0x1u<<1)
#define HRTIM_FLTINR4_FLT5BLKE          (0x1u<<0)

#define HRTIM_FLTINR4_FLT5RSTM_B_0X0    (0x0u<<7)
#define HRTIM_FLTINR4_FLT5RSTM_B_0X1    (0x1u<<7)
#define HRTIM_FLTINR4_FLT5CRES_B_0X0    (0x0u<<6)
#define HRTIM_FLTINR4_FLT5CRES_B_0X1    (0x1u<<6)
#define HRTIM_FLTINR4_FLT5BLKS_B_0X0    (0x0u<<1)
#define HRTIM_FLTINR4_FLT5BLKS_B_0X1    (0x1u<<1)
#define HRTIM_FLTINR4_FLT5BLKE_B_0X0    (0x0u<<0)
#define HRTIM_FLTINR4_FLT5BLKE_B_0X1    (0x1u<<0)
